{
    "news": [
        {
            "title": "I envision a better Nigeria post-#EndSARS protests  Lai Mohammed",
            "link": "https://guardian.ng/news/i-envision-a-better-nigeria-post-endsars-protests-lai-mohammed/",
            "description": "The Minister of Information and Culture, Alhaji Lai Mohammed, says he envisions a better Nigeria where fundamental human rights of people will be respected after the #EndSARS protests.\nThe post I envision a better Nigeria post-#EndSARS protests  Lai Mohammed appeared first on The Guardian Nigeria News - Nigeria and World News.",
            "timestamp": 1603135177.0,
            "image": null,
            "author": "Guardian Nigeria"
        },
        {
            "title": "Tinubu reacts to #EndSARS protests, says police reforms has begun",
            "link": "https://guardian.ng/news/tinubu-reacts-to-endsars-protests-says-police-reforms-has-begun/",
            "description": "National leader of the All Progressives Congress (APC) Bola Tinubu has said the protest against police brutality in Nigeria is within the constitutional right of Nigerians. Asiwaju Tinubu believes in the right of Nigerians to freedom of expression, assembly, and protest where and when necessary, he has always canvassed the need for people to explore […]\nThe post Tinubu reacts to #EndSARS protests, says police reforms has begun appeared first on The Guardian Nigeria News - Nigeria and World News.",
            "timestamp": 1603135133.0,
            "image": null,
            "author": "Dennis Erezi"
        },
        {
            "title": "#EndSARS protests: Lagos orders school closure indefinitely",
            "link": "https://guardian.ng/news/endsars-protests-lagos-orders-school-closure-indefinitely/",
            "description": "The Lagos State Government has directed all students in public and private schools to stay at home until further notice over the tension generated by the anti-police brutality protests. Commissioner for Education, Folasade Adefisayo, who issued the directive today, said the safety of the pupils and students, parents and all staff working in schools is […]\nThe post #EndSARS protests: Lagos orders school closure indefinitely appeared first on The Guardian Nigeria News - Nigeria and World News.",
            "timestamp": 1603132640.0,
            "image": null,
            "author": "Dennis Erezi"
        },
        {
            "title": "Policemen attacked as protesters damage police vehicles in Lagos",
            "link": "https://guardian.ng/news/policemen-attacked-as-protesters-damage-police-vehicles-in-lagos/",
            "description": "The protest against police brutality was violent on Monday whenprotesters descended on some policemen attached to the Rapid Response Squad (RRS) of the Lagos State Command at Adekunle Police station, Yaba, around10:00 am. The attack occurred when about 97 policemen, who were being conveyed to their various beats on routine relief duties across the state, […]\nThe post Policemen attacked as protesters damage police vehicles in Lagos appeared first on The Guardian Nigeria News - Nigeria and World N",
            "timestamp": 1603131055.0,
            "image": null,
            "author": "Dennis Erezi"
        },
        {
            "title": "CP condemns murder of ENDSARS protester in Abuja",
            "link": "https://guardian.ng/news/cp-condemns-murder-of-endsars-protester-in-abuja/",
            "description": "The Commissioner of Police (CP) in charge of the Federal Capital Territory (FCT), Mr Bala Ciroma, has condemned the attack on one Anthony Unuode, a member of ENDSARS protesters in Kubwa area.\nThe post CP condemns murder of ENDSARS protester in Abuja appeared first on The Guardian Nigeria News - Nigeria and World News.",
            "timestamp": 1603130282.0,
            "image": null,
            "author": "Guardian Nigeria"
        },
        {
            "title": "Police fire teargas on protesters in Abuja",
            "link": "https://guardian.ng/news/police-fire-teargas-on-protesters-in-abuja/",
            "description": "Officers of the Nigerian Police Force (NPF) on Monday fired teargas on #EndSARS protesters in Abuja in an attempt to disperse their gathering in Asokoro District. Besides the retinue of soldiers in large numbers stationed along the Abuja-Keffi road also with stop-search exercise by the Abacha Barracks area, police officers were also stationed in several […]\nThe post Police fire teargas on protesters in Abuja appeared first on The Guardian Nigeria News - Nigeria and World News.",
            "timestamp": 1603127658.0,
            "image": null,
            "author": "Dennis Erezi"
        },
        {
            "title": "Pro-government Thugs Burn Protesters Cars In Abuja",
            "link": "http://saharareporters.com/2020/10/19/pro-government-thugs-burn-protesters-cars-abuja",
            "description": "Thugs have burnt cars of peaceful #ENDSARS protesters at the Federal Capital Territory, Abuja.\nThe thugs have on multiple occasions attacked the protesters with the police always looking the other way.\n\n\n\n\n\n\n\nMondays attack happened simultaneously while the police were also dispersing the protesters with teargas and live ammunition.\nIn a tweet, the Feminist Coalition said the thugs were sent to incite violence to discredit the ongoing protest.\nThe cars of peaceful protesters have alleged",
            "timestamp": 1603132155.0,
            "image": "http://saharareporters.com/sites/default/files/Screenshot%202020-10-19%20at%2019.17.56.png",
            "author": "editing"
        },
        {
            "title": "UPDATE: 19 Policemen Injured After Attack By Thugs",
            "link": "http://saharareporters.com/2020/10/19/update-19-policemen-injured-after-attack-thugs",
            "description": "Nineteen policemen in Lagos have sustained varying degrees of injury after a mob attack in Lagos on Monday.\nThe policemen attached to the Rapid Response Squad in Lagos were attacked by the angry mob at Yaba area of the state.\n\n\n\n\n\n\n\nSaharaReporters had reported that the officers were forced to abandon their vehicle and run for their lives.\nMob Attacks Policemen In Lagos | Sahara Reporters https://t.co/9kGYVNBKmQ pic.twitter.com/k3BOYzgrPB— Sahara Reporters (@SaharaReporters) October 19, 2",
            "timestamp": 1603129459.0,
            "image": "http://saharareporters.com/sites/default/files/Screenshot%202020-10-19%20at%2018.37.34_0.png",
            "author": "editing"
        },
        {
            "title": "Obasanjo on #EndSARS: Buhari has children he knows how youths behave",
            "link": "https://thecable.ng/obasanjo-on-endsars-buhari-has-children-he-knows-how-youths-behave",
            "description": "Ex-President Olusegun Obasanjo says President Muhammadu Buhari should demonstrate his care for the youths by attending to their demands. Obasanjo spoke when he visited Adeyeye Ogunwusi, Ooni of Ife, at\nThe post Obasanjo on #EndSARS: Buhari has children… he knows how youths behave appeared first on TheCable.",
            "timestamp": 1603145517.0,
            "image": null,
            "author": "Ebunoluwa Olafusi"
        },
        {
            "title": "Buhari on #EndSARS: Police reform will make us proud",
            "link": "https://thecable.ng/buhari-on-endsars-police-reform-will-make-us-proud",
            "description": "President Muhammadu Buhari has promised lasting reforms in the effort to deliver a police force Nigerians would be proud of. Sunday Dare, minister of youth and sports development, stated this\nThe post Buhari on #EndSARS: Police reform will make us proud appeared first on TheCable.",
            "timestamp": 1603145338.0,
            "image": null,
            "author": "Wasilat Azeez"
        },
        {
            "title": "Weve invested over $2.5bn on OPL 245 Eni replies group",
            "link": "https://thecable.ng/weve-invested-over-2-5bn-on-opl-245-eni-replies-group",
            "description": "Eni, says its oil company and Shell have invested over $2.5 billion on the oil prospecting license (OPL) 245 in Nigeria. This follows a report filed by the Human and\nThe post ‘We’ve invested over $2.5bn on OPL 245 Eni replies group appeared first on TheCable.",
            "timestamp": 1603142362.0,
            "image": null,
            "author": "Mary Ugbodaga"
        },
        {
            "title": "Group asks govt to priotise dialogue while resolving conflicts",
            "link": "https://thecable.ng/group-asks-govt-to-priotise-dialogue-while-resolving-conflicts",
            "description": "The Association of Northern Nigerians in Canada (ANNIC), a not-for-profit organisation, has called on federal and state governments to prioritise dialogue and genuine reconciliation in solving multiple challenges in Nigeria.\nThe post Group asks govt to priotise dialogue while resolving conflicts appeared first on TheCable.",
            "timestamp": 1603141189.0,
            "image": null,
            "author": "Haleem Olatunji"
        },
        {
            "title": "#EndSARS: A second wave of COVID-19 infections may overwhelm our health system, says SGF",
            "link": "https://thecable.ng/endsars-a-second-wave-of-covid-19-infections-may-overwhelm-our-health-systems-says-sgf",
            "description": "Boss Mustapha, secretary to the government of the federation (SGF), says the country’s health system may be overwhelmed if there’s a significant rise in COVID-19 infections as a result of\nThe post #EndSARS: A second wave of COVID-19 infections may overwhelm our health system, says SGF appeared first on TheCable.",
            "timestamp": 1603140950.0,
            "image": null,
            "author": "Mary Ugbodaga"
        },
        {
            "title": "Amnesty: Thugs have killed three #EndSARS protesters in Abuja",
            "link": "https://thecable.ng/amnesty-thugs-have-killed-three-endsars-protesters-in-abuja",
            "description": "Amnesty International says suspected thugs who disrupted the #EndSARS protest in Abuja have killed three persons. The human rights watchdog also said the suspects burnt dozens of cars during the\nThe post Amnesty: Thugs have killed three #EndSARS protesters in Abuja appeared first on TheCable.",
            "timestamp": 1603138404.0,
            "image": null,
            "author": "Chinedu Asadu"
        },
        {
            "title": "Education wouldn't remain same until a cure is vaccines for Covid19 is found- DEPOWA President",
            "link": "https://guardian.ng/news/education-wouldnt-remain-same-until-a-cure-is-vaccines-for-covid19-is-found-depowa-president/",
            "description": "President of Defence and Police Officers Wives Association (DEPOWA), Mrs Omobolanle Olonisakin, said education would not remain the same until a cure for COVID-19 is found. Speaking at a workshop for DEPOWA school teachers and instructors, the wife of the Chief of Defence Staff (CDS) said in view of developments in the education sector occasioned […]\nThe post Education wouldn't remain same until a cure is vaccines for Covid19 is found- DEPOWA President appeared first on The Guardian Nigeria News",
            "timestamp": 1603123957.0,
            "image": null,
            "author": "Guardian Nigeria"
        },
        {
            "title": "Nine million rural farmers get mobile devices to boost agric outputs",
            "link": "https://guardian.ng/news/nine-million-rural-farmers-get-mobile-devices-to-boost-agric-outputs/",
            "description": "Over nine million farmers in rural areas have been provided with communication devices to access agricultural market and financial inclusion. The intervention is to assist in improving the agriculture sector contribution to the nations Gross Domestic Product (GDP), Group Chief Executive, Tingo International Holdings Inc, Dozy Mmobuosi has said. According to him, the branded mobile […]\nThe post Nine million rural farmers get mobile devices to boost agric outputs appeared first on The Guardian Nig",
            "timestamp": 1603123572.0,
            "image": null,
            "author": "Timileyin Omilana"
        },
        {
            "title": "Miyetti Allah accuses protesters of trying to overthrow Buhari",
            "link": "https://guardian.ng/news/miyetti-allah-accuse-protesters-of-trying-to-overthrow-buhari/",
            "description": "Fingers Tinubu as sole financier of demonstrations The Miyetti Allah Kautal Hore Fulani Socio-cultural Association has accused the #EndSARS protesters of planning to undermine and overthrow democratically elected government of President Mohammadu Buhari. The association said the ethnic and regional colouration of the protests also show that some people from certain regions trying to intimidate […]\nThe post Miyetti Allah accuses protesters of trying to overthrow Buhari appeared first on The Guard",
            "timestamp": 1603123510.0,
            "image": null,
            "author": "Guardian Nigeria"
        },
        {
            "title": "Frustrated Nigerian graduate burns all his certificates after failing to secure a job (photos)",
            "link": "https://www.legit.ng/1369447-frustrated-graduate-burns-certificates-failing-secure-a-job.html",
            "description": "A young Nigerian graduate, Usman Abubakar, has burnt all his certificates after failing to secure employment since he graduated from the higher institution.",
            "timestamp": 1603140959.0,
            "image": null,
            "author": null
        },
        {
            "title": "Buhari's minister reveals what EndSARS protesters must do, gives reasons",
            "link": "https://www.legit.ng/1376069-endsars-protesters-embrace-dialogue-buharis-minister-dare-begs.html",
            "description": "Sunday Dare said that Nigerians protesting against what they condemn as police brutality must end their daily demonstrations and embrace dialogue with govt.",
            "timestamp": 1603140740.0,
            "image": null,
            "author": null
        },
        {
            "title": "#EndSARS: Stop inciting the youth, Lai warns religious leaders",
            "link": "https://thecable.ng/endsars-stop-inciting-the-youth-lai-warns-religious-leaders",
            "description": "Lai Mohammed, minister of information, has asked political, religious, traditional and opinion leaders to stop inciting #EndSARS protesters. Mohammed gave the warning during a forum organised by NAN on Monday.\nThe post #EndSARS: Stop inciting the youth, Lai warns religious leaders appeared first on TheCable.",
            "timestamp": 1603137697.0,
            "image": null,
            "author": "Jemilat Nasiru"
        },
        {
            "title": "Miyetti Allah asks #EndSARS protesters to quit",
            "link": "https://thecable.ng/miyetti-allah-asks-endsars-protesters-to-quit",
            "description": "The Miyetti Allah Kautal Hore says some of the demands of the #EndSARS protesters are difficult to fulfil. The demand of the protesters are immediate release of all those arrested\nThe post Miyetti Allah asks #EndSARS protesters to quit appeared first on TheCable.",
            "timestamp": 1603136676.0,
            "image": null,
            "author": "Samuel Akpan"
        },
        {
            "title": "Ndume seeks Mainas arrest, regrets standing as surety",
            "link": "https://thecable.ng/ndume-seeks-mainas-arrest-regrets-standing-as-surety",
            "description": "A federal high court in Abuja has ordered Ali Ndume, senator representing Borno south, to produce Abdulrasheed Maina, former chairman of the Pension Reform Task Team (PRTT), before the court.\nThe post Ndume seeks Maina’s arrest, regrets standing as surety appeared first on TheCable.",
            "timestamp": 1603135413.0,
            "image": null,
            "author": "Bolanle Olabimtan"
        },
        {
            "title": "I thought they were armed robbers  Ebuka recounts encounter with SARS",
            "link": "https://lifestyle.thecable.ng/thought-they-armed-robbers-ebuka-recounts-encounter-sars/#new_tab",
            "description": "The post ‘I thought they were armed robbers’  Ebuka recounts encounter with SARS appeared first on TheCable.",
            "timestamp": 1603134338.0,
            "image": null,
            "author": "Stephen Kenechukwu"
        },
        {
            "title": "Opinion: Help! the future of my home town is not guaranteed by Tona Bakare",
            "link": "https://www.legit.ng/1376065-opinion-help-future-home-town-bleak-by-tona-bakare.html",
            "description": "Many students of the University of Osun state (UniOsun) who returned to the community on resumption after COVID-19 school lockdown met their hostels emptied.",
            "timestamp": 1603140349.0,
            "image": null,
            "author": null
        },
        {
            "title": "Akwa Ibom govt to youths: Don't allow vested interests to hijack #EndSARS protests",
            "link": "https://www.legit.ng/1376107-akwa-ibom-govt-sets-judicial-panel-investigate-police-brutality.html",
            "description": "Governor Udom Emmanuel had summoned the emergency meeting of the state security council to discuss urgent matters of national concern, affecting Akwa Ibom state",
            "timestamp": 1603139169.0,
            "image": null,
            "author": null
        },
        {
            "title": "Lawyer to Nigerians: Army's Crocodile Smile has nothing to do with #EndSARS protests",
            "link": "https://www.legit.ng/1376097-crocodile-smile-endsars-protests-ugochukwu.html",
            "description": "One of Nigerias civil rights lawyer has condemned claims that the Nigerian armys operation crocodile smile vi is aimed at truncating the #EndSARS protest.",
            "timestamp": 1603139018.0,
            "image": null,
            "author": null
        },
        {
            "title": "Jubilation as Chelsea star recovers early from injury, set for Sevilla's Champions League game",
            "link": "https://www.legit.ng/1376127-edouard-mendy-chelsea-goalkeeper-set-champions-league-clash-sevilla.html",
            "description": "Edouard Mendy might be thrown back into the Chelsea starting line up for Sevillas Champions League encounter at the Stamford Bridge on Tuesday, October 20",
            "timestamp": 1603138926.0,
            "image": null,
            "author": null
        },
        {
            "title": "Here's 1 big thing Nigerian star did before being allowed to leave Chelsea this summer",
            "link": "https://www.legit.ng/1376073-victor-moses-forced-pay-cut-joining-spartak-moscow-chelsea.html",
            "description": "Victor Moses joined Russian side Spartak Moscow on loan from Chelsea. The 29-year-old was said to have taken pay cut before he was allowed to leave the Blues.",
            "timestamp": 1603138377.0,
            "image": null,
            "author": null
        },
        {
            "title": "Southwest group approves launch of Nigerian Army's crocodile smile",
            "link": "https://www.legit.ng/1376101-cyyy-approves-launch-nigerian-armys-crocodile-smile.html",
            "description": "Some Yoruba youths have commended the leadership of the Nigerian army for launching this years operation crocodile smile VI across various cities in Nigeria.",
            "timestamp": 1603138201.0,
            "image": null,
            "author": null
        },
        {
            "title": "Breaking: Lagos finally closes schools over #EndSARS protests",
            "link": "https://www.legit.ng/1376083-breaking-lagos-considers-closure-schools-endsars-protests.html",
            "description": "All secondary and primary schools including tertiary institutions in Lagos may be shut down by the state government over the demonstrations by the EndSARS.",
            "timestamp": 1603137568.0,
            "image": null,
            "author": null
        },
        {
            "title": "BREAKING: President Buhari sacks Tony Jaja as Nigerian Copyright Commission chairman",
            "link": "https://www.legit.ng/1376109-president-buhari-sacks-tony-jaja-nigerian-copyright-commission-chairman.html",
            "description": "The sack of Jaja was contained in a notice sent to the press by the spokesperson for the Attorney-General of the Federation, Umar Gwandu, on Monday, October 19.",
            "timestamp": 1603137534.0,
            "image": null,
            "author": null
        },
        {
            "title": "Don't cross this line - Minister of defence warns EndSARS protesters",
            "link": "https://www.legit.ng/1375971-endsars-dont-breach-national-security-defence-minister-warns-protesters.html",
            "description": "EndSARS protesters who majorly comprise youths have been clearly warned by the minister of defence, Bashir Magashi, not to breach Nigerias national security.",
            "timestamp": 1603137506.0,
            "image": null,
            "author": null
        },
        {
            "title": "Nigerian governors list 5 things they are doing to address all #EndSARS demands, reveal what will happen if protest is not suspended",
            "link": "https://www.legit.ng/1376115-nigerian-governors-list-address-endsars-demands.html",
            "description": "The Nigerian governors said they have resolved to meet all the demands of #EndSARS protesters. They, therefore, urged the protesters to suspend the protests.",
            "timestamp": 1603137471.0,
            "image": null,
            "author": null
        },
        {
            "title": "Federal agency reveals how hoodlums broke jail, freed inmates in Edo",
            "link": "https://www.legit.ng/1376113-nigerian-correctional-service-reveals-jail-break-edo-happened.html",
            "description": "The Nigerian Correctional Service (NCoS), has confirmed that some hoodlums under the pretext of EndSARS protests broke into Edo prison and freed some inmates.",
            "timestamp": 1603137387.0,
            "image": null,
            "author": null
        },
        {
            "title": "See the special 'car' this man created with an umbrella and bucket, his video goes viral",
            "link": "https://www.legit.ng/1375855-man-creates-special-car-umbrella-drives-around.html",
            "description": "A man, Brian Kahrs, has created a special way to move around, using something as simple as an umbrella, a leaf blower, and a mop bucket. His video went viral.",
            "timestamp": 1603137102.0,
            "image": null,
            "author": null
        },
        {
            "title": "List of extravagant cars owned by American president Donald Trump released (see photos)",
            "link": "https://www.legit.ng/1375997-donald-trumps-car-collection-world-talking.html",
            "description": "Donald Trump has one of the sought-after classic models of popular car brands like Rolls-Royce and Lamborghini. Among his collection is gold plated luxury bike.",
            "timestamp": 1603137021.0,
            "image": null,
            "author": null
        },
        {
            "title": "See how this little girl controlled this big dog like her toy, this is how the animal reacted (video)",
            "link": "https://www.legit.ng/1376041-little-girl-dog-give-amazing-performance-video-viral.html",
            "description": "A little kid and her dog have given social media users entertainment as their stunt video surfaced online. Many were amazed at their sync and their cool display",
            "timestamp": 1603136986.0,
            "image": null,
            "author": null
        },
        {
            "title": "See video from impressive 82nd birthday party organised for Alaafin of Oyo by his wives",
            "link": "https://www.legit.ng/1376123-alaafin-oyos-wives-throw-impressive-82nd-birthday-party-video.html",
            "description": "The Alaafin of Oyo recently celebrated his 82nd birthday and his young wives made sure it was a big affair by organising an impressive party for him. Read more.",
            "timestamp": 1603134134.0,
            "image": null,
            "author": null
        },
        {
            "title": "Former Man United striker declares he is unstoppable despite being 39 (here is why)",
            "link": "https://www.legit.ng/1376023-zlatan-ibrahimovic-feels-complete-brace-inter-milan.html",
            "description": "Zlatan Ibrahimovic has revealed that he is more complete at age 39 after finding the back of the net twice in AC Milans crucial victory over rivals Inter Milan",
            "timestamp": 1603132256.0,
            "image": null,
            "author": null
        },
        {
            "title": "Chrissy Teigen breaks silence week after sharing sad news of losing child",
            "link": "https://www.legit.ng/1375717-chrissy-teigen-shares-post-loss-we.html",
            "description": "Chrissy Teigen finally broke her silence on social media when she took to Instagram to share that she was doing better after she lost her third child, Jack.",
            "timestamp": 1603131092.0,
            "image": null,
            "author": null
        },
        {
            "title": "Nigerian players abroad roundup",
            "link": "https://dailypost.ng/2020/10/19/nigerian-players-abroad-roundup/",
            "description": "Nigerian players across Europe were in brilliant forms for their respective clubs last week. There were goals, impressive midfield shifts and defensive recovering from Nigerian players over the weekend. With lots of action from the English Premier League to the Turkish Super League, there was a record of Nigerians who dazzled for their respective clubs. […]\nNigerian players abroad roundup",
            "timestamp": 1603143189.0,
            "image": null,
            "author": "Obiweluozo Martins"
        },
        {
            "title": "End SARS: Details of Oonis meeting with Obasanjo emerge",
            "link": "https://dailypost.ng/2020/10/19/end-sars-details-of-oonis-meeting-with-obasanjo-emerge/",
            "description": "Oba Adeyeye Ogunwusi, Ojaja II, the Ooni of Ife, on Monday hosted Chief Olusegun Obasanjo, Nigeria’s former President, with an appeal to the End SARS protesters across Nigeria to retreat. Ooni, while receiving Obasanjo at his Ile Oodua Palace, Ile-Ife, described the End SARS protests as a clear message by the Nigerian youth to the […]\nEnd SARS: Details of Oonis meeting with Obasanjo emerge",
            "timestamp": 1603142528.0,
            "image": null,
            "author": "Don Silas"
        },
        {
            "title": "Premier League: African players who shined last weekend",
            "link": "https://dailypost.ng/2020/10/19/premier-league-african-players-who-shined-last-weekend/",
            "description": "African players were not left out of the tick of the action as a couple of them wrapped up the week with positive performance to help out their respective clubs. Players like Alex lwobi and Wilfred Zaha was in action and it was interesting to see what they could offer in 90 minutes of football. […]\nPremier League: African players who shined last weekend",
            "timestamp": 1603141910.0,
            "image": null,
            "author": "Obiweluozo Martins"
        },
        {
            "title": "11 Nigerian players who stood out for clubs last weekend",
            "link": "https://dailypost.ng/2020/10/19/11-nigerian-players-who-stood-out-for-clubs-last-weekend/",
            "description": "The last weekend actions across Europe saw Nigerian players performing for their respective clubs. There is a lot of positive showing from Nigerians abroad in as much as Nigeria boss Gernot Rohr gears towards his preparation ahead of the AFCON 2021 qualifier next month. It was an encouraging weekend for Nigerian with a lot of […]\n11 Nigerian players who stood out for clubs last weekend",
            "timestamp": 1603141184.0,
            "image": null,
            "author": "Obiweluozo Martins"
        },
        {
            "title": "End SARS: Suspend SWAT now  CAN advises police IG",
            "link": "https://dailypost.ng/2020/10/19/end-sars-suspend-swat-now-can-advises-police-ig/",
            "description": "The Christian Association of Nigeria, CAN, has cautioned the Inspector-General of Police, IGP Mohammed Adamu, to suspend the establishment of the Special Weapons And Tactical, SWAT, unit of the Nigerian Police Force. Recall that the IGP Mohammed Adamu had set up the new Police unit to take over from the now-defunct Special Anti-Robbery Squad (SARS). […]\nEnd SARS: Suspend SWAT now – CAN advises police IG",
            "timestamp": 1603140762.0,
            "image": null,
            "author": "Amos Tauna"
        },
        {
            "title": "Education: Ikpeazu approves reopening of universities, polytechnic, colleges of Education in Abia",
            "link": "https://dailypost.ng/2020/10/19/education-ikpeazu-approves-reopening-of-universities-polytechnic-colleges-of-education-in-abia/",
            "description": "Government and tertiary institutions in Abia State have been directed to reopen for academic activities with effect from Monday, October 26, 2020. Okezie Ikpeazu, the Governor of Abia State made the approval in a release made available to newsmen, by the Secretary to the State Government, SSG, on Monday. The Governor also directed heads of […]\nEducation: Ikpeazu approves reopening of universities, polytechnic, colleges of Education in Abia",
            "timestamp": 1603140522.0,
            "image": null,
            "author": "Chijindu Emeruwa"
        },
        {
            "title": "Crocodile Smile: Nigerian military asked to go tough against terrorists",
            "link": "https://dailypost.ng/2020/10/19/crocodile-smile-nigerian-military-asked-to-go-tough-against-terrorists/",
            "description": "The Nigerian military has been urged to go tough against remnants of terrorists in the country following the launch of the Operation Crocodile Smile. Recall that the Nigerian army had announced that a new phase of the military exercise would commence on Tuesday, October 20, 2020, nationwide. However, following the launch of the exercise, many […]\nCrocodile Smile: Nigerian military asked to go tough against terrorists",
            "timestamp": 1603140319.0,
            "image": null,
            "author": "Don Silas"
        },
        {
            "title": "Bruno Fernandes reacts as Solskjaer makes him Man Utd captain",
            "link": "https://dailypost.ng/2020/10/19/bruno-fernandes-reacts-as-solskjaer-makes-him-man-utd-captain/",
            "description": "Manchester United midfielder, Bruno Fernandes, has said that he was honoured after manager Ole Gunnar Solskjaer made him captain ahead of the Red Devils’ Champions League clash against Paris Saint-Germain on Tuesday night in France. The Portugal international said it was important for him to lead Man United, adding that he was not expecting to […]\nBruno Fernandes reacts as Solskjaer makes him Man Utd captain",
            "timestamp": 1603140128.0,
            "image": null,
            "author": "Don Silas"
        },
        {
            "title": "Enugu SARS cell now empty  CP Abdurrahman tells Gov. Ugwuanyi",
            "link": "https://dailypost.ng/2020/10/19/enugu-sars-cell-now-empty-cp-abdurrahman-tells-gov-ugwuanyi/",
            "description": "The Enugu State Commissioner of Police, Mr. Ahmad Abdurrahman, on Monday disclosed that no suspect is currently in the detention facility of the disbanded Special Anti-Robbery Squad, SARS, in the State. DAILY POST reports that he spoke when Governor Ifeanyi Ugwuanyi of Enugu State visited the defunct SARS office in Enugu to confirm compliance with […]\nEnugu SARS cell now empty  CP Abdurrahman tells Gov. Ugwuanyi",
            "timestamp": 1603139828.0,
            "image": null,
            "author": "Emmanuel Uzodinma"
        },
        {
            "title": "End SARS: Potesters vehicles, car dealer stand set on fire in Abuja [Video]",
            "link": "https://dailypost.ng/2020/10/19/end-sars-potesters-vehicles-car-dealer-stand-set-on-fire-in-abuja-video/",
            "description": "Some hoodlums described as pro-government have set several vehicles on fire in Abuja The arson affected some End SARS protesters’ cars and an auto dealer’s stand. The location is the Apo mechanic village in the nation’s capital. Demonstrations against Police brutality are ongoing nationwide. Monday witnessed several occurrences in different states. There was an attack […]\nEnd SARS: Potesters’ vehicles, car dealer stand set on fire in Abuja [Video]",
            "timestamp": 1603139485.0,
            "image": null,
            "author": "Wale Odunsi"
        },
        {
            "title": "End SARS: Lagos Govt shuts schools over protests",
            "link": "https://dailypost.ng/2020/10/19/end-sars-lagos-govt-shuts-schools-over-protests/",
            "description": "The Lagos State Government has directed all students in public and private schools to stay at home following the tension generated by the End SARS protests in the state. The state Commissioner for Education, Mrs Folasade Adefisayo, issued the directive, on Monday stating that the safety of the students, parents and all staff working in […]\nEnd SARS: Lagos Govt shuts schools over protests",
            "timestamp": 1603139053.0,
            "image": null,
            "author": "Annie Nwosu"
        },
        {
            "title": "FG reveals what will happen to Nigeria after End SARS protests",
            "link": "https://dailypost.ng/2020/10/19/fg-reveals-what-will-happen-to-nigeria-after-end-sars-protests/",
            "description": "Alhaji Lai Mohammed, the Minister of Information and Culture, has said that he envisions a better Nigeria where fundamental human rights of people will be respected after the End SARS protests. Mohammed stated this on Monday in Abuja at a Special NAN Forum. The minister explained that the vision would be achievable if the protesters […]\nFG reveals what will happen to Nigeria after End SARS protests",
            "timestamp": 1603138819.0,
            "image": null,
            "author": "Don Silas"
        },
        {
            "title": "National Assembly not Buharis rubber-stamp",
            "link": "https://thenationonlineng.net/national-assembly-not-buharis-rubber-stamp/",
            "description": "Nkeiruka Onyejocha, who represents Isuikwuato/Umunneochi Constituency, is the Chief Whip of the House of Representatives. In this interview with SUNNY NWANKWO, she speaks on the political situation in Abia State, the Buhari administration and the future of the All Progressives Congress (APC).   NIGERIANS have accused the leadership of the 9th National Assembly of pandering […]",
            "timestamp": 1603152085.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Lagos judiciary seeks stakeholders collaboration on small claims court",
            "link": "https://thenationonlineng.net/lagos-judiciary-seeks-stakeholders-collaboration-on-small-claims-court/",
            "description": "By Adebisi Onanuga   A JUDGE of the Lagos State Judiciary, Justice Yetunde Adesanya, has urged stakeholders to collaborate with the judiciary to bring the small claimscourts in conformity with global best practices. She said the state Chief Judge, Justice Kazeem Alogba, had put in place a standardised system through which the judiciary reviews small […]",
            "timestamp": 1603152055.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Rethinking policing",
            "link": "https://thenationonlineng.net/rethinking-policing/",
            "description": "As agitations for complete reforms of the Nigeria Police continue across the country, PRECIOUS IGBONWELUNDU reports that the Civil Society Legislative Advocacy Centre (CISLAC) has opened talks with relevant stakeholders on how to emplace structures that work through security sector governance.   EXTRA JUDICIAL killings, brutality, extortion, unlawful arrest, torture and other human rights infractions […]",
            "timestamp": 1603151832.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Lawyers advised on wealth creation outside legal practice",
            "link": "https://thenationonlineng.net/lawyers-advised-on-wealth-creation-outside-legal-practice/",
            "description": "Adebisi Onanuga   THE Chief Executive Officer of Lawbreed Publication Ltd, Layi Babatunde (SAN), has charged young lawyers to start a businesses in post-COVID-19 pandemic. Babatunde also urged the executives of the Nigerian Bar Association (NBA) led by Olumide Akpata to probe the conduct of legal professionals. He gave the advice at the Lawbreed Academy […]",
            "timestamp": 1603151720.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Govt should learn from protest, says party chieftain",
            "link": "https://thenationonlineng.net/govt-should-learn-from-protest-says-party-chieftain/",
            "description": "By Emmanuel Oladesu   A CHIEFTAIN of the All Progressives Congress (APC) in Lagos State, Comrade Sesan Daini, has urged governments at all level to learn from the on-going EndSARS protests. He said government must always listen to public complaints and serve the people with patriotism. Daini, an activist and chairman of Igbogbo/Bayeku Council, Ikorodu, […]",
            "timestamp": 1603151591.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Court okays firms request to vary order attaching funds in bank",
            "link": "https://thenationonlineng.net/court-okays-firms-request-to-vary-order-attaching-funds-in-bank/",
            "description": "Eric Ikhilae, Abuja   A HIGH Court of the Federal Capital Territory (FCT) in Apo, Abuja has granted the request by a firm, Nacenn Nigeria Ltd, for a variation of the Mareva injunction earlier granted, attaching its funds in Zenith Bank Plc over a dispute between it and its lawyer, Prof. Yemi Akinseye-George (SAN). Justice […]",
            "timestamp": 1603151549.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Stimulating the economy for global competitiveness",
            "link": "https://thenationonlineng.net/stimulating-the-economy-for-global-competitiveness/",
            "description": "By Kenneth O. Eze   EVERY country that desires to keep pace with the world by being globally competitive, must constantly measure themselves against the best, to identify and strive to bridge the gaps. Nigeria cannot be an exception. Nigeria must consider this approach, if she is to get out the economic woods to which […]",
            "timestamp": 1603151519.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Are protesters rights unlimited?",
            "link": "https://thenationonlineng.net/are-protesters-rights-unlimited/",
            "description": "Continued from August 27   There were multiple reports that thugs wielding cudgels and cutlasses attempted to disrupt the demonstration by attacking protesters and destroying cars, hence Ekekes refernce to rented hoodlums. But, whether Keyamo was correct or not, there have been suggestions elsewhere that the protests, though widely supported, might be having other […]",
            "timestamp": 1603151419.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Beyond #EndSARS",
            "link": "https://thenationonlineng.net/beyond-endsars/",
            "description": "Gabriel Amulu   THE ongoing street rage, against the infernal torture and criminality that is the hallmark of the proscribed Special Anti-Robbery Squad (SARS), calls for immediate restructuring of the Nigerian Police Force, not the infantile change of name to SWAT. As the Inspector General of Police (IGP) Mohammed Adamu, must have realised, the Nigerian […]",
            "timestamp": 1603151278.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "X-raying INEC under Yakubus watch",
            "link": "https://thenationonlineng.net/x-raying-inec-under-yakubus-watch/",
            "description": "The five-year tenure of Prof. Mahmood Yakubu as the chairman of the Independent National Electoral Commission (INEC) is coming to an end on Wednesday, October 21. Correspondent OKODILI NDIDI examines efforts made under his watch to improve the quality of elections in the country   THE tenure of Prof. Mahmood Yakubu as chairman of the […]",
            "timestamp": 1603150981.0,
            "image": null,
            "author": "Akintunde1"
        },
        {
            "title": "Sanwo-Olu sends powerful message to EndSARS protesters, urges dialogue",
            "link": "https://www.legit.ng/1376077-breaking-leave-roads-embrace-dialogue-sanwo-olu-urges-endsars-protesters.html",
            "description": "Lagos State Governor, Babajide Sanwo-Olu, has appealed to #EndSARS protesters demonstrating against police brutality and extrajudicial killings to leave road.",
            "timestamp": 1603129876.0,
            "image": null,
            "author": null
        },
        {
            "title": "American comedian Kevin Hart shows off newborn daughter on social media",
            "link": "https://www.legit.ng/1375763-kevin-hart-shows-baby-daughters-face-days-birth.html",
            "description": "According to posts on the celebrity and his wifes social media pages, Eniko gave birth to their second child on Tuesday, September 29. Read more on TUKO.co.ke.",
            "timestamp": 1603129602.0,
            "image": null,
            "author": null
        },
        {
            "title": "EndSARS: Like Osinbajo, Gov Okowa offers apologies to Delta youths for slow response",
            "link": "https://www.legit.ng/1376081-police-brutality-delta-govt-establish-victims-support-fund-inaugurates-panel-enquiry.html",
            "description": "Governor Ifeanyi Okowa made the announcement in Asaba while inaugurating an eight-member judicial panel of enquiry into alleged police brutality in Delta state.",
            "timestamp": 1603128069.0,
            "image": null,
            "author": null
        },
        {
            "title": "American rapper Cardi B reportedly deactivates Twitter page after getting dragged for reuniting with Offset",
            "link": "https://www.legit.ng/1376087-rapper-cardi-b-deactivates-twitter-page-backlash-husband-offset.html",
            "description": "Popular American rapper, Cardi B, has reportedly removed herself from Twitter. This came after the music star faced criticism for getting back with her husband.",
            "timestamp": 1603127247.0,
            "image": null,
            "author": null
        },
        {
            "title": "Video shows heartwarming moment kids assist their father in cleaning dirty road that leads to train station",
            "link": "https://www.legit.ng/1376075-video-shows-young-kids-cleaning-route-leads-subway-station.html",
            "description": "Some adorable kids could be seen in a heartwarming video cleaning up the trash on the route that leads to their local New York City subway station in the Bronx.",
            "timestamp": 1603124882.0,
            "image": null,
            "author": null
        },
        {
            "title": "Internet users say protests has taken attention from BBNaija housemates",
            "link": "https://www.legit.ng/1376079-end-sars-forget-bbnaija-housemates-internet-users-say.html",
            "description": "Nigerians on social media recently noted how the nationwide End SARS protests had adversely affected BBNaija 2020 Lockdown housemates. Read more on Legit.ng.",
            "timestamp": 1603124569.0,
            "image": null,
            "author": null
        },
        {
            "title": "Young man becomes successful, builds mansion in his village and lights up social media with adorable photos",
            "link": "https://www.legit.ng/1376019-young-man-shows-mansion-building-village.html",
            "description": "A Limpopo man, who is only known as @monsieurponto, showed off the impressive crib hes building for himself in a village and it inspired South Africans online.",
            "timestamp": 1603124527.0,
            "image": null,
            "author": null
        },
        {
            "title": "What continued EndSARS protest will cause in Nigeria if youths don't stop now - APC chieftain",
            "link": "https://www.legit.ng/1375915-endsars-protest-degenerate-drastic-apc-chieftain.html",
            "description": "An All Progressives Congress chieftain in Delta, Joel-Onowakpo Thomas, has said that the continued EndSARS protest will lead to a breakdown of order in Nigeria.",
            "timestamp": 1603124410.0,
            "image": null,
            "author": null
        },
        {
            "title": "Those asking Buhari to resign amid protests are enemies of Nigeria, says APC chieftain",
            "link": "https://www.legit.ng/1376071-endsars-protests-those-buhari-resign-enemies-nigeria-gololo.html",
            "description": "Garus Gololo, an APC chieftain, has described calls from some sections of the country that President Muhammad Buhari should resign amid protests as unpatriotic.",
            "timestamp": 1603123870.0,
            "image": null,
            "author": null
        },
        {
            "title": "Video show kid engaging his mom's friend, these are the boy's adorable responses",
            "link": "https://www.legit.ng/1375885-little-boy-moms-friend-share-adorable-moment-camera.html",
            "description": "In a viral clip, a man can be seen joking to a little kid that he is going to throw him at the ceiling, the boy seems completely unbothered and waits excitedly.",
            "timestamp": 1603123795.0,
            "image": null,
            "author": null
        },
        {
            "title": "Drama as lover dumps his 7-month pregnant girlfriend, secretly marries another lady",
            "link": "https://www.legit.ng/1375831-lover-secretly-marries-lady-dumps-pregnant-girlfriend.html",
            "description": "The single mum said she smelt a rat when her best friend constantly inquired about her lover Normans reaction when he learnt they were going to be parents.",
            "timestamp": 1603123767.0,
            "image": null,
            "author": null
        },
        {
            "title": "#EndSARS: Umahi decries police extortion, brutality in Ebonyi",
            "link": "https://www.vanguardngr.com/2020/10/endsars-umahi-decries-police-extortion-brutality-in-ebonyi/",
            "description": "Governor David Umahi of Ebonyi on Monday said the state government would no longer tolerate extortion and brutality on the people by police personnel in the state. Umahi, who made the announcement at the old-Government House complex while addressing #EndSARS protesters, said that any form of roadblocks would no longer be tolerated anywhere in theRead More\nThe post #EndSARS: Umahi decries police extortion, brutality in Ebonyi appeared first on Vanguard News.",
            "timestamp": 1603150099.0,
            "image": null,
            "author": "David O Royal"
        },
        {
            "title": "#ENDSARS protest: Nigeria should prepare for increase in COVID-19 cases  FG",
            "link": "https://www.vanguardngr.com/2020/10/endsars-protest-nigeria-should-prepare-for-increase-in-covid-19-cases-fg/",
            "description": "Lagos, FCT test 1% of its population As 17,000 health works train on infection By Chioma Obinna & Gabriel Olawale The Federal government on Monday warned that with the ongoing #ENDSARS protest across the country, cases of COVID-19 will definitely increase in the coming weeks. Issuing the warning in Abuja, the Chairman, Presidential Taskforce, PTF,Read More\nThe post #ENDSARS protest: Nigeria should prepare for increase in COVID-19 cases  FG appeared first on Vanguard News.",
            "timestamp": 1603149692.0,
            "image": null,
            "author": "Lawal Sherifat"
        },
        {
            "title": "Act on #EndSARS protesters demands, #FixPolitics urges Govt",
            "link": "https://www.vanguardngr.com/2020/10/act-on-endsars-protesters-demands-fixpolitics-urges-govt/",
            "description": "The #FixPolitics Initiative has called on the Federal Government of Nigeria to listen to the #EndSARS protesters, ensure that peace and justice prevail as well as demonstrate the virtues of good governance by acting on their demands. #FixPolitics, a research-based citizens collective, made up of Nigerians across various demographic groups and professional endeavours, also calledRead More\nThe post Act on #EndSARS protesters demands, #FixPolitics urges Govt appeared first on Vanguard News.",
            "timestamp": 1603148844.0,
            "image": null,
            "author": "Emmanuel Okogba"
        },
        {
            "title": "Ibrahimovic has shifted the balance more in Italy than Ronaldo",
            "link": "https://www.vanguardngr.com/2020/10/ibrahimovic-has-shifted-the-balance-more-in-italy-than-ronaldo/",
            "description": "Zlatan Ibrahimovic has had a greater impact on Italian football than Cristiano Ronaldo, according to former Milan and Juventus head coach Alberto Zaccheroni. The 39-year-old has made a considerable impact since rejoining Milan in January, scoring 11 goals in 20 appearances in the second half of the 2019-20 campaign. He has been in equally impressiveRead More\nThe post Ibrahimovic has ‘shifted the balance more’ in Italy than Ronaldo appeared first on Vanguard News.",
            "timestamp": 1603148451.0,
            "image": null,
            "author": "Temisan Amoye"
        },
        {
            "title": "MU NA CHIM DI NA MMA:Fulfilling life of Daniel Ezeamaku",
            "link": "https://www.vanguardngr.com/2020/10/mu-na-chim-di-na-mma-fulfilling-life-of-daniel-ezeamaku/",
            "description": "High Chief Daniel Ezeamaku (Oranyelugo Achina) was born into Umuezeanum kindred in Ebele village, Achina now Isi-Achina on December 26, 1936, to the late Chief Mark Udeozor Ezeamaku and the late Regina Nwabuaku Ezeamaku (Nee Umeodinka) of Ofeama, Okohia Village Uga.\nThe post ‘MU NA CHIM DI NA MMA’:Fulfilling life of Daniel Ezeamaku appeared first on Vanguard News.",
            "timestamp": 1603147857.0,
            "image": null,
            "author": "Oboh"
        },
        {
            "title": "JP Clark not dead, his spirit lives on: Akachi-Ezeigbo, Tomoloju, Jahman, others speak",
            "link": "https://www.vanguardngr.com/2020/10/jp-clark-not-dead-his-spirit-lives-on-akachi-ezeigbo-tomoloju-jahman-others-speak/",
            "description": "Professor John Pepper Clark Berekedemo, who passed on, last week, was a renowned poet and playwright.\nThe post JP Clark not dead, his spirit lives on: Akachi-Ezeigbo, Tomoloju, Jahman, others speak appeared first on Vanguard News.",
            "timestamp": 1603147213.0,
            "image": null,
            "author": "Oboh"
        },
        {
            "title": "24 years after, comely St. Pauls Anglican Church emerges from swamp",
            "link": "https://www.vanguardngr.com/2020/10/24-years-after-comely-st-pauls-anglican-church-emerges-from-swamp/",
            "description": "The Lagos Diocese of the Anglican Communion celebrated a big feat on Sunday during the dedication of a new church building at St. Pauls Anglican Church, Maza maza, Lagos.\nThe post 24 years after, comely St. Paul’s Anglican Church emerges from swamp appeared first on Vanguard News.",
            "timestamp": 1603146622.0,
            "image": null,
            "author": "Oboh"
        },
        {
            "title": "End SARS",
            "link": "https://www.vanguardngr.com/2020/10/end-sars/",
            "description": "#EndSARS: The police history and character as a colonial constabulary force unsuited for a sovereign nation of free citizens in a democracy.\nThe post End SARS appeared first on Vanguard News.",
            "timestamp": 1603146005.0,
            "image": null,
            "author": "Oboh"
        },
        {
            "title": "Chinas loans to African countries have no political strings Chu Maoming",
            "link": "https://www.vanguardngr.com/2020/10/chinas-loans-to-african-countries-have-no-political-strings-chu-maoming/",
            "description": "Chinas Consul-General in Lagos, Chu Maoming, has dismissed fears that Chinas loans to African countries have political undertones or are meant to enslave Africa.\nThe post China’s loans to African countries have no political strings Chu Maoming appeared first on Vanguard News.",
            "timestamp": 1603145435.0,
            "image": null,
            "author": "Oboh"
        },
        {
            "title": "Union raises alarm over job loss in food sector",
            "link": "https://www.vanguardngr.com/2020/10/union-raises-alarm-over-job-loss-in-food-sector/",
            "description": "Food, Beverage and Tobacco Senior Staff Association, FOBTOB, Monday, urged the Federal Government through the Federal Ministry of Labour and Employment to urgently wade into rising cases of redundancies in the sector to save members jobs.\nThe post Union raises alarm over job loss in food sector appeared first on Vanguard News.",
            "timestamp": 1603144827.0,
            "image": null,
            "author": "Oboh"
        },
        {
            "title": "CBN releases framework for financing of mass metering",
            "link": "https://www.vanguardngr.com/2020/10/cbn-releases-framework-for-financing-of-mass-metering/",
            "description": "Central Bank of Nigeria (CBN) has released its framework for National Mass Metering Programme (NMMP).\nThe post CBN releases framework for financing of mass metering appeared first on Vanguard News.",
            "timestamp": 1603144672.0,
            "image": null,
            "author": "Urowayino Jeremiah"
        },
        {
            "title": "COVID-19: NCDC says its supporting NYSC on safe reopening of camps",
            "link": "https://www.vanguardngr.com/2020/10/covid-19-ncdc-says-its-supporting-nysc-on-safe-reopening-of-camps/",
            "description": "The Nigeria Centre For Disease Control (NCDC) has said that it is supporting and providing a public health guidance for safereopening of the National Youth Service Corps (NYSC) camps across the country.\nThe post COVID-19: NCDC says its supporting NYSC on safe reopening of camps appeared first on Vanguard News.",
            "timestamp": 1603144368.0,
            "image": null,
            "author": "Urowayino Jeremiah"
        },
        {
            "title": "How SARS became a catalyst for a new generation of Nigerian youths",
            "link": "https://www.vanguardngr.com/2020/10/how-sars-became-a-catalyst-for-a-new-generation-of-nigerian-youths/",
            "description": "My 14-year-old daughter had this to say when the End SARS protests broke out, thank God! At last! While I was still reeling from the shrewd observation, in that subconsciously pejorative way elders bristle at the unsolicited wit of the young, my nine-year-old son dropped his own two cents of wisdom on the table  Nigeria has zero security. When pressed to educate us further, he shrugged, it is very obvious, poor everything. In that moment, I did a quick calculation. Four years from now, my daught",
            "timestamp": 1603142681.0,
            "image": null,
            "author": "Urowayino Jeremiah"
        },
        {
            "title": "#EndSARS protest: Nigeria should prepare for increase in COVID-19 cases  FG warns",
            "link": "https://www.vanguardngr.com/2020/10/endsars-protest-nigeria-should-prepare-for-increase-in-covid-19-cases-%e2%80%95-fg-warns/",
            "description": "…Lagos, FCT test 1% of its population …As 17,000 health works train on infection By Chioma Obinna & Gabriel Olawale The Federal government on Monday warned that with the ongoing #ENDSARS protest across the country, cases of COVID-19 will definitely increase in the coming weeks. Issuing the warning in Abuja, the Chairman, Presidential Taskforce, PTF,Read More\nThe post #EndSARS protest: Nigeria should prepare for increase in COVID-19 cases  FG warns appeared first on Vanguard News.",
            "timestamp": 1603142639.0,
            "image": null,
            "author": "David O Royal"
        },
        {
            "title": "Criminals shouldnt be allowed to hijack #EndSars  Uche Annie-Okonkwo",
            "link": "https://www.vanguardngr.com/2020/10/criminals-shouldnt-be-allowed-to-hijack-endsars-uche-annie-okonkwo/",
            "description": "Convener of Lets Get Good Empowered Initiative,Mr. Uche Annie-Okonkwo, has described #EndSars protest as an honourable cause, saying criminals should not be allowed to hijack the exercise.\nThe post Criminals shouldn’t be allowed to hijack #EndSars – Uche Annie-Okonkwo appeared first on Vanguard News.",
            "timestamp": 1603142384.0,
            "image": null,
            "author": "Urowayino Jeremiah"
        },
        {
            "title": "[Updated] #EndSARS: Hoodlums set ablaze over 50 cars in Apo Abuja",
            "link": "https://www.vanguardngr.com/2020/10/endsars-hoodlums-set-ablaze-over-50-cars-in-apo-abuja/",
            "description": "By Luminous Jannamike Following the protests against police brutality and extra-extra-judicial killings on Monday in the FCT, some hoodlums have burnt down over 50 cars at Apo Mechanic village in Abuja. The cars, displayed for sale at a car stand, were set ablaze by alleged thugs hired to disrupt the agitation for comprehensive police reformRead More\nThe post [Updated] #EndSARS: Hoodlums set ablaze over 50 cars in Apo Abuja appeared first on Vanguard News.",
            "timestamp": 1603141671.0,
            "image": null,
            "author": "David O Royal"
        },
        {
            "title": "#ENDSARS: Akeredolu sets up panel of judicial inquiry in Ondo",
            "link": "https://www.vanguardngr.com/2020/10/endsars-akeredolu-sets-up-panel-of-judicial-inquiry-in-ondo/",
            "description": "By Dayo Johnson, Akure The Governor of Ondo State, Rotimi Akeredolu has approved the constitution of a Judicial Panel of Inquiry to look into all complaints by members of the public on alleged illegal activities of officers of Nigeria Police Force in Ondo State. The decision of the State Government was in line with theRead More\nThe post #ENDSARS: Akeredolu sets up panel of judicial inquiry in Ondo appeared first on Vanguard News.",
            "timestamp": 1603140749.0,
            "image": null,
            "author": "Temisan Amoye"
        },
        {
            "title": "OGUN: TRACE records 132 auto accidents, 53 deaths in nine months",
            "link": "https://www.vanguardngr.com/2020/10/ogun-trace-records-132-auto-accidents-53-deaths-in-nine-months/",
            "description": "By Bose Adelaja Ogun State Traffic Compliance and Enforcement Corps TRACE, on Monday, said it recorded a total number of 132 auto accidents and 53 deaths within a space of nine months in the year 2020. According to the traffic agency, the figures were recorded between January and September. TRACE Director, Traffic Planning Research andRead More\nThe post OGUN: TRACE records 132 auto accidents, 53 deaths in nine months appeared first on Vanguard News.",
            "timestamp": 1603140232.0,
            "image": null,
            "author": "Temisan Amoye"
        },
        {
            "title": "Reps consider PIB Tuesday",
            "link": "https://www.vanguardngr.com/2020/10/reps-consider-pib-tuesday/",
            "description": "The House of Representatives will Tuesday, take the Petroleum Industry Bill, 2020 through second reading.\nThe post Reps consider PIB Tuesday appeared first on Vanguard News.",
            "timestamp": 1603140173.0,
            "image": null,
            "author": "Bankole"
        },
        {
            "title": "#EndSARS protest: Sanwo-Olu orders students to stay at home",
            "link": "https://www.vanguardngr.com/2020/10/endsars-protest-sanwo-olu-orders-students-to-stay-at-home/",
            "description": "By Olasunkanmi Akoni Following rising tension in the ongoing #EndSARS protest, Lagos Stare Governor, Mr Babajide Sanwo-Olu has directed all students in public and private schools to stay at home from October 20, 2020, Tuesday. Commissioner for Education, Mrs Folasade Adefisayo, who announced this on Monday, said Governor Sanwo-Olu has approved the closure with immediateRead More\nThe post #EndSARS protest: Sanwo-Olu orders students to stay at home appeared first on Vanguard News.",
            "timestamp": 1603139724.0,
            "image": null,
            "author": "Temisan Amoye"
        },
        {
            "title": "#EndSARS reforms: NHRC submits report to AGF, calls for prosecution of 35 indicted police officers",
            "link": "https://www.blueprint.ng/endsars-reforms-nhrc-submits-report-to-agf-calls-for-prosecution-of-35-indicted-police-officers/",
            "description": "The Presidential Investigation Panel on allegations of human rights violations Monday submitted its report to the Attorney General of the Federation and Minister of Justice, Abubakar Malami, SAN. The panel also called for the prosecution of 35 police officers indicted in a report of the Presidential Investigation Panel on allegations of human rights violations against the disbanded Special Anti-Robbery Squad Read More\nThe post #EndSARS reforms: NHRC submits report to AGF, calls for prosecution o",
            "timestamp": 1603142442.0,
            "image": null,
            "author": "Kehinde Osasona"
        },
        {
            "title": "FG committed to reforms  Minister Dare",
            "link": "https://www.blueprint.ng/fg-committed-to-reforms-minister-dare/",
            "description": "The federal government is totally committed to effect changes in the polity for the good of the citizens, even as President Mohammadu Buhari would guarantee the safety of all law abiding citizens. Minister of Youth and Sports Development Mr Sunday Dare who stated this, Monday, further said, “It is important to start from the policy statement made by Mr. President Read More\nThe post FG committed to reforms - Minister Dare first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603138700.0,
            "image": null,
            "author": "Editorial IV"
        },
        {
            "title": "#EndSARS protests: Buhari breaks silence, tells Police what to do",
            "link": "https://www.blueprint.ng/endsars-protests-buhari-breaks-silence-tells-police-what-to-do/",
            "description": "President Muhammadu Buhari Monday ordered the Inspector General of Police (IGP) Mr Mohammed Abubakar Adamu to protect #EndSARS protesters, saying it is within their rights to express grievances through protests. This was disclosed by the Minister of Youth and Sports Development, Mr Sunday Dare, while fielding questions from State House correspondents after a meeting with the president. He said the Read More\nThe post #EndSARS protests: Buhari breaks silence, tells Police what to do first appeared",
            "timestamp": 1603138538.0,
            "image": null,
            "author": "Abdullahi M. Gulloma"
        },
        {
            "title": "VIDEO: Hoodlums attack #EndSARS protesters in Abuja, set many cars ablaze",
            "link": "https://www.blueprint.ng/video-hoodlums-attack-endsars-protesters-in-abuja-set-many-cars-ablaze/",
            "description": "The video clip attached to this story shows how hoodlums set many cars ablaze at a roadside car pack in Abuja on Monday. The miscreants who were protesting against the blockade of the Apo mechanic village road by #EndSARS protesters, went berserk and attacked passersby before torching the vehicles. About seven vehicles were burnt down during the violence which also Read More\nThe post VIDEO: Hoodlums attack #EndSARS protesters in Abuja, set many cars ablaze first appeared on Blueprint Newspapers",
            "timestamp": 1603137853.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Police Confirms Burning Of Stations In Benin, Ask Parents To Prevail On Children, Wards",
            "link": "https://www.channelstv.com/2020/10/19/police-confirms-burning-of-stations-in-benin-ask-parents-to-prevail-on-children-wards/",
            "description": "The Nigeria Police Force (NPF) has confirmed the attacks on three different police stations in Edo State. “@policeNG regrettably confirm the unfortunate attacks on Police Facilities – Ugbekun Police Station, Oba Market Police Station, and Idogbo Police Post by persons posing as #ENDSARS protesters in Benin, Edo State, today, Monday, 19th October 2020,” a … Continue reading Police Confirms Burning Of Stations In Benin, Ask Parents To Prevail On Children, Wards",
            "timestamp": 1603144847.0,
            "image": null,
            "author": "Soonest Nathaniel"
        },
        {
            "title": "VIDEO: How Thugs Attacked RRS Vehicles In Lagos, Causing Policemen To Flee",
            "link": "https://www.channelstv.com/2020/10/19/video-how-thugs-attacked-rrs-vehicles-in-lagos-causing-policemen-to-flee/",
            "description": "Thugs at the Yaba area of Lagos State on Monday attacked vehicles belonging to the Rapid Response Squad (RRS) unit of the Nigeria Police Force (NPF). Trending videos that made the rounds earlier on showed the thugs pelting the officers with stones, forcing the RRS operatives to abandon their truck and vans and scamper … Continue reading VIDEO: How Thugs Attacked RRS Vehicles In Lagos, Causing Policemen To Flee",
            "timestamp": 1603141139.0,
            "image": null,
            "author": "Soonest Nathaniel"
        },
        {
            "title": "#EndSARS: Lagos Directs Students To Stay At Home",
            "link": "https://www.channelstv.com/2020/10/19/endsars-lagos-directs-students-to-stay-at-home/",
            "description": "The Lagos State Government has directed all pupils/students in public and private schools to stay at home following the tension generated by the anti- SARS protests. Commissioner for Education, Mrs. Folasade Adefisayo, who issued the directive today, said the safety of the pupils/students, parents, and all staff working in schools is paramount at this … Continue reading #EndSARS: Lagos Directs Students To Stay At Home",
            "timestamp": 1603139003.0,
            "image": null,
            "author": "Soonest Nathaniel"
        },
        {
            "title": "Leave The Road And Lets Dialogue, Sanwo-Olu Appeals To Protesters",
            "link": "https://www.channelstv.com/2020/10/19/leave-the-road-and-lets-dialogue-sanwo-olu-appeals-to-protesters/",
            "description": "Lagos State Governor Babajide Sanwo-Olu has, again, appealed to the youths demonstrating against police brutality in the State to leave the roads and embrace the dialogue for the resolution of their agitations. The Governor, on Monday, said the State Government had shown sincerity and willingness to address all concerns raised by the protesters, given … Continue reading Leave The Road And Let’s Dialogue, Sanwo-Olu Appeals To Protesters",
            "timestamp": 1603130526.0,
            "image": null,
            "author": "Soonest Nathaniel"
        },
        {
            "title": "Court Gives Ali Ndume 21 Days To Produce Maina",
            "link": "https://www.channelstv.com/2020/10/19/court-gives-ali-ndume-21-days-to-produce-maina/",
            "description": "A Federal High Court in Abuja has given Senator Ali Ndume 21 days to produce the former Chairman of the defunct Pension Task Team, Abdulrasheed Maina, who has repeatedly failed to appear in court for the continuation of his trial on alleged money laundering charges. Senator Ali Ndume who is representing Borno south is … Continue reading Court Gives Ali Ndume 21 Days To Produce Maina",
            "timestamp": 1603127419.0,
            "image": null,
            "author": "oluchi"
        },
        {
            "title": "Impunity By Security Agencies Will Not Be Tolerated, El-Rufai Tells Judicial Panel",
            "link": "https://www.channelstv.com/2020/10/19/impunity-by-security-agencies-will-not-be-tolerated-el-rufai-tells-judicial-panel/",
            "description": "The Kaduna State Governor, Nasir El-Rufai has inaugurated the Judicial Panel of Inquiry into Police brutality in the state with a firm assurance that impunity by security agencies will not be tolerated in the state. The panel which was inaugurated on Monday will be Retired Justice David Wyom has been given six months to … Continue reading Impunity By Security Agencies Will Not Be Tolerated, El-Rufai Tells Judicial Panel",
            "timestamp": 1603124494.0,
            "image": null,
            "author": "oluchi"
        },
        {
            "title": "#EndSARS: We Are Survivors Of Police Brutality, Nigerians Storm Embassy In Australia",
            "link": "https://www.channelstv.com/2020/10/19/endsars-we-are-survivors-of-police-brutality-nigerians-storm-embassy-in-australia/",
            "description": "A group of Nigerians have stormed the Nigerian High Commission in Australia seeking an end to police brutality and extra-judicial killings in Nigeria. The protesters said the demonstration is in solidarity with the ongoing protests in Nigeria. In a video clip obtained by Channels Television on Monday, the protesters can be seen chanting End … Continue reading #EndSARS: We Are Survivors Of Police Brutality, Nigerians Storm Embassy In Australia",
            "timestamp": 1603123957.0,
            "image": null,
            "author": "Ignatius Igwe"
        },
        {
            "title": "#EndSARS Protest: Edo Govt Sets-Up Judicial Panel",
            "link": "https://www.channelstv.com/2020/10/19/endsars-protest-edo-govt-sets-up-judicial-panel/",
            "description": "Edo State Government has set up a Judicial Panel of Inquiry into circumstances surrounding the #EndSARS protests in Edo State. Secretary to the state government, Osarodion Ogie made this announcement in a statement on Monday He said the panel is set up, in response to the yearnings of Nigerian youths, as articulated in the … Continue reading #EndSARS Protest: Edo Govt Sets-Up Judicial Panel",
            "timestamp": 1603123571.0,
            "image": null,
            "author": "Ronke Idowu"
        },
        {
            "title": "#EndSARS: What next on the youth movement?",
            "link": "https://www.blueprint.ng/endsars-what-next-on-the-youth-movement/",
            "description": "Beyond #EndSARS protests, I see the ongoing mass action against the brutality of the Nigeria Police Forces Special Anti-Robbery Squad as a social movement which can hardly be subdued by force. The movement which was initially started on Twitter by Segun Awosanya, popularly known as Segalink, saw its recent resurgence after a video started trending on Twitter showing a SARS Read More\nThe post #EndSARS: What next on the youth movement? first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603137827.0,
            "image": null,
            "author": "Gidado Shuaib"
        },
        {
            "title": "Alleged Pension Scam: Group seeks end to Mainas persecution",
            "link": "https://www.blueprint.ng/alleged-pension-scam-group-seeks-end-to-mainas-persecution/",
            "description": "A Non-governmental Organisation, Legislative Watch,  has called for an end to what it termed as persecution of former Chairman of the Pension Reformed Task Force Team (PRTT), Mr Abdulrasheed Maina, in the court of law. The group which was led by its executive secretary, Hon.Elder Ngozika Ihuema, insisted that there must be an end to judicial harassment, rascality and any Read More\nThe post Alleged Pension Scam: Group seeks end to Mainas persecution first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603137656.0,
            "image": null,
            "author": "Kehinde Osasona"
        },
        {
            "title": "Air force jets, gunships strike several terrorists, as military intensifies operations in Borno",
            "link": "https://www.blueprint.ng/air-force-jets-gunships-strike-several-terrorists-as-military-intensifies-operations-in-borno/",
            "description": "As the Nigerian military continue both ground and air assault against Boko haram terrorists in the North-east, the Nigerian Air Force jets and helicopter gunships have killed several terrorists and destroyed their camps along Tsilala in Dikwa area of Borno state. The air bombardment was conducted under a subsidiary Operation code name WUTAR TABKI, on 18 October 2020, according to Read More\nThe post Air force jets, gunships strike several terrorists, as military intensifies operations in Borno fi",
            "timestamp": 1603137568.0,
            "image": null,
            "author": "Musa Umar Bologi"
        },
        {
            "title": "AKIPCON lauds Gbajabiamila on A/Ibom oil spill probe panel",
            "link": "https://www.blueprint.ng/akipcon-lauds-gbajabiamila-on-a-ibom-oil-spill-probe-panel/",
            "description": "The Akwa Ibom Oil Producing Community Development Network (AKIPCON) has commended the speaker of House of Representatives, Femi Gbajabiamila, for constituting ad-hoc committee to investigate oil spills in oil producing states. This follows the newspaper advertorial by the House of Representatives in one of the national dailies ordering all the oil companies operating in the country to submit their oil Read More\nThe post AKIPCON lauds Gbajabiamila on A/Ibom oil spill probe panel first appeared on",
            "timestamp": 1603137469.0,
            "image": null,
            "author": "Uko Etim"
        },
        {
            "title": "#EndSARS: Gov. Abiodun inaugurates judicial panel, tasks members to be fair, firm",
            "link": "https://www.blueprint.ng/endsars-gov-abiodun-inaugurates-judicial-panel-tasks-members-to-be-fair-firm/",
            "description": "Ogun state Governor Prince Dapo Abiodun Monday inaugurated the state Judiciary Panel of Investigation on the #ENSARS protest with a call on members to make fairness, firmness, dedication and objectivity their watchwords. He also enjoined the panel to shun all acts which could impact negatively on their assignment, urging stakeholders in the security, peace and conflict resolution processes as well Read More\nThe post #EndSARS: Gov. Abiodun inaugurates judicial panel, tasks members to be fair, fir",
            "timestamp": 1603137275.0,
            "image": null,
            "author": "Hakeem Adegbenro"
        },
        {
            "title": "Hearing on Iyan Zazzaus case against KDSG begins Oct 27",
            "link": "https://www.blueprint.ng/hearing-on-iyan-zazzaus-case-against-kdsg-begins-oct-27/",
            "description": "A Kaduna state High Court sitting at Dogarawa  and presided over by Justice Kabir Dabo has fixed October 27, 2020 to commence hearing in a matter filed before it by Prince Bashir Aminu, challenging the appointment of Alhaji Ahmad Nuhu Bamalli as the 19th Emir of Zazzau. Bamallis appointment followed the demise of the late emir, Alhaji Shehu Idris, Read More\nThe post Hearing on Iyan Zazzaus case against KDSG begins Oct 27 first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603137266.0,
            "image": null,
            "author": "Moh Bello Habib"
        },
        {
            "title": "#EndSars protest: NGO decries violent dimension",
            "link": "https://www.blueprint.ng/endsars-protest-ngo-decries-violent-dimension/",
            "description": "A group under the auspices of Patriots for Growth and Development Initiative (PGDI) has decried the violent and dangerous dimension the #Endsars protest is taking across the country. Consequently, the group called on the federal government to act fast to stop the impending state of anarchy. PGDI is a local nongovernmental organisation with a missionto improve the quality of lives and livelihoods of Read More\nThe post #EndSars protest: NGO decries violent dimension first appeared on Blueprint New",
            "timestamp": 1603137121.0,
            "image": null,
            "author": "Oyibo Salihu"
        },
        {
            "title": "Suspected cultists kill 2 in Ilorin",
            "link": "https://www.blueprint.ng/suspected-cultists-kill-2-in-ilorin/",
            "description": "Two persons were reportedly killed from different attacks by suspected cultists in the metropolis, in the Kwara state capital following a resurgence activities of rival cult groups. The two lives were lost in the attacks that occured between Sunday and Monday in different parts of the state.It was gathered that the head of one of the victims was severed from Read More\nThe post Suspected cultists kill 2 in Ilorin first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603136937.0,
            "image": null,
            "author": "Umar Bayo Abdulwahab"
        },
        {
            "title": "Lawyers, students barricade Ayades office over CJs appointment",
            "link": "https://www.blueprint.ng/lawyers-students-barricade-ayades-office-over-cjs-appointment/",
            "description": "There was tension in Calabar on Monday as lawyers under the aegis of the Concerned Lawyers in Cross River, staged a peaceful protest and blocked the main entrance to Governor Ben Ayade’s office to demand the appointment of substantive chief judge for the state. Apart from staging their own protest, students of the University of Calabar (UniCal) and the Cross River University of Technology Read More\nThe post Lawyers, students barricade Ayades office over CJs appointment first appeared on Blueprin",
            "timestamp": 1603136282.0,
            "image": null,
            "author": "Joseph Obung"
        },
        {
            "title": "NOUN debunks recruitment rumour",
            "link": "https://www.blueprint.ng/noun-debunks-recruitment-rumour/",
            "description": "The attention of the National Open University of Nigeria (NOUN) has been drawn to a story making the rounds that the institution is recruiting people as members of its staff. The story, mischievously captioned ‘National Open University of Nigeria (NOUN) Recruitment 2020 and How to Apply’, is being pushed out to the public principally by two online platforms. According to Read More\nThe post NOUN debunks recruitment rumour first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603136176.0,
            "image": null,
            "author": "Eleojo Idachaba"
        },
        {
            "title": "#EndSARS protesters shutdown Uyo metropolis, chant war songs",
            "link": "https://www.blueprint.ng/endsars-protesters-shutdown-uyo-metropolis-chant-war-songs/",
            "description": "The ongoing nationwide protests against Special Anti Robbery Squad ( SARS) has taken a different turn  in Akwa Ibom state as protesters shutdown epic centres of Uyo, the Akwa Ibom state capital. Blueprint reports that the protesters who called for restructuring of Nigeria among other demands were also heard chanting war songs with some of the inscriptions, showing #endNigeria. The protesters moved Read More\nThe post #EndSARS protesters shutdown Uyo metropolis, chant war songs first appeared on B",
            "timestamp": 1603136164.0,
            "image": null,
            "author": "Uko Etim"
        },
        {
            "title": "Gowon commends NYSC managers for sustaining vision",
            "link": "https://www.blueprint.ng/gowon-commends-nysc-managers-for-sustaining-vision/",
            "description": "Former head of state, Gen Yakubu Gowon, has eulogised managers of the National Youth Service Corps (NYSC) for sustaining his vision of a united and indivisible entity which was the cardinal philosophy behind the establishment of the scheme. A statement by the director, Press and Public Relations, Mrs. Adenike Adeyemi, said Gen. Gowon who turned 86 today gave this Read More\nThe post Gowon commends NYSC managers for sustaining vision first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603136028.0,
            "image": null,
            "author": "John Oba"
        },
        {
            "title": "Jigawa federal lawmaker empowers youth, women",
            "link": "https://www.blueprint.ng/jigawa-federal-lawmaker-empowers-youth-women/",
            "description": "The Chairman, House of Representatives Committee on Power Hon, Engineer Magaji Da’u Aliyu has distributed working capital worth over N35.5million to 125 women and youths including aged ones with a view to enhance the economy of his constituency The items distributed on Sunday in Birnin Kuddu city , the headquarters of Birnin Kudu local government area of Jigawa state, included; Read More\nThe post Jigawa federal lawmaker empowers youth, women first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603135886.0,
            "image": null,
            "author": "Muhammad Aliyu"
        },
        {
            "title": "FHA, family homes sign MoU for 1000 low income houses construction",
            "link": "https://www.blueprint.ng/fha-family-homes-sign-mou-for-1000-low-income-houses-construction/",
            "description": "The managements of the Federal Housing Authority (FHA) and Family Homes Funds Limited (FHFL), Monday, signed the Memorandum of Understanding (MoU) for the construction of 1000 housing units for the low income earners. The project, which is sited in Bwari, a community in the Federal Capital Territory (FCT), is the phase one of the President Muhammadu Buhari’s 300,000 units of Read More\nThe post FHA, family homes sign MoU for 1000 low income houses construction first appeared on Blueprint Newspape",
            "timestamp": 1603135843.0,
            "image": null,
            "author": "Tope Sunday"
        },
        {
            "title": "Funds to execute projects a major challenge  Minister",
            "link": "https://www.blueprint.ng/funds-to-execute-projects-a-major-challenge-minister/",
            "description": "Minister of Finance, Budget and National Planning, Dr. (Mrs) Zainab Shamsuna Ahmed has said the greatest challenge facing the Nigerian government is inadequate revenue to execute her numerous projects and initiatives. The minister who stated this at the 26th Nigeria Economic Summit (NES#26) in Abuja over the weekend, said new sources of revenue were being identified and explored to ensure government Read More\nThe post Funds to execute projects a major challenge  Minister first appeared on Bluepr",
            "timestamp": 1603135700.0,
            "image": null,
            "author": "Donald Iorchir"
        },
        {
            "title": "2023 presidency: Northern group vows to support South-east",
            "link": "https://www.blueprint.ng/2023-presidency-northern-group-vows-to-support-south-east/",
            "description": "A group, Middle Belt Arise Forum has declared support for the Southeastern region to produce the president come 2023 presidential election, The group noted that  for unity, equity and justice to prevail in the country, the Southeast should be supported to produce the next president. The forum in a statement on Monday in Abuja  by its president, Comrade. Ilemmona Iyeh Read More\nThe post 2023 presidency: Northern group vows to support South-east first appeared on Blueprint Newspapers Limited.",
            "timestamp": 1603135672.0,
            "image": null,
            "author": "Emeka Nze"
        },
        {
            "title": "NDLEA nabs ex-staff with 254kg of marijuana",
            "link": "https://www.premiumtimesng.com/news/421741-ndlea-nabs-ex-staff-with-254kg-of-marijuana.html",
            "description": "Pam Ezekiel Adamu was serving in Gombe command before his dismissal in 2019\nThe post NDLEA nabs ex-staff with 254kg of marijuana appeared first on Premium Times Nigeria.",
            "timestamp": 1603141025.0,
            "image": null,
            "author": "Agency Report"
        },
        {
            "title": "Obasanjo, Ooni speak on #EndSARS protests",
            "link": "https://www.premiumtimesng.com/news/top-news/421739-obasanjo-ooni-speak-on-endsars-protests.html",
            "description": "The Ooni urges the protesters to give the government a chance to address their concerns.\nThe post Obasanjo, Ooni speak on #EndSARS protests appeared first on Premium Times Nigeria.",
            "timestamp": 1603140801.0,
            "image": null,
            "author": "Agency Report"
        },
        {
            "title": "#EndSARS: Umahi decries police extortion, brutality in Ebonyi",
            "link": "https://www.premiumtimesng.com/regional/ssouth-east/421737-endsars-umahi-decries-police-extortion-brutality-in-ebonyi.html",
            "description": "The governor says he will no longer accept road blocks in the state.\nThe post #EndSARS: Umahi decries police extortion, brutality in Ebonyi appeared first on Premium Times Nigeria.",
            "timestamp": 1603140458.0,
            "image": null,
            "author": "Agency Report"
        },
        {
            "title": "Abuja Police commissoner condemns killing of #EndSARS protester",
            "link": "https://www.premiumtimesng.com/regional/north-central/421734-abuja-police-commissoner-condemns-killing-of-endsars-protester.html",
            "description": "Anthony Unuode was attacked In Kubwa and died later.\nThe post Abuja Police commissoner condemns killing of #EndSARS protester appeared first on Premium Times Nigeria.",
            "timestamp": 1603140244.0,
            "image": null,
            "author": "Agency Report"
        },
        {
            "title": "#EndSARS: Governor Abiodun inaugurates judicial panel",
            "link": "https://www.premiumtimesng.com/news/more-news/421731-endsars-governor-abiodun-inaugurates-judicial-panel.html",
            "description": "The governor called on members of the panel to make fairness, firmness, dedication and objectivity their watchword.\nThe post #EndSARS: Governor Abiodun inaugurates judicial panel appeared first on Premium Times Nigeria.",
            "timestamp": 1603136854.0,
            "image": null,
            "author": "Dimeji Kayode-Adedeji"
        },
        {
            "title": "#EndSARS: Lagos orders closure of schools",
            "link": "https://www.premiumtimesng.com/news/top-news/421729-endsars-lagos-orders-closure-of-schools.html",
            "description": "The directive is for both the public and private schools.\nThe post #EndSARS: Lagos orders closure of schools appeared first on Premium Times Nigeria.",
            "timestamp": 1603136632.0,
            "image": null,
            "author": "Mojeed Alabi"
        },
        {
            "title": "#EndSARS: How thugs attacked us at CBN headquarters  Protesters",
            "link": "https://www.premiumtimesng.com/news/top-news/421724-endsars-how-thugs-attacked-us-at-cbn-headquarters-protesters.html",
            "description": "The protesters had set up their camps outside the CBN building to block the banks staff from accessing their offices.\nThe post #EndSARS: How thugs attacked us at CBN headquarters – Protesters appeared first on Premium Times Nigeria.",
            "timestamp": 1603135569.0,
            "image": null,
            "author": "George Ogala"
        },
        {
            "title": "How jail break in Edo happened  Nigerian Correctional Service",
            "link": "https://www.premiumtimesng.com/news/top-news/421721-how-jail-break-in-edo-happened-nigerian-correctional-service.html",
            "description": "Hoodlums, numbering over 100, reportedly broke open one of the cells and freed several inmates in the process.\nThe post How jail break in Edo happened — Nigerian Correctional Service appeared first on Premium Times Nigeria.",
            "timestamp": 1603133646.0,
            "image": null,
            "author": "Oge Udegbunam"
        },
        {
            "title": "Protests in Kano as man dies in police custody",
            "link": "https://www.premiumtimesng.com/regional/nwest/421718-protests-in-kano-as-man-dies-in-police-custody.html",
            "description": "Residents said the police on Sunday re-arrested one Saifullahi Sani but the police returned the corpse of the arrested man on Monday.\nThe post Protests in Kano as man dies in police custody appeared first on Premium Times Nigeria.",
            "timestamp": 1603131901.0,
            "image": null,
            "author": "Abubakar Ahmadu Maishanu"
        },
        {
            "title": "#EndSARS not peaceful  Nigerian Govt",
            "link": "https://www.premiumtimesng.com/news/headlines/421716-endsars-not-peaceful-nigerian-govt.html",
            "description": "The protest cannot be said to be peaceful when innocent people are losing their lives and Nigerians are being prevented from going to their places of work where they earn their living.\nThe post #EndSARS ‘not peaceful’ — Nigerian Govt appeared first on Premium Times Nigeria.",
            "timestamp": 1603131205.0,
            "image": null,
            "author": "Agency Report"
        },
        {
            "title": "Buhari approves removal of Board Chairman of Nigerian Copyrights Commission",
            "link": "https://www.premiumtimesng.com/news/top-news/421713-buhari-approves-removal-of-board-chairman-of-nigerian-copyrights-commission.html",
            "description": "He was directed to handover all property of the commission to the Director General, John Asien.\nThe post Buhari approves removal of Board Chairman of Nigerian Copyrights Commission appeared first on Premium Times Nigeria.",
            "timestamp": 1603129945.0,
            "image": null,
            "author": "Agency Report"
        },
        {
            "title": "NHRC calls for prosecution of 35 indicted police officers by AGF",
            "link": "https://www.premiumtimesng.com/news/top-news/421711-nhrc-calls-for-prosecution-of-35-indicted-police-officers-by-agf.html",
            "description": "The commission submits a report of the Presidential Investigation Panel to the attorney general.\nThe post NHRC calls for prosecution of 35 indicted police officers by AGF appeared first on Premium Times Nigeria.",
            "timestamp": 1603129652.0,
            "image": null,
            "author": "Agency Report"
        },
        {
            "title": "#EndSARS: Protesters in Ekiti block highway",
            "link": "https://www.premiumtimesng.com/regional/ssouth-west/421706-endsars-protesters-in-ekiti-block-highway.html",
            "description": "The protesters are also demanding justice for the two students that were allegedly slain last year by the security detail attached to Ekiti Governors wife.\nThe post #EndSARS: Protesters in Ekiti block highway appeared first on Premium Times Nigeria.",
            "timestamp": 1603128537.0,
            "image": null,
            "author": "George Ogala"
        },
        {
            "title": "#EndSARS: EFCC admits website was attacked",
            "link": "https://www.premiumtimesng.com/news/top-news/421700-endsars-efcc-admits-website-was-attacked.html",
            "description": "A group of foreign activists had claimed responsibility of attacking the EFCC website in support on the nationwide #EndSARS protest.\nThe post #EndSARS: EFCC admits website was attacked appeared first on Premium Times Nigeria.",
            "timestamp": 1603126940.0,
            "image": null,
            "author": "Kunle Sanni"
        },
        {
            "title": "#EndSARS: Tinubu pleads with protesters to give peace a chance",
            "link": "https://tribuneonlineng.com/endsars-tinubu-pleads-with-protesters-to-give-peace-a-chance/",
            "description": "Tribune Online\n#EndSARS: Tinubu pleads with protesters to give peace a chance\n\nThe National Leader of the All Progressives Congress (APC) and former Lagos State governor, Asiwaju Bola Tinubu, has appealed to #EndSARS protesters demonstrating against police brutality and extrajudicial killings to call off the protests and give peace a chance. This was contained in a statement on Monday night titled; #EndSARS Protests  The Remedy For […]\n#EndSARS: Tinubu pleads with protesters to give peace a chan",
            "timestamp": 1603150993.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2019/10/Tinubu-1.jpg",
            "author": "Tribune Online"
        },
        {
            "title": "NCDC confirms 118 new COVID-19 cases, total now 61,558",
            "link": "https://tribuneonlineng.com/ncdc-confirms-118-new-covid-19-cases-total-now-61558/",
            "description": "Tribune Online\nNCDC confirms 118 new COVID-19 cases, total now 61,558\n\nThe Nigeria Centre for Disease Control (NCDC) has confirmed 118 new cases of COVID-19 in the country, bringing the total number of confirmed cases to 61,558. The NCDC disclosed this via its verified Twitter handle @NCDCgov on Monday. “On the 19th of October 2020, 118 new confirmed cases were recorded in Nigeria. “Till date, 61558 […]\nNCDC confirms 118 new COVID-19 cases, total now 61,558\nTribune Online",
            "timestamp": 1603146363.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/10/Covid-2.jpg",
            "author": "Tribune Online"
        },
        {
            "title": "PHOTOS: Nigerians hold #EndSARS protest in London, Ontario, Canada",
            "link": "https://tribuneonlineng.com/photos-nigerians-hold-endsars-protest-in-london-ontario-canada/",
            "description": "Tribune Online\nPHOTOS: Nigerians hold #EndSARS protest in London, Ontario, Canada\n\nNigerians in London, Ontario, Canada joined the ongoing #EndSars protest on Saturday, October 17 2020. The protest was held at Victoria Park in London. See photos below:    \nPHOTOS: Nigerians hold #EndSARS protest in London, Ontario, Canada\nTribune Online",
            "timestamp": 1603144650.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/10/IMG-20201019-WA0022.jpg",
            "author": "Tribune Online"
        },
        {
            "title": "#EndSARS: Akeredolu sets up judicial panel of inquiry",
            "link": "https://tribuneonlineng.com/endsars-akeredolu-sets-up-judicial-panel-of-inquiry/",
            "description": "Tribune Online\n#EndSARS: Akeredolu sets up judicial panel of inquiry\n\nGovernor Rotimi Akeredolu of Ondo State, on Monday, approved the constitution of an 8- member Judicial Panel of inquiry to look into complaints by members of the public on alleged illegal activities of officers of Nigeria Police Force in the state. This was contained in a statement issued and signed by the state Commissioner for […]\n#EndSARS: Akeredolu sets up judicial panel of inquiry\nTribune Online",
            "timestamp": 1603142983.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/07/Akeredolu.jpg",
            "author": "Hakeem Gbadamosi - Akure"
        },
        {
            "title": "Lagos orders closure of schools over #EndSARS protests",
            "link": "https://tribuneonlineng.com/lagos-orders-closure-of-schools-over-endsars-protests/",
            "description": "Tribune Online\nLagos orders closure of schools over #EndSARS protests\n\nThe Lagos State government has shut down all schools, directing all students in public and private schools from primary to tertiary levels in the state to stay at home. It took the decision on Monday evening following the tension already generated by the ongoing anti- SARS protests rocking the state and the country at large. […]\nLagos orders closure of schools over #EndSARS protests\nTribune Online",
            "timestamp": 1603140466.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/10/sanwo-olu.jpg",
            "author": "Tunbosun Ogundare - Lagos"
        },
        {
            "title": "#EndSARS: Edo sets up judicial panel of inquiry",
            "link": "https://tribuneonlineng.com/endsars-edo-sets-up-judicial-panel-of-inquiry/",
            "description": "Tribune Online\n#EndSARS: Edo sets up judicial panel of inquiry\n\nThe agitation by the Nigerian youths for a reformed police force in the country, using the platform of the two-week-long #EndSARS protest, received a boost, on Monday, as the Edo State Government established a Judicial Panel of Inquiry into circumstances leading to the protests in the state. A statement issued by the government and endorsed […]\n#EndSARS: Edo sets up judicial panel of inquiry\nTribune Online",
            "timestamp": 1603139761.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/09/obaseki-1.jpg",
            "author": "'Suyi Ayodele - Benin"
        },
        {
            "title": "#EndSARS: Six allegedly die, houses, vehicles set ablaze as protesters, hoodlums engage in Abuja",
            "link": "https://tribuneonlineng.com/endsars-six-die-houses-vehicles-set-ablaze-as-protesters-hoodlums-engage-in-abuja/",
            "description": "Tribune Online\n#EndSARS: Six allegedly die, houses, vehicles set ablaze as protesters, hoodlums engage in Abuja\n\nNo fewer than six people were said to have died at popular Apo Mechanic Village in the Federal Capital Territory (FCT), Abuja, following clashes between #EndSARS protesters and yet to be identified hoodlums. Houses, vehicles and shops were also set ablaze, according to the Tribune Online‘s findings. Witnesses said trouble started when some miscreants appeared […]\n#EndSARS: Six alleged",
            "timestamp": 1603134793.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/10/POLICE.jpg",
            "author": "Ademola Adegbite - Abuja"
        },
        {
            "title": "#EndSARS protest spreads in FCT satellite towns, Kurudu, Karu youths make demands",
            "link": "https://tribuneonlineng.com/endsars-protest-spreads-in-fct-satellite-towns-kurudu-karu-youths-make-demands/",
            "description": "Tribune Online\n#EndSARS protest spreads in FCT satellite towns, Kurudu, Karu youths make demands\n\nYouths in the Federal Capital Territory (FCT) have continued with the #EndSARS protest demanding an end to Police brutality, bad governance, eradication of corruption and total reforms of security apparatus to tackle the insecurity in the country. The protest which was held in many satellite towns in the FCT areas had large turnouts. A tour […]\n#EndSARS protest spreads in FCT satellite towns, Kurudu",
            "timestamp": 1603134056.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/10/Benin-2.jpg",
            "author": "Tyavzua Saanyol - Abuja"
        },
        {
            "title": "Agric minister receives 2020 Wet Season agricultural performance survey report",
            "link": "https://dailytimes.ng/agric-minister-receives-2020-wet-season-agricultural-performance-survey-report/",
            "description": "The Minister of Agriculture and Rural Development, Alhaji Muhammad Sabo Nanono has received the 2020 Wet Season Agricultural Performance Survey Report(APSR), Daily Times reports. Nanono commended the Committee for a detailed report, adding that it will guide the ministry and farmers in planning and preparing ahead of the commencement of the dry season farming. While […]\nThe post Agric minister receives 2020 Wet Season agricultural performance survey report appeared first on Daily Times Nigeria.",
            "timestamp": 1603128059.0,
            "image": null,
            "author": "Goodness Nwogwugwu"
        },
        {
            "title": "#EndSARS: Shiites protest in Kaduna, demand el-Zakzakys release",
            "link": "https://dailytimes.ng/endsars-shiites-protest-in-kaduna-demand-el-zakzakys-release/",
            "description": "Members of the Islamic Movement in Nigeria, otherwise known as Shiites, have protested the five years remembrance of their clash with soldiers in Zaria, which they called massacre and continued detention of their leader, Sheikh Ibrahim El-Zakzaky, and his wife Malama Zeenatuddin Ibrahim, Daily Times gathered. The Shiites members including Children, between the ages of […]\nThe post #EndSARS: Shiites protest in Kaduna, demand el-Zakzakys release appeared first on Daily Times Nigeria.    Nigeria Ne",
            "timestamp": 1603123962.0,
            "image": null,
            "author": "Goodness Nwogwugwu"
        },
        {
            "title": "COVID-19: Nigeria discharged 4,850 last week, highest figure in four weeks",
            "link": "https://tribuneonlineng.com/covid-19-nigeria-discharged-4850-last-week-highest-figure-in-four-weeks/",
            "description": "Tribune Online\nCOVID-19: Nigeria discharged 4,850 last week, highest figure in four weeks\n\nLast week, Nigeria recorded a total of 4850 recoveries, the figure which is the highest the country has recorded in four weeks, Tribune Online reports. The last time the country recorded high recoveries was from September 13 to 19 where a total of 4,343 persons recovered and were discharged. The recoveries began to drop from […]\nCOVID-19: Nigeria discharged 4,850 last week, highest figure in four weeks\nTri",
            "timestamp": 1603143095.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/10/covid-19-2.jpg",
            "author": "Faith Adeoye"
        },
        {
            "title": "#EndSARS: PTF warns of COVID-19 risks in protest gatherings",
            "link": "https://tribuneonlineng.com/endsars-ptf-warns-of-covid-19-risks-in-protest-gatherings/",
            "description": "Tribune Online\n#EndSARS: PTF warns of COVID-19 risks in protest gatherings\n\nThe Presidential Task on the COVID-19 Pandemic has warned of the risks of #EndSARS protesters contracting the virus because of scant regard for prescribed protocols. The Chairman of the task force and Secretary to Government of the Federation (SGF), Boss Mustapha, who made the assertion at a press briefing in Abuja on Monday, said there […]\n#EndSARS: PTF warns of COVID-19 risks in protest gatherings\nTribune Online",
            "timestamp": 1603133149.0,
            "image": "https://tribuneonlineng.com/wp-content/uploads/2020/05/Boss-Mustapha.jpg",
            "author": "Leon Usigbe - Abuja"
        },
        {
            "title": "#EndSARS: Expect spike in COVID-19 infections, PTF tells Nigerians",
            "link": "https://dailynigerian.com/endsars-expect-spike-in-covid-19-infections-ptf-tells-nigerians/",
            "description": "The Presidential Task Force on COVID-19 has predicted a spike in the Coronavirus (COVID-19) pandemic outbreak in the country in the next two weeks. Boss Mustapha, the Secretary to the Government of the Federation, SGF and Chairman, Presidential Task Force, PTF on COVID-19, made this known on Monday in Abuja at the joint national briefing […]\nThe post #EndSARS: Expect spike in COVID-19 infections, PTF tells Nigerians appeared first on Daily Nigerian.",
            "timestamp": 1603145161.0,
            "image": null,
            "author": "News Desk"
        },
        {
            "title": "CBN releases framework for financing of mass metering",
            "link": "https://dailynigerian.com/cbn-releases-framework-for-financing-of-mass-metering/",
            "description": "The Central Bank of Nigeria, CBN, has released its framework for National Mass Metering Programme, NMMP. The framework was released by the Development Financing department of the apex bank through its official website on Monday. It stated that introduction of the Service-Based Tariff, SBT, in the Nigeria Electricity Supply Industry, NESI, effective September 1, had […]\nThe post CBN releases framework for financing of mass metering appeared first on Daily Nigerian.",
            "timestamp": 1603143374.0,
            "image": null,
            "author": "News Desk"
        },
        {
            "title": "Thugs disrupt #EndSARS protest, burn down hundreds of vehicles in Abuja",
            "link": "https://dailynigerian.com/thugs-disrupt-endsars-protest-burn-down-hundreds-of-vehicles-in-abuja/",
            "description": "Suspected thugs have attacked a group of #EndSARS protesters, burning down hundreds of their vehicles in Abuja. DAILY NIGERIAN gathered that the incident happened around 5:00 pm, took place at the Kabusa Junction, near Apo Resettlement, in Apo District of the Federal Capital Territory, FCT. Details later Information reaching me is that this happened in […]\nThe post Thugs disrupt #EndSARS protest, burn down hundreds of vehicles in Abuja appeared first on Daily Nigerian.",
            "timestamp": 1603132864.0,
            "image": null,
            "author": "Ibrahim Ramalan"
        },
        {
            "title": "Buhari sacks copyright commission chairman",
            "link": "https://dailynigerian.com/buhari-sacks-copyright-commission-chairman/",
            "description": "President Muhamadu Buhari has sacked the Chairman, Governing Board of the Nigerian Copyright Commission, NCC, Tonye Clinton Jaja.\nThe post Buhari sacks copyright commission chairman appeared first on Daily Nigerian.",
            "timestamp": 1603130443.0,
            "image": null,
            "author": "Rayyan Alhassan"
        },
        {
            "title": "Kwankwaso floats radio station in Kano, appoints Maude Gwadabe GM",
            "link": "https://dailynigerian.com/kwankwaso-floats-radio-station-in-kano-appoints-maude-gwadabe-gm/",
            "description": "A former governor of Kano State and leader of Kwankwasiyya movement, Rabiu Kwankwaso, has established a radio station in Kano and appointed a former BBC journalist, Maude Gwadabe, as the pioneer general manager. The station, named Nasara Radio, has been granted approval by the National Broadcasting Corporation, NBC, to start test transmission this week at […]\nThe post Kwankwaso floats radio station in Kano, appoints Maude Gwadabe GM appeared first on Daily Nigerian.",
            "timestamp": 1603130087.0,
            "image": null,
            "author": "Mustapha Usman"
        },
        {
            "title": "#EndSARS: Police deny disrupting protest in Ilorin",
            "link": "https://dailynigerian.com/endsars-police-deny-disrupting-protest-in-ilorin/",
            "description": "The Police Command in Kwara State has debunked the alleged involvement of its personnel in the disruption of the #EndSARS protest, held in Ilorin on Sunday.\nThe post #EndSARS: Police deny disrupting protest in Ilorin appeared first on Daily Nigerian.",
            "timestamp": 1603128800.0,
            "image": null,
            "author": "Rayyan Alhassan"
        },
        {
            "title": "#EndSARS: Were meeting your demands, Nigerian govt tells protesters",
            "link": "https://dailynigerian.com/endsars-were-meeting-your-demands-nigerian-govt-tells-protesters/",
            "description": "The Federal Government has assured Nigerians based in Canada of its deference to their collective call for improved governance back home.\nThe post #EndSARS: Were meeting your demands, Nigerian govt tells protesters appeared first on Daily Nigerian.",
            "timestamp": 1603128661.0,
            "image": null,
            "author": "Rayyan Alhassan"
        },
        {
            "title": "Dismissed NDLEA staff arrested with 254kg weeds in Niger",
            "link": "https://dailynigerian.com/dismissed-ndlea-staff-arrested-with-254kg-weeds-in-niger/",
            "description": "The National Drug Law Enforcement Agency, NDLEA, Niger Command, has arrested one Pam Ezekiel Adamu, 46, a dismissed staff of the agency, with 254kg of dried weeds suspected to be cannabis sativa.\nThe post Dismissed NDLEA staff arrested with 254kg weeds in Niger appeared first on Daily Nigerian.",
            "timestamp": 1603126283.0,
            "image": null,
            "author": "Rayyan Alhassan"
        },
        {
            "title": "Senate President sponsors wedding of 100 orphans, less privileged couples in Yobe",
            "link": "https://dailynigerian.com/senate-president-sponsors-wedding-of-100-orphans-less-privileged-couples-in-yobe/",
            "description": "The Senate President, Ahmed Lawan, on Saturday sponsored the wedding of 100 orphans and less-privileged couples of his constituents, in the Karasuwa and Nguru Local Government Areas of Yobe State.\nThe post Senate President sponsors wedding of 100 orphans, less privileged couples in Yobe appeared first on Daily Nigerian.",
            "timestamp": 1603125192.0,
            "image": null,
            "author": "Rayyan Alhassan"
        },
        {
            "title": "Stanbic IBTC introduces Super App; upgraded with exciting features to enable seamless transactions",
            "link": "https://nairametrics.com/2020/10/19/stanbic-ibtc-introduces-super-app-upgraded-with-exciting-features-to-enable-seamless-transactions/",
            "description": "Stanbic IBTC Holdings PLC has upgraded its mobile App by introducing exciting features to enable seamless transactions.",
            "timestamp": 1603145803.0,
            "image": null,
            "author": "NM Partners"
        },
        {
            "title": "Lagos orders shutdown of all schools over #EndSARS protests",
            "link": "https://nairametrics.com/2020/10/19/breaking-lagos-orders-shutdown-of-all-schools-over-endsars-protests/",
            "description": "Lagos State Government has ordered the closure of all public and private schools in the state.",
            "timestamp": 1603134449.0,
            "image": null,
            "author": "Chike Olisah"
        },
        {
            "title": "2021 Budget: Education and Health sectors to gulp N1.76 trillion",
            "link": "https://nairametrics.com/2020/10/19/2021-budget-education-and-health-sectors-to-gulp-n1-76-trillion/",
            "description": "A total sum of N1.76 trillion has been allocated to the Health and Educational sectors in the 2021 budget.",
            "timestamp": 1603133646.0,
            "image": null,
            "author": "Chidi Emenike"
        },
        {
            "title": "#EndSARS protests dampen market liquidity at Nigerian Stock Market",
            "link": "https://nairametrics.com/2020/10/19/endsars-protests-dampen-market-liquidity-at-nigerian-stock-market/",
            "description": "INTBREW led 19 Gainers as against 18 Losers topped by ETERNA at the end of todays session.",
            "timestamp": 1603133245.0,
            "image": null,
            "author": "Olumide Adesina"
        },
        {
            "title": "Nigerian firm set to raise $1.2 billion to purchase electricity meters",
            "link": "https://nairametrics.com/2020/10/19/nigerian-firm-set-to-raise-1-2-billion-to-purchase-electricity-meters/",
            "description": "MAPCo plans to raise N480 billion to purchase electricity meters and to help the DISCOs plug revenue gaps in their operations.",
            "timestamp": 1603131318.0,
            "image": null,
            "author": "Chike Olisah"
        },
        {
            "title": "More agriculture loans but longstanding bottlenecks remain",
            "link": "https://nairametrics.com/2020/10/19/more-agriculture-loans-but-longstanding-bottlenecks-remain/",
            "description": "Despite the flurry of funds provided via intervention policies, long-standing bottlenecks in the agric sector still exist.",
            "timestamp": 1603128979.0,
            "image": null,
            "author": "CSL Stockbrokers"
        },
        {
            "title": "NCC sets up committee to review licensing framework of Infrastructure Companies",
            "link": "https://nairametrics.com/2020/10/19/ncc-sets-up-committee-to-review-licensing-framework-of-infrastructure-companies/",
            "description": "The NCC has set up a committee to review the framework for the licensing of the current Infrastructure Companies.",
            "timestamp": 1603128214.0,
            "image": null,
            "author": "Omokolade Ajayi"
        },
        {
            "title": "Furera Jumare resigns from Union Bank Board following appointment by Jigawa State",
            "link": "https://nairametrics.com/2020/10/19/furera-jumare-resigns-from-union-bank-board-following-appointment-by-jigawa-state/",
            "description": "Mrs. Furera Isma Jumare has resigned her role on the Board of Union Bank of Nigeria Plc.",
            "timestamp": 1603125954.0,
            "image": null,
            "author": "NM Press"
        },
        {
            "title": "Nigerias $1.5 billion steel plant set to produce 1 million MT of steel annually",
            "link": "https://nairametrics.com/2020/10/19/nigerias-1-5-billion-steel-plant-set-to-produce-1-million-mt-of-steel-annually/",
            "description": "Nigeria nears steel independence as $1.5 billion steel plant in Kaduna is set to produce 1 million MT of steel annually.",
            "timestamp": 1603125189.0,
            "image": null,
            "author": "Omokolade Ajayi"
        },
        {
            "title": "COVID-19: NCDC confirms 118 new infections in Nigeria",
            "link": "https://nnn.ng/covid-19-ncdc-confirms-118-new-infections-in-nigeria/",
            "description": "NNN:\nNigerias tally of people infected with the COVID-19 COVID-19 pandemic has hit 61,558, with the Nigeria Centre for Disease Control (NCDC), confirming118 new cases on Monday. Thec infections were recorded in nine states and the Federal Capital Territory. The NCDC, which disclosed this via its official Twitter handle, also announced the discharge of 86 patients […]\nCOVID-19: NCDC confirms 118 new infections in Nigeria appeared first on NNN.",
            "timestamp": 1603151892.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Racheal Abujah"
        },
        {
            "title": "FG flags off special grant for rural women, earmarks over N140 billion",
            "link": "https://nairametrics.com/2020/10/19/fg-flags-off-special-grant-for-rural-women-earmarks-over-n140-billion/",
            "description": "FG has kicked-off a grant that will see over 700,000 rural women benefitting N20,000 each.",
            "timestamp": 1603123666.0,
            "image": null,
            "author": "Chidi Emenike"
        },
        {
            "title": "Entertainment industry partners LASG, finance ministry to harness potential",
            "link": "https://nnn.ng/entertainment-industry-partners-lasg-finance-ministry-to-harness-potential/",
            "description": "NNN:\nThe entertainment industry, in affiliation with the Lagos State Government and the Federal ministry of information and Culture, is to launch an innovative Roundtable toward harnessing the potential of the industry. Also in the partnership is the Federal Ministry of Finance and Budget Planning, according to Mr Chuks Akamadu, Director General of Afrocultour, a brainchild […]\nEntertainment industry partners LASG, finance ministry to harness potential appeared first on NNN.",
            "timestamp": 1603150991.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Patricia Amogu"
        },
        {
            "title": "Real Estate: Firm targets 25,000 green homes within 15 years",
            "link": "https://nnn.ng/real-estate-firm-targets-25000-green-homes-within-15-years/",
            "description": "NNN:\nA real estate outfit, G-Text Homes, has unveiled plans to build 25,000 green and smart homes over the next 15 years to bridge Nigerias housing deficit. Dr Steven Akintayo, the companys Managing Director, told the News Agency of Nigeria on Monday in Lagos that the 25,000 eco-friendly homes would be built in 200 estates across […]\nReal Estate: Firm targets 25,000 green homes within 15 years appeared first on NNN.",
            "timestamp": 1603144695.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Rukayat Moisemhe"
        },
        {
            "title": "Centre mulls welfare, insurance scheme for journalists",
            "link": "https://nnn.ng/centre-mulls-welfare-insurance-scheme-for-journalists/",
            "description": "NNN:\nThe Vision Centre for Communication and Development Advocacy (VCCDA), has embarked on awareness creation to mobilise support for the revival of improved welfare package and insurance scheme for journalists in the country. The Acting Chairman of the centre, Mr Gbenga Onayiga, said this at a one-day workshop in Kano on Monday. Onayiga said the revival […]\nCentre mulls welfare, insurance scheme for journalists appeared first on NNN.",
            "timestamp": 1603144149.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Rabiu Saniali"
        },
        {
            "title": "#EndSARS: LCCI urges youth on dialogue",
            "link": "https://nnn.ng/endsars-lcci-urges-youth-on-dialogue/",
            "description": "NNN:\nThe Lagos Chamber of Commerce and Industry (LCCI) has advised the EndSARS protesters to progress to dialogue as the next stage of civic engagement, in consideration of economic activities. Mrs Toki Mabogunje, President, LCCI, made the appeal in a statement on Monday in Lagos. Mabogunje said the dialogue phase wasnecessary to reduce the massive disruptions, […]\n#EndSARS: LCCI urges youth on dialogue appeared first on NNN.",
            "timestamp": 1603144093.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Rukayat Moisemhe"
        },
        {
            "title": "Orji Kalu salutes Gowon at 86",
            "link": "https://nnn.ng/orji-kalu-salutes-gowon-at-86/",
            "description": "NNN:\nChief Whip of the Senate, Sen. Orji Kalu has felicitated with the former Head of State and National Chairman of Nigeria Prays, Gen. Yakubu Gowon (rtd) on his 86th birthday. Kalu, in a goodwill message to the former Head of State, acknowledged his invaluable contributions to the social, economic and political development of Nigeria. According […]\nOrji Kalu salutes Gowon at 86 appeared first on NNN.",
            "timestamp": 1603143249.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Ikenna Uwadileke"
        },
        {
            "title": "FHA, Family Homes Funds, collaborate to deliver 1,000 affordable houses",
            "link": "https://nnn.ng/fha-family-homes-funds-collaborate-to-deliver-1000-affordable-houses/",
            "description": "NNN:\nThe Federal Housing Authority and Family Homes Funds have come together in a partnership to deliver 1,000 affordable housing units to low income Nigerians. This was disclosed on Monday during the signing of a Memorandum of Understanding by the two organisations in Abuja. Sen. Gbenga Ashafa, the Managing Director, FHA, while signing on behalf of […]\nFHA, Family Homes Funds, collaborate to deliver 1,000 affordable houses appeared first on NNN.",
            "timestamp": 1603143196.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Onuegbu Perpetua"
        },
        {
            "title": "Zamfara House of Assembly summons 2 Commissioners, Special Adviser over N37bn promissory note",
            "link": "https://nnn.ng/zamfara-house-of-assembly-summons-2-commissioners-special-adviser-over-n37bn-promissory-note/",
            "description": "NNN:\nThe Zamfara House of Assembly has directed the states Attorney-General/Commissioner for Justice and his Finance Ministry counterpart to appear before itover a promissory note transaction. Mustafa Jafaru-Kaura, the Houses Director-General, Press Affairs and Public Relations, disclosed this in a statement issued to newsmen in Gusau on Monday. He said the transaction was in connection with […]\nZamfara House of Assembly summons 2 Commissioners, Special Adviser over N37bn promissory note appeare",
            "timestamp": 1603142658.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Ishaq Zaki"
        },
        {
            "title": "Dana Air partners Nigerian Economic Summit Group",
            "link": "https://nnn.ng/dana-air-partners-nigerian-economic-summit-group/",
            "description": "NNN:\nThe Management of DanaAir says it will be supporting the 26th Nigerian Economic Summit (NES#26) scheduled to hold in Oct.26 and Oct. 27 in Abuja and the Lagos office of the Nigerian Economic Summit Group. The Media Communications Manager of the company, Mr Kingsley Ezenwa, said this in a statement in Lagos on Monday. Ezenwa […]\nDana Air partners Nigerian Economic Summit Group appeared first on NNN.",
            "timestamp": 1603142590.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Yunus Yusuf"
        },
        {
            "title": "CBN releases framework for financing of mass metering",
            "link": "https://nnn.ng/cbn-releases-framework-for-financing-of-mass-metering/",
            "description": "NNN:\nCentral Bank of Nigeria (CBN) has released its framework for National Mass Metering Programme (NMMP). The framework was released by the Development Financing department of the apex bank through its official website on Monday. It stated that introduction of the Service-Based Tariff (SBT) in the Nigeria Electricity Supply Industry (NESI) effective Sept. 1, had put […]\nCBN releases framework for financing of mass metering appeared first on NNN.",
            "timestamp": 1603141872.0,
            "image": "https://i1.wp.com/nnn.ng/wp-content/uploads/2020/07/Nigeria-News-Nigeria-Newspapers-breaking-news-today-1-1000x600.jpg",
            "author": "Abdulrahman Kadiri"
        },
        {
            "title": "Why cant you cook?  Kiddwaya reveals Erica cant cook as they expose each other on Twitter",
            "link": "https://www.gistreel.com/why-cant-you-cook-kiddwaya-reveals-erica-cant-cook-as-they-expose-each-other-on-twitter/",
            "description": "GistReel\nBBNaija’s Kiddwaya has revealed Erica can’t cook after they both exposed each other’s flaws in a question and answer session. The former BBNaija housemates and lovers took to the micro blogging platforms and literary “exposed” each other after Kiddwaya kicked off a question and answer session on his page. It all started when Kiddwaya tweeted […]",
            "timestamp": 1603139085.0,
            "image": null,
            "author": "Ugochukwu Madu"
        },
        {
            "title": "Lagos state government shuts down all schools over #EndSARS protests",
            "link": "https://www.gistreel.com/lagos-state-government-shuts-down-all-schools-over-endsars-protests/",
            "description": "GistReel\nThe Lagos State Government has ordered the closure of public and private schools in the state indefinitely. This was announced in a press statement by the states Head of Public Affairs, Ministry of Education, Kayode Abayomi, on Monday. The statement was titled, Lagos directs students to stay at home. It quoted the Commissioner for Education, […]",
            "timestamp": 1603136450.0,
            "image": null,
            "author": "Gift Ama"
        },
        {
            "title": "Picture of a student going to school with a stove frame to be used as a chair in class sparks outrage online",
            "link": "https://www.gistreel.com/picture-of-a-student-going-to-school-with-a-stove-frame-to-be-used-as-a-chair-in-class-sparks-outrage-online/",
            "description": "GistReel\nA viral photo of a student spotted going to school with a kerosene stove frame to be used as a chair in class has sparked outrage online. In a now viral picture, the student who by her size is assumed to be a primary school pupil, is seen walking to school with what she takes […]",
            "timestamp": 1603134250.0,
            "image": null,
            "author": "Ugochukwu Madu"
        },
        {
            "title": "#EndSARS: Leave The Roads, Embrace Dialogue  Governor Sanwo-Olu",
            "link": "https://www.gistreel.com/endsars-leave-the-roads-embrace-dialogue-governor-sanwo-olu/",
            "description": "GistReel\nThe governor of Lagos state, Babajide Sanwo-Olu has called for a pause on the ongoing #EndSARS protest in order for the government to work in meeting the youth’s demands. The #Endsars movement is a fight against police brutality and extra-judicial killing in the country and has been on for more than 10 days nationwide. In […]",
            "timestamp": 1603133856.0,
            "image": null,
            "author": "Ismail"
        },
        {
            "title": "#EndSARS: Over 20 protesters cars burnt in Abuja (Video)",
            "link": "https://www.gistreel.com/endsars-over-200-protesters-cars-burnt-in-abuja-video/",
            "description": "GistReel\nOver 20 cars belonging to protesters have been burnt by some allegedly paid hoodlums in Abuja in order to disrupt the ongoing #EndSARs protest. In the early hours of today, the police were deployed to the protest ground to disperse protesters but were unfortunately overpowered by the protesters. Later in the day, thugs swamped the […]",
            "timestamp": 1603132105.0,
            "image": null,
            "author": "Ismail"
        },
        {
            "title": "#EndSARS Protesters storm Lagos airport, halt activities (Photos/Videos)",
            "link": "https://www.gistreel.com/endsars-protesters-storm-lagos-airport-halt-activities-photos-videos/",
            "description": "GistReel\nYoung Nigerians Monday stormed the Murtala Mohammed International Airport, Lagos, disrupting flight activities. It was gathered that the protesters had earlier blocked the road leading to the airport. For several days now Nigerians have been on the streets across the country calling for a reformation of the Nigeria Police Force. The protesters are also demanding […]",
            "timestamp": 1603131037.0,
            "image": null,
            "author": "Gift Ama"
        },
        {
            "title": "#EndSARS: Nigerian Youths Are Entitled To Peaceful Protests  President Buhari",
            "link": "https://www.gistreel.com/endsars-nigerian-youths-are-entitled-to-peaceful-protests-president-buhari/",
            "description": "GistReel\nAs #EndSARS protest in Nigeria heightens, President Muhammadu Buhari has said that youths are entitled to peaceful protests. He made this known in a meeting with the Minister of Youths and Sports Development, Sunday Dare. The Minister who relayed his words to the press said the president vowed to implement police reforms he promised. Speaking […]",
            "timestamp": 1603126639.0,
            "image": null,
            "author": "Ugochukwu Madu"
        },
        {
            "title": "Indigenous People of Abuja give #EndSARS protesters 48 hours to vacate roads or they will engage them (Video)",
            "link": "https://www.gistreel.com/indigenous-people-of-abuja-give-endsars-protesters-48-hours-to-vacate-roads-or-they-will-engage-them-video/",
            "description": "GistReel\nSome Nigerians under the aegis of “Indigenous People of Abuja” have given a 48-hour ultimatum to #EndSARS protesters to vacate the roads or have them to contend with. The group made their warning known at the police headquarters in Abuja today, October 19, 2020. They stormed the Abuja police headquarters with a written petition to […]",
            "timestamp": 1603125635.0,
            "image": null,
            "author": "Ugochukwu Madu"
        },
        {
            "title": "Prisoners with potbelly, necklace, fresh pink lips, no uniform  Nigerians react to Edo prison break",
            "link": "https://www.gistreel.com/prisoners-with-potbelly-necklace-fresh-pink-lips-no-uniform-nigerians-react-to-edo-prison-break/",
            "description": "GistReel\nDavido and other Nigerians have raised important questions as they react to news about thugs who hijacked #EndSARS protests in Benin City, Edo State and freed inmates from prison. Recall we earlier reported that thugs hijacked #EndSARS protest in Edo and freed inmates from the White House prison. Nigerians have now taken to social media […]",
            "timestamp": 1603124093.0,
            "image": null,
            "author": "Ugochukwu Madu"
        },
        {
            "title": "#EndSARS: Expect spike in COVID-19 infections, PTF tells Nigerians",
            "link": "https://theeagleonline.com.ng/endsars-expect-spike-in-covid-19-infections-ptf-tells-nigerians/?utm_source=rss&utm_medium=rss&utm_campaign=endsars-expect-spike-in-covid-19-infections-ptf-tells-nigerians",
            "description": "Boss Mustapha, the Secretary to the Government of the Federation and Chairman, Presidential Task Force on COVID-19, made this known on Monday in Abuja at the joint national briefing of the task force.\nThe post #EndSARS: Expect spike in COVID-19 infections, PTF tells Nigerians appeared first on The Eagle Online.",
            "timestamp": 1603149151.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "CBN releases framework for financing of mass metering",
            "link": "https://theeagleonline.com.ng/cbn-releases-framework-for-financing-of-mass-metering/?utm_source=rss&utm_medium=rss&utm_campaign=cbn-releases-framework-for-financing-of-mass-metering",
            "description": "The framework was released by the Development Financing Department of the apex bank through its official website on Monday.\nThe post CBN releases framework for financing of mass metering appeared first on The Eagle Online.",
            "timestamp": 1603148844.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "#EndSARS: List of indicted operatives submitted to AGF, NHRC seeks implementation",
            "link": "https://theeagleonline.com.ng/endsars-list-of-indicted-operatives-submitted-to-agf-nhrc-seeks-implementation/?utm_source=rss&utm_medium=rss&utm_campaign=endsars-list-of-indicted-operatives-submitted-to-agf-nhrc-seeks-implementation",
            "description": "report of the Presidential Investigation Panel on allegations of human rights violations against the disbanded Special Anti-Robbery Squad.\nThe post #EndSARS: List of indicted operatives submitted to AGF, NHRC seeks implementation appeared first on The Eagle Online.",
            "timestamp": 1603148779.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Stop instigating youths for #EndSARS protest, FG admonishes leaders",
            "link": "https://theeagleonline.com.ng/stop-instigating-youths-for-endsars-protest-fg-admonishes-leaders/?utm_source=rss&utm_medium=rss&utm_campaign=stop-instigating-youths-for-endsars-protest-fg-admonishes-leaders",
            "description": "Leaders should stop instigating the protests because that could lead to anarchy, Information and Culture Minister Lai Mohammed said at a special NAN Forum on Monday in Abuja.\nThe post Stop instigating youths for #EndSARS protest, FG admonishes leaders appeared first on The Eagle Online.",
            "timestamp": 1603148629.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Union Bank Director resigns",
            "link": "https://theeagleonline.com.ng/union-bank-director-resigns/?utm_source=rss&utm_medium=rss&utm_campaign=union-bank-director-resigns",
            "description": "Beatrice Hamza-Bassey, Chairman of the board, made the disclosure in a statement in Lagos on Monday.\nThe post Union Bank Director resigns appeared first on The Eagle Online.",
            "timestamp": 1603148623.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "CP condemns murder of #EndSARS protester in Abuja",
            "link": "https://theeagleonline.com.ng/cp-condemns-murder-of-endsars-protester-in-abuja/?utm_source=rss&utm_medium=rss&utm_campaign=cp-condemns-murder-of-endsars-protester-in-abuja",
            "description": "In a statement on Monday in Abuja, the Police Public Relations Officer in the FCT, ASP Mariam Yusuf, said the victim was attacked by hoodlums who infiltrated the ranks of the #EndSARS protesters.\nThe post CP condemns murder of #EndSARS protester in Abuja appeared first on The Eagle Online.",
            "timestamp": 1603148539.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Clerics urge Buhari to listen, meet demands of #EndSARS protesters",
            "link": "https://theeagleonline.com.ng/clerics-urge-buhari-to-listen-meet-demands-of-endsars-protesters/?utm_source=rss&utm_medium=rss&utm_campaign=clerics-urge-buhari-to-listen-meet-demands-of-endsars-protesters",
            "description": "Uwubanwen made the call on Monday in Abuja while briefing newsmen on activities lined up for the commemoration of the 10th year anniversary of the Church, with the theme: Shift.\nThe post Clerics urge Buhari to listen, meet demands of #EndSARS protesters appeared first on The Eagle Online.",
            "timestamp": 1603148531.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Military air strikes eliminate several terrorists in Borno  DHQ",
            "link": "https://theeagleonline.com.ng/military-air-strikes-eliminate-several-terrorists-in-borno-dhq/?utm_source=rss&utm_medium=rss&utm_campaign=military-air-strikes-eliminate-several-terrorists-in-borno-dhq",
            "description": "The Coordinator, Defence Media Operations, Major General John Enenche, disclosed this in a statement on Monday in Abuja.\nThe post Military air strikes eliminate several terrorists in Borno  DHQ appeared first on The Eagle Online.",
            "timestamp": 1603148523.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Gov. Fintiri approves appointment of 11 Perm Secs",
            "link": "https://theeagleonline.com.ng/gov-fintiri-approves-appointment-of-11-perm-secs/?utm_source=rss&utm_medium=rss&utm_campaign=gov-fintiri-approves-appointment-of-11-perm-secs",
            "description": "The News Agency of Nigeria reports that the 11 were among the 45 senior officers that sat for examination for the position of permanent secretaries.\nThe post Gov. Fintiri approves appointment of 11 Perm Secs appeared first on The Eagle Online.",
            "timestamp": 1603147434.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "AbdulRazaq briefs Kwara traditional rulers on #EndSARS protest, minimum wage",
            "link": "https://theeagleonline.com.ng/abdulrazaq-briefs-kwara-traditional-rulers-on-endsars-protest-minimum-wage/?utm_source=rss&utm_medium=rss&utm_campaign=abdulrazaq-briefs-kwara-traditional-rulers-on-endsars-protest-minimum-wage",
            "description": "AbdulRazaq, who lauded the traditional rulers for their support, said the administration respects the right of citizens to peaceful protest, calling on the elders to continue to speak up for peaceful resolutions of the demands of the young people.\nThe post AbdulRazaq briefs Kwara traditional rulers on #EndSARS protest, minimum wage appeared first on The Eagle Online.",
            "timestamp": 1603147433.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "#EndSARS: Fayemi names members of Judicial Panel on police violations",
            "link": "https://theeagleonline.com.ng/endsars-fayemi-names-members-of-judicial-panel-on-police-violations/?utm_source=rss&utm_medium=rss&utm_campaign=endsars-fayemi-names-members-of-judicial-panel-on-police-violations",
            "description": "This was made known in a statement on Monday by the Ekiti State Government.\nThe post #EndSARS: Fayemi names members of Judicial Panel on police violations appeared first on The Eagle Online.",
            "timestamp": 1603147431.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "COVID-19 claims 16 Medical Doctors in Nigeria  NMA",
            "link": "https://theeagleonline.com.ng/covid-19-claims-16-medical-doctors-in-nigeria-nma/?utm_source=rss&utm_medium=rss&utm_campaign=covid-19-claims-16-medical-doctors-in-nigeria-nma",
            "description": "Prof. Baba Issa, Chairman of Kwara State NMA, disclosed this on Monday during a press conference organised to mark the 2020 Physicians Week in Ilorin.\nThe post COVID-19 claims 16 Medical Doctors in Nigeria  NMA appeared first on The Eagle Online.",
            "timestamp": 1603147429.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "#EndSARS: Clarion call to respond to growing demands by Nigerians  APC Governors DG",
            "link": "https://theeagleonline.com.ng/endsars-clarion-call-to-respond-to-growing-demands-by-nigerians-apc-governors-dg/?utm_source=rss&utm_medium=rss&utm_campaign=endsars-clarion-call-to-respond-to-growing-demands-by-nigerians-apc-governors-dg",
            "description": "He made the call in a statement on Monday in Abuja, adding that the Federal Government and sub-national entities could not afford to ignore the demands by the youth.\nThe post #EndSARS: Clarion call to respond to growing demands by Nigerians  APC Governors DG appeared first on The Eagle Online.",
            "timestamp": 1603147420.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Barcelona FC not Champions League favourite, says Koeman",
            "link": "https://theeagleonline.com.ng/barcelona-fc-not-champions-league-favourite-says-koeman/?utm_source=rss&utm_medium=rss&utm_campaign=barcelona-fc-not-champions-league-favourite-says-koeman",
            "description": "Speaking ahead of Tuesdays visit of Hungarians Ferencvaros in their Champions League Group G opener, Koeman played down media talk that the Catalans could be European champions.\nThe post Barcelona FC not Champions League favourite, says Koeman appeared first on The Eagle Online.",
            "timestamp": 1603147418.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Fayemi inaugurates Amotekun in Ekiti",
            "link": "https://theeagleonline.com.ng/fayemi-inaugurates-amotekun-in-ekiti/?utm_source=rss&utm_medium=rss&utm_campaign=fayemi-inaugurates-amotekun-in-ekiti",
            "description": "The Governor explained that the security outfit was a child of necessity aimed to solve and address the various security challenges bedevilling the state and the South West zone in particular and Nigeria in general.\nThe post Fayemi inaugurates Amotekun in Ekiti appeared first on The Eagle Online.",
            "timestamp": 1603147418.0,
            "image": null,
            "author": "The Eagle Online"
        },
        {
            "title": "Lagos state shuts down all schools over #EndSARS protests",
            "link": "https://www.yabaleftonline.ng/lagos-state-shuts-down-all-schools-over-endsars-protests/",
            "description": "The Lagos State Government has ordered the closure of public and private schools in the state indefinitely over #EndSARS. This was announced in a press statement by the states Head of Public Affairs, Ministry of Education, Kayode Abayomi, on Monday. The statement was titled, Lagos directs students to stay at home. It quoted the Commissioner […]\nThe post Lagos state shuts down all schools over #EndSARS protests appeared first on YabaLeftOnline.",
            "timestamp": 1603140105.0,
            "image": null,
            "author": "Dotun A."
        },
        {
            "title": "Kogi State Governor, Yahaya Bello offers to be the leader of #EndSars movement Nigerians react",
            "link": "https://www.yabaleftonline.ng/kogi-state-governor-yahaya-bello-offers-to-be-the-leader-of-endsars-movement-nigerians-react/",
            "description": "Kogi State Governor, Yahaya Bello, is currently trending on social media after he offered too become the leader of the #ENDSars protest. EndSars protest has been going on for weeks now and there have been some calls that the movement should have a leader or a representative who would be able to dialogue with the […]\nThe post Kogi State Governor, Yahaya Bello offers to be the leader of #EndSars movement… Nigerians react appeared first on YabaLeftOnline.",
            "timestamp": 1603139149.0,
            "image": null,
            "author": "Lawrence A."
        },
        {
            "title": "Former NDLEA staff caught with 254kg of cannabis",
            "link": "https://www.yabaleftonline.ng/former-ndlea-staff-caught-254kg-cannabis/",
            "description": "A dismissed staff of the National Drug Law Enforcement Agency (NDLEA), Ezekiel Adamu Pam, has been caught with 254kg of cannabis. According to Niger State NDLEA, the 46 year-old ex-staff was arrested on 9 October, with 254kg of dried weeds suspected to be cannabis sativa. The Acting Commander of the agency in the state, Mr […]\nThe post Former NDLEA staff caught with 254kg of cannabis appeared first on YabaLeftOnline.",
            "timestamp": 1603133409.0,
            "image": null,
            "author": "Dotun A."
        },
        {
            "title": "#EndSARS: Protesters break into Lagos International Airport (Videos)",
            "link": "https://www.yabaleftonline.ng/endsars-protesters-break-into-lagos-international-airport-videos/",
            "description": "Young Nigerians protesting against SARS brutality, under the #EndSARS movement, are currently inside Murtala Muhammed International Airport in Lagos state. The protesters in their hundreds are preventing movement in and out of the busiest airport in the country. Nationwide protests have been going on over the past 11 days, demanding an end to police brutality […]\nThe post #EndSARS: Protesters break into Lagos International Airport (Videos) appeared first on YabaLeftOnline.",
            "timestamp": 1603130223.0,
            "image": null,
            "author": "Dotun A."
        },
        {
            "title": "Join the #EndSARS movement if youre not happy about your welfare  2Baba tells Nigerian security agencies",
            "link": "https://www.yabaleftonline.ng/join-the-endsars-movement-if-youre-not-happy-about-your-welfare-2baba-tells-nigerian-security-agencies/",
            "description": "Veteran singer, 2Baba, has asked all Nigerian security agencies to join the ongoing #EndSARS protests if they are not happy about their welfare. The legendary singer made this call yesterday, October 18, via his official Twitter page. His call is coming in the wake of protests holding across Nigeria in agitation for police reform and […]\nThe post Join the #EndSARS movement if youre not happy about your welfare  2Baba tells Nigerian security agencies appeared first on YabaLeftOnline.",
            "timestamp": 1603128484.0,
            "image": null,
            "author": "Dotun A."
        },
        {
            "title": "#EndSars : We need total shutdown until this politicians start to answer!  2baba Idibia",
            "link": "https://www.yabaleftonline.ng/endsars-we-need-total-shutdown-until-this-politicians-start-to-answer-2baba-idibia/",
            "description": "Popular Nigerian Singer, Innocent ‘2BABA’ Idibia has seemingly called for the continuation of #EndSars protest which has be going on for up to a week now. 2baba wondered why people were still going to work and he went on to suggest a ‘Total Shutdown’ until the Government answers the people. He wrote ; I wonder […]\nThe post #EndSars : ”We need total shutdown until this politicians start to answer!” – 2baba Idibia appeared first on YabaLeftOnline.",
            "timestamp": 1603124745.0,
            "image": null,
            "author": "Lawrence A."
        },
        {
            "title": "#EndSARS: Nigerian Youths have the freedom to protest  President Buhari",
            "link": "https://www.yabaleftonline.ng/endsars-nigerian-youths-freedom-protest-president-buhari/",
            "description": "President Muhammadu Buhari has stated that the Nigerian youths have the right to protest, so long as it is peaceful and focused. The President noted this in a meeting with Mr. Sunday Dare, the Minister of Youths and Sports Development. He appreciated the youths for bringing the issue of police brutality to the forefront and […]\nThe post #EndSARS: “Nigerian Youths have the freedom to protest”  President Buhari appeared first on YabaLeftOnline.",
            "timestamp": 1603123659.0,
            "image": null,
            "author": "Vivian Okpirikhre"
        },
        {
            "title": "Miyetti Allah opens up on #EndSARS protests",
            "link": "https://nationaldailyng.com/miyetti-allah-opens-up-on-endsars-protests/?utm_source=rss&utm_medium=rss&utm_campaign=miyetti-allah-opens-up-on-endsars-protests&utm_source=rss&utm_medium=rss&utm_campaign=miyetti-allah-opens-up-on-endsars-protests",
            "description": "The umbrella body for Fulani herders in the country, Miyetti Allah has finally reacted to the ongoing #EndSARS protests rocking the country in the last 14 days. Speaking at a news conference on Monday, National President of the association, Malam Bello Abdullahi, appealed to the protesters to suspend the protest and wait for the Federal",
            "timestamp": 1603146374.0,
            "image": null,
            "author": "Admin"
        },
        {
            "title": "#ENDSARS: Fear of Crime Against Humanity, Genocide as Army plans Operation Crocodile Smile",
            "link": "https://nationaldailyng.com/endsars-fear-of-crime-against-humanity-genocide-as-army-plans-operation-crocodile-smile/?utm_source=rss&utm_medium=rss&utm_campaign=endsars-fear-of-crime-against-humanity-genocide-as-army-plans-operation-crocodile-smile&utm_source=rss&utm_medium=rss&utm_campaign=endsars-fear-of-crime-against-humanity-genocide-as-army-plans-operation-crocodile-smile",
            "description": "Lagos protesters order closure of all schools on Tuesday The commencement of the military exercise, Operation Crocodile Smile on Tuesday amidst the prevailing #ENDSARS mass protest across the country, has precipitated fears of using force to quell the protests. Some stakeholders have warned of resisting the temptation of acts of genocide or crime against humanity",
            "timestamp": 1603146275.0,
            "image": null,
            "author": "Admin"
        },
        {
            "title": "Lagos orders closure of schools as #EndSARS protests persist",
            "link": "https://nationaldailyng.com/lagos-orders-closure-of-schools-as-endsars-protests-persist/?utm_source=rss&utm_medium=rss&utm_campaign=lagos-orders-closure-of-schools-as-endsars-protests-persist&utm_source=rss&utm_medium=rss&utm_campaign=lagos-orders-closure-of-schools-as-endsars-protests-persist",
            "description": "Governor Babajide Sanwo-Olu has ordered the immediate closure of private and public schools in Lagos state. This, he ordered in a statement signed by Kayode Abayomi, Head, Public Affairs, Ministry of Education as tension escalates by the #EndSARS protests. Commissioner for Education, Mrs Folasade Adefisayo, who issued the directive today, said the safety of the",
            "timestamp": 1603146067.0,
            "image": null,
            "author": "Admin"
        },
        {
            "title": "Police break public trust, unleash violence on #EndSARS protesters in Abuja",
            "link": "https://nationaldailyng.com/police-break-public-trust-unleash-violence-on-endsars-protesters-in-abuja/?utm_source=rss&utm_medium=rss&utm_campaign=police-break-public-trust-unleash-violence-on-endsars-protesters-in-abuja&utm_source=rss&utm_medium=rss&utm_campaign=police-break-public-trust-unleash-violence-on-endsars-protesters-in-abuja",
            "description": "The Nigeria Police on Monday broke public trust in the force on police reform or heeding to the demands of the #ENDSARS protesters in Abuja. the police in a seeming unrepentant attitude, fired teargas at peaceful #EndSARS protesters in Abuja, the Federal Capital Territory. The #ENDSARS protesters, demanding an end to police brutality, extortion and",
            "timestamp": 1603145989.0,
            "image": null,
            "author": "Admin"
        },
        {
            "title": "Religious intolerance takes life of a Teacher",
            "link": "https://nationaldailyng.com/religious-intolerance-takes-life-of-a-teacher/?utm_source=rss&utm_medium=rss&utm_campaign=religious-intolerance-takes-life-of-a-teacher&utm_source=rss&utm_medium=rss&utm_campaign=religious-intolerance-takes-life-of-a-teacher",
            "description": "The religious intolerance being perpetuated by extremist Islamic fundamentalists led to the death of a History Teacher in a secondary school. The Teacher was beheaded by Islamic terrorists after showing cartoons of Prophet Mohammed to students in a history class. The history teacher after he showed cartoons of the Prophet Mohammed in class was said",
            "timestamp": 1603145843.0,
            "image": null,
            "author": "Admin"
        },
        {
            "title": "#EndSARS and #EndSWAT as a metaphor for a failed government",
            "link": "https://nationaldailyng.com/sars-and-swat-as-a-metaphor-for-a-failed-government/?utm_source=rss&utm_medium=rss&utm_campaign=sars-and-swat-as-a-metaphor-for-a-failed-government&utm_source=rss&utm_medium=rss&utm_campaign=sars-and-swat-as-a-metaphor-for-a-failed-government",
            "description": "…Thumbs up for our visionary NIgerian youths By Mike Ozekhome, SAN. For decades, I had strindently beckoned on the Nigerian youths to join some of us patriots in the dangerous Nigerian trenches, to win the heart and soul of Nigeria, and take their destinies in their own hands. Many of the rulers of today have",
            "timestamp": 1603142434.0,
            "image": null,
            "author": "Publisher"
        },
        {
            "title": "#ENDSARS: Presidential panel hands list of bad cops to Malami",
            "link": "https://nationaldailyng.com/endsars-presidential-panel-hands-list-of-bad-cops-to-malami/?utm_source=rss&utm_medium=rss&utm_campaign=endsars-presidential-panel-hands-list-of-bad-cops-to-malami&utm_source=rss&utm_medium=rss&utm_campaign=endsars-presidential-panel-hands-list-of-bad-cops-to-malami",
            "description": "The chairman of the presidential panel on SARS reforms has led his committee to submit the panel report and recommendations on former operatives of the squad indicted in right violations allegations. Tony Ojukwu, who is the executive director of the Nigeria Human Rights Commission, presented the document to Justice Minister Abubakar Malami on October 19.",
            "timestamp": 1603136939.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Hoodums attack RRS operatives in Lagos, injure 14",
            "link": "https://nationaldailyng.com/hoodums-attack-rrs-operatives-in-lagos-injure-14/?utm_source=rss&utm_medium=rss&utm_campaign=hoodums-attack-rrs-operatives-in-lagos-injure-14&utm_source=rss&utm_medium=rss&utm_campaign=hoodums-attack-rrs-operatives-in-lagos-injure-14",
            "description": "Suspected hoodlums disguised as #ENDSARS protesters on Monday attacked operatives of the Lagos State Rapid Response Squad (RRS), injuring about 14 officers. Armed with sticks and bottles, the hoodlums in their hundreds barricaded the RRS truck, pelting the operatives who were on their way to relieve their colleagues who have been on duty since",
            "timestamp": 1603125441.0,
            "image": null,
            "author": "Admin"
        },
        {
            "title": "Ndume opens up on why he stood surety for Abdulrasheed Maina",
            "link": "https://nationaldailyng.com/ndume-opens-up-on-why-he-stood-surety-for-abdulrasheed-maina/?utm_source=rss&utm_medium=rss&utm_campaign=ndume-opens-up-on-why-he-stood-surety-for-abdulrasheed-maina&utm_source=rss&utm_medium=rss&utm_campaign=ndume-opens-up-on-why-he-stood-surety-for-abdulrasheed-maina",
            "description": "Senator Ali Ndume on Monday told the Federal High Court, Abuja, how he ended up as a surety to a former chairman of the defunct Pension Reform Task Team (PRTT), Abdulrasheed Maina. Ndume said he was pressured by some prominent Nigerians to take the decision after Maina stayed several months in Kuje Prison without",
            "timestamp": 1603125277.0,
            "image": null,
            "author": "Admin"
        },
        {
            "title": "Opposition Plotting To Hijack #EndSARS Protest  Imo Govt",
            "link": "https://www.thetrentonline.com/opposition-plotting-hijack-endsars-protest-destabilise-state-imo-govt/",
            "description": "The Imo State government has raised the alarm that some disgruntled politicians want to hijack the current #EndSARS protests to unleash mayhem in the state. The government disclosed that a high ranking member of the opposition who recently lost his number one position plum job has met with his henchmen for the purpose of recruiting hoodlums and cultists to infiltrate the protests. Declan Emelumba, the commissioner for information and strategy, in a statement released on Monday, October 19, 2020,",
            "timestamp": 1603139480.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "Weve Received Petitions From Groups Distancing Themselves From #EndSARS Protest  Nigerian Govt",
            "link": "https://www.thetrentonline.com/nigerian-govt-receives-petitions-end-sars/",
            "description": "The Federal Government has said that it has received petitions from various groups dissociating themselves from the End SARS protest, which has now turned violent. Lai Mohammed, the minister of information and culture, disclosed this in Abuja on Monday, October 19, 2020, at a special News Agency of Nigeria. NANm Forum. He said the groups noted in the petitions that while the protest was genuine, it had lost its original purpose and intention. We have received petitions from various groups saying",
            "timestamp": 1603139085.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "PTF Reminds #EndSARS Protesters About COVID-19 Pandemic",
            "link": "https://www.thetrentonline.com/covid-19-ptf-warns-high-risks-protest-gatherings/",
            "description": "The Presidential Task Force, PTF, on COVID-19 has appealed to #EndSARS protesters to listen to the voice of reason and tow the path of dialogue. Boss Mustapha, the chairman of the Presidential Task Force PTF on COVID-19 and Secretary to the Government of the Federation, SGF, made the appeal during a briefing in Abuja on Monday, October 19, 2020. The SGF noted the disregard for non-pharmaceutical interventions advised to protect people from being infected with the virus has become alarming, espec",
            "timestamp": 1603138185.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "Ogun Govt Releases Hotlines To Report Police Brutality, Human Rights Violation",
            "link": "https://www.thetrentonline.com/end-sars-ogun-releases-hotlines-report-police-brutality-rights-violation/",
            "description": "Following the End SARS protest and calls by Nigerian youths to end police brutality, the Ogun State Government has announced hotlines through which the judicial panel of investigation could be reached by the public. Dapo Abiodun, the Ogun governor, said the panel could be reached at the Conference room of the New Judiciary Complex, Kobape, Abeokuta, through an e-mail: endsarsjudicialpanel@ogunstate.gov.ng or through the following numbers: 07080601223, 07080601224 and 07080601225. Abiodun made th",
            "timestamp": 1603137489.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "Lagos Govt Shuts Down Schools Over #EndSARS Protests",
            "link": "https://www.thetrentonline.com/lagos-shuts-schools-endsars-protests/",
            "description": "The Lagos State Government has directed all pupils/students in public and private schools to stay at home following the tension generated by the #EndSARS protests. Folasade Adefisayo, the commissioner for education, who issued the directive on Monday, October 19, 2020, said the safety of the pupils/students, parents, and all staff working in schools was paramount at this critical period. She, however, advised parents to keep an eye on their wards and not allow them to be used as willing tools in",
            "timestamp": 1603136918.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "#EndSARS: Coalition Recommends 12 Representative To Dialogue With Nigerian Govt",
            "link": "https://www.thetrentonline.com/endsars-protest-coalition-recommends-12-youth-representative-dialogue-fg/",
            "description": "The Nigeria Coalition on Youth, Peace, and Security, NCYPS, has recommended 12 youth representatives from the six geo-political zones to dialogue with the Federal Government on behalf of the protesters on their demands. Rafiu Lawal, the national coordinator of the coalition, and made this known in a statement to journalists on Monday, October 19, 2020, in Abuja. The coordinator said that the demands underpinned the imperatives of holistic transformation of the multiplicity of socio-economic and",
            "timestamp": 1603133026.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "The Youths Have Spoken And Ive Heard  Buhari On #EndSARS Protests",
            "link": "https://www.thetrentonline.com/endsars-right-protest-buhari-tells-youths/",
            "description": "President Muhammadu Buhari on Monday, October 19, 2020, said that it was the right of the youths to protest and make certain demands from their leaders. The President also said that the young generation should be allowed to exercise their fundamental rights, but advised that they should not allow their genuine concerns to be hijacked by hoodlums. This was disclosed by the Minister of Youths and Sports Development, Sunday Dare, after meeting with the President at the Presidential Villa, Abuja. Br",
            "timestamp": 1603128758.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "Nigerian youths have spoken but we need time  Buhari",
            "link": "https://www.chronicle.ng/2020/10/nigerian-youths-have-spoken-buhari/?utm_source=rss&utm_medium=rss&utm_campaign=nigerian-youths-have-spoken-buhari",
            "description": "President Muhammadu Buhari has thrown his weight behind the peaceful protest against police brutality and calls for institutional reform in Nigeria. The president, however, urged the youth not to allow hoodlums to hijack the protests and also begged for more time to meet their demands. The Minister of Youth and Sports Development, Sunday Dare, on […]",
            "timestamp": 1603151822.0,
            "image": null,
            "author": "admin"
        },
        {
            "title": "No #EndSARS Protester Should Be Brutalised By Army  NUJ Warns Nigerian Govt",
            "link": "https://www.thetrentonline.com/endsars-protester-brutalised-army-nuj-warns-fg/",
            "description": "As men of the Nigerian Army took over the streets across the country in the name of Operation Crocodile Smile, the Oyo State Council of the Nigeria Union of Journalists, NUJ, has called on President Muhammadu Buhari to instruct the troops to ensure that none of the protesting youths is killed or brutalised during the exercise. The NUJ made the call on Monday, in a statement signed by the state chairman, Ademola Babalola, and secretary, Sola Oladapo, urging the Chief of Army Staff, Lieutenant Gen",
            "timestamp": 1603126736.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "Governor Obaseki Sets Up Judicial Panel Of Inquiry On Police Brutality",
            "link": "https://www.thetrentonline.com/endsars-edo-sets-up-12-man-judicial-panel-inquiry/",
            "description": "Edo State Government on Monday, October 19, 2020, set up a 12-man Judicial Panel of Inquiry into circumstances surrounding the #EndSARS protests in the state. Osarodion Ogie, the secretary to the state government, in a statement, disclosed that the Panel has been given 90 days to complete the assignment. According to him, the Panel was set up In response to the yearnings of Nigerian youths, as articulated in the demands of the #Endsars protesters. The Panel is chaired by Hon. Justice Ada Ehigiam",
            "timestamp": 1603126061.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "Governor Sanwo-Olu Inaugurates Judicial Panel To Investigate SARS Brutality",
            "link": "https://www.thetrentonline.com/sanwo-olu-inaugurates-7-member-judicial-panel-investigate-sars-brutality/",
            "description": "Babajide Sanwo-Olu, the governor of Lagos State on Monday, October 19, 2020, swore-in a 7-member Judicial Panel of Inquiry and Restitution into SARS Abuses at the State House, Marina, Lagos. The panel is to investigate cases of brutality and human rights violations committed by operatives of the dissolved Special Anti-Robbery Squad, SARS, in the State. The panel is headed by retired Justice Doris Okuwobi, it will sit for six months with the mandate to thoroughly investigate all verifiable claims",
            "timestamp": 1603124721.0,
            "image": null,
            "author": "Wires Editor &#124; The Trent"
        },
        {
            "title": "Nigeria announces 118 new coronavirus cases",
            "link": "https://www.chronicle.ng/2020/10/nigeria-announces-118-coronavirus-cases-2/?utm_source=rss&utm_medium=rss&utm_campaign=nigeria-announces-118-coronavirus-cases-2",
            "description": "The Nigeria Centre for Disease Control (NCDC) announced 118 confirmed new coronavirus cases in the country on Monday. The 118 cases announced by the Centre for Disease Control takes the total number of confirmed COVID-19 cases to 61,558. The NCDC also announced the discharge of 86 patients from isolation centers across the country with no […]",
            "timestamp": 1603150954.0,
            "image": null,
            "author": "admin"
        },
        {
            "title": "Lagos directs students to stay home",
            "link": "https://www.chronicle.ng/2020/10/lagos-directs-students-to-stay-home/?utm_source=rss&utm_medium=rss&utm_campaign=lagos-directs-students-to-stay-home",
            "description": "The Lagos State Government has directed all pupils/students in public and private schools to stay at home following the tension generated by the EndSARS protests. Commissioner for Education, Mrs Folasade Adefisayo, who issued the directive today, said the safety of the pupils/students, parents and all staff working in schools is paramount at this critical period. […]",
            "timestamp": 1603149135.0,
            "image": null,
            "author": "admin"
        },
        {
            "title": "EFCC disowns lawyer who claims he resigned to join #EndSARS protest",
            "link": "https://www.chronicle.ng/2020/10/efcc-disowns-lawyer-join-endsars-protest/?utm_source=rss&utm_medium=rss&utm_campaign=efcc-disowns-lawyer-join-endsars-protest",
            "description": "says website not hacked The Economic and Financial Crimes Commission, EFCC, has distanced itself from a lawyer, Dominic Akpan, who claimed that he has resigned from the agency to join #EndSARS protest. The anti-graft agency noted that Akpan served as a National Youth Service Corps (NYSC) member at one of its outstations. “The attention of […]",
            "timestamp": 1603126682.0,
            "image": null,
            "author": "admin"
        },
        {
            "title": "Hoodlums attack another prison in Edo, free inmates",
            "link": "https://www.chronicle.ng/2020/10/hoodlums-attack-another-prison-in-edo-free-inmates/?utm_source=rss&utm_medium=rss&utm_campaign=hoodlums-attack-another-prison-in-edo-free-inmates",
            "description": "Some hoodlums posing as #EndSARS protesters have attacked the Oko Medium Security Centre in Edo State, freeing many inmates in the process. This is coming some hours after a jailbreak at the correctional centre in Benin City. There has been an outbreak of violence in Edo State following the #EndSARS protests. A source told SaharaReporters […]",
            "timestamp": 1603125887.0,
            "image": null,
            "author": "admin"
        },
        {
            "title": "#ENDSARS: Governor Sanwo-Olu inaugurates judicial team to investigate SARS brutality",
            "link": "https://www.chronicle.ng/2020/10/endsars-gov-sanwo-olu-inaugurates-judicial-sars/?utm_source=rss&utm_medium=rss&utm_campaign=endsars-gov-sanwo-olu-inaugurates-judicial-sars",
            "description": "Governor Babajide Sanwo-Olu of Lagos state, on Monday October 19, inaugurated an eight man panel of inquiry to investigate cases of brutality and human rights violation committed by operatives of the disbanded Special Anti-Robbery Squad SARS in the state. The panel which is headed by Retired Justice Doris Okuwobi will sit for six months and […]",
            "timestamp": 1603124708.0,
            "image": null,
            "author": "admin"
        },
        {
            "title": "ICYMI: Polygamy Saving Women From Bondage, Abusive Husbands  Islamic Scholars",
            "link": "https://www.herald.ng/icymi-polygamy-saving-women-from-bondage-abusive-husbands-islamic-scholars/",
            "description": "Dr. Shehu Aboki, a lecturer in the Department of Islamic Studies, Usmanu Danfodio University, Sokoto, says Islam encourages polygamy to protect the dignity of women, save them from bondage and maltreatment by abusive husbands. Aboki made the observation at the launch of a book titled: A Room of her own; Transition from Monogamy to Polygamy […]\nThe post ICYMI: Polygamy Saving Women From Bondage, Abusive Husbands  Islamic Scholars appeared first on ..",
            "timestamp": 1603147713.0,
            "image": "https://www.herald.ng/wp-content/uploads/2019/03/Polygamy-270x180.jpg",
            "author": "Muhammed Bello"
        },
        {
            "title": "EndSARS: Open Letter To President Buhari  By Doyin Okupe",
            "link": "https://www.herald.ng/endsars-open-letter-to-president-buhari-by-doyin-okupe/",
            "description": "The above subject matter and the recent protests in the country by Nigerian youths in the last few days, I am sure, are causes for major concern to Your Excellency Mr President, your government and those who wish Nigeria well. But let me begin by thanking you for the direction you have steered the ship […]\nThe post EndSARS: Open Letter To President Buhari – By Doyin Okupe appeared first on ..",
            "timestamp": 1603147706.0,
            "image": "https://www.herald.ng/wp-content/uploads/2014/12/Okupe-100x90.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "Buhari not interested in EndSARS  Fani-Kayode",
            "link": "https://www.herald.ng/buhari-not-interested-in-endsars-fani-kayode/",
            "description": "Former Aviation Minister, Chief Femi Fani-Kayode says President Muhammadu Buhari is not interested in the EndSARS protests. He stated this in a series of tweets on Monday evening. Fani-Kayode was reacting to the burning of dozens of cars said to belong to EndSARS protesters in Abuja. Videos that circulated on social media on Monday showed […]\nThe post Buhari not interested in EndSARS – Fani-Kayode appeared first on ..",
            "timestamp": 1603146429.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/08/114113174_90351482_10158230254802210_237833887030444032_n.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "EndSARS: Progress To Dialogue, LCCI Urges Protesters",
            "link": "https://www.herald.ng/endsars-progress-to-dialogue-lcci-urges-protesters/",
            "description": "The Lagos Chamber of Commerce and Industry (LCCI) has advised the EndSARS protesters to progress to dialogue as the next stage of civic engagement, in consideration of economic activities. Mrs. Toki Mabogunje, President, LCCI, made the appeal in a statement on Monday in Lagos. Mabogunje said the dialogue phase wasnecessary to reduce the massive disruptions, […]\nThe post EndSARS: Progress To Dialogue, LCCI Urges Protesters appeared first on ..",
            "timestamp": 1603145511.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/LCCI-Lagos-Chamber-of-Commerce-and-Industry-1.jpg",
            "author": "Rukayat Moisemhe"
        },
        {
            "title": "My position on police reform remain unchanged  Wike",
            "link": "https://www.herald.ng/my-position-on-police-reform-remain-unchanged-wike/",
            "description": "Rivers State Governor, Nyesom Wike has restated his call for the total reform of the Nigeria Police Force. Wike spoke while addressing thousands of Rivers women under the auspices of “Concerned Mothers in Rivers State”. The women came on #EndSARS protest march to Government House, Port Harcourt on Monday. Speaking through his Deputy, Dr. Ipalibo […]\nThe post My position on police reform remain unchanged – Wike appeared first on ..",
            "timestamp": 1603145084.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/FB_IMG_1603144373769.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "Sen. Orji Kalu Felicitates With Gowon at 86",
            "link": "https://www.herald.ng/sen-orji-kalu-felicitates-with-gowon-at-86/",
            "description": "Chief Whip of the Senate, Sen. Orji Kalu has felicitated with the former Head of State and National Chairman of Nigeria Prays, Gen. Yakubu Gowon (rtd) on his 86th birthday. Kalu, in a goodwill message to the former Head of State, acknowledged his invaluable contributions to the social, economic and political development of Nigeria. According […]\nThe post Sen. Orji Kalu Felicitates With Gowon at 86 appeared first on ..",
            "timestamp": 1603144708.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/yakubu-gowon.jpg",
            "author": "Ikenna Uwadileke"
        },
        {
            "title": "EndSARS: Lagos Shuts All Schools Indefinitely",
            "link": "https://www.herald.ng/endsars-lagos-shuts-all-schools-indefinitely/",
            "description": "The Lagos State Government has shut down all schools in the state indefinitely. This, it said, was in response to the EndSARS protests. Lagod State Commissioner for Education, Mrs Folasade Adefisayo, issued the directive on Monday. The directive was contained in a statement signed by Head of Public Affairs of the ministry, Kayode Abayomi. Adefisayo […]\nThe post EndSARS: Lagos Shuts All Schools Indefinitely appeared first on ..",
            "timestamp": 1603144250.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/Sanwo-Olu.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "Van Dijk Wil Come Back Stronger From Injury Lay off  Klopp",
            "link": "https://www.herald.ng/van-dijk-stronger-injury-lay-klopp/",
            "description": "Liverpool manager Juergen Klopp is confident defender Virgil van Dijk will come back stronger as the Dutchman undergoes knee surgery and faces a battle to play again this season. The English Premier League (EPL) champions said on Sunday that Van Dijk has damaged knee ligaments. This followed a challenge by Everton goalkeeper Jordan Pickford during […]\nThe post Van Dijk Wil Come Back Stronger From Injury Lay off – Klopp appeared first on ..",
            "timestamp": 1603143916.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/klopp-1.jpeg",
            "author": "Olawale Alabi"
        },
        {
            "title": "COVID-19: Nigeria Winning War Against Pandemic- PTF",
            "link": "https://www.herald.ng/covid-19-nigeria-winning-war-against-pandemic-ptf/",
            "description": "The Presidential Task Force on COVID-19 saysthe nation is winning the war against the Coronavirus (COVID-19) pandemic. SEE ALSO: Incite violence, get visa ban, forfeit assets, Britain warns Nigerias politicians The Secretary to the Government of the Federation (SGF) and Chairman, Presidential Task Force (PTF) on COVID-19, Boss Mustapha, said this on Monday in Abuja […]\nThe post COVID-19: Nigeria Winning War Against Pandemic- PTF appeared first on ..",
            "timestamp": 1603141623.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/06/D7ED8EDC-A4F4-45AD-AB75-04DF9CC3B732.jpeg",
            "author": "Abujah Racheal"
        },
        {
            "title": "Police Sets Up Committee To Investigate Alleged Murder Of 17-Year-Old In Kano",
            "link": "https://www.herald.ng/police-sets-up-committee-to-investigate-alleged-murder-of-17-year-old-in-kano/",
            "description": "The Police Command in Kano State, says it has constituted a committee to investigate the alleged murder of a 17-year-old man, Saifullahi Sani-Musa, in police custody. SEE ALSO: Surulere: Orderly room trial of erring policemen began Friday – Sanwo-Olu DSP Abdullahi Haruna, the Police Public Relations Officer (PRO) of the command, stated this in a […]\nThe post Police Sets Up Committee To Investigate Alleged Murder Of 17-Year-Old In Kano appeared first on ..",
            "timestamp": 1603140984.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/70A9DF5E-B89F-4E3F-8BE1-D3443C7F31B4.jpeg",
            "author": "Rabiu Sani"
        },
        {
            "title": "Buhari Dismisses National Copyright Commissions Chairman From Office",
            "link": "https://www.herald.ng/buhari-dismisses-national-copyright-commissions-chairman-office/",
            "description": "President Muhammadu Buhari has effected an immediate removal of the Chairman, Governing Board of the Nigerian Copyright Commission (NCC), Mr. Tonye Clinton Jaja. The notice of his removal was relayed through a letter signed by the Solicitor-General of the Federation and Permanent Secretary, Federal Ministry of Justice, Dayo Apata (SAN). The letter titled, “Notification of […]\nThe post Buhari Dismisses National Copyright Commission’s Chairman From Office appeared first on ..",
            "timestamp": 1603140659.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/jaja.jpg",
            "author": "Tofunmi"
        },
        {
            "title": "Premier League: Eight Positive COVID-19 Cases In Latest Testing",
            "link": "https://www.herald.ng/premier-league-eight-positive-covid-19-cases-in-latest-testing/",
            "description": "The Premier League in England said on Monday that eight people had returned positive results in its latest round of COVID-19 tests conducted on players and staff last week. SEE ALSO: Klopp Reveals His Message To Liverpool Squad After Villa Defeat The league said the individuals who had tested positive for the novel coronavirus would […]\nThe post Premier League: Eight Positive COVID-19 Cases In Latest Testing appeared first on ..",
            "timestamp": 1603140612.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/3E862E0A-AFD2-4DAD-8A82-3A2F98D331B1.jpeg",
            "author": "Olawale Alabi"
        },
        {
            "title": "Verizon Strikes Deal With Microsoft, Nokia To Help Build 5G Networks",
            "link": "https://www.herald.ng/verizon-strikes-deal-with-microsoft-nokia-to-help-build-5g-networks/",
            "description": "Verizon said on Monday it has struck deals with Microsoft and Nokia to improve the telecoms giants ability to target business customers by offering clients the ability to automate factory floors, lower costs and speed up data traffic through private 5G networks. SEE ALSO: Electricity Company gives 30% discount to Debtor Customers in Jos Private […]\nThe post Verizon Strikes Deal With Microsoft, Nokia To Help Build 5G Networks appeared first on ..",
            "timestamp": 1603140296.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/807A14ED-1A9D-416F-A91A-7DF360C4D17C.jpeg",
            "author": "Emmanuel Okara"
        },
        {
            "title": "Lampard sets Bayern Munich benchmark for youthful Chelsea",
            "link": "https://www.herald.ng/lampard-sets-bayern-munich-benchmark-for-youthful-chelsea/",
            "description": "Chelsea FC manager Frank Lampard says Bayern Munich are a benchmark for his young players as they target improvements on all fronts ahead of their UEFA Champions League opener against Sevilla. SEE ALSO: Everything I Did Was In Barcas Best Interest – Messi European champions Bayern Munich thrashed Lampards Chelsea 7-1 on aggregate in the […]\nThe post Lampard sets Bayern Munich benchmark for youthful Chelsea appeared first on ..",
            "timestamp": 1603139765.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/CDB6B8B7-BAFA-435B-A87C-213B4B1A0718.jpeg",
            "author": "Joseph Edeh"
        },
        {
            "title": "NIMR Collaborates With InstitutMerieux To Award First Young Investigate In West Africa",
            "link": "https://www.herald.ng/nimr-collaborates-with-institutmerieux-to-award-first-young-investigate-in-west-africa/",
            "description": "The Nigerian Institute of Medical Research (NIMR), in collaboration with InstitutMerieux, a French Company, have awarded Dr Emelda Chukwu as first ever Young Investigative Award in West Africa. The institute, in its twitter handle on Monday, said Chukwu, a Biomedical Researcher, is working in the Microbiology Department. According to the institute, the award comes with […]\nThe post NIMR Collaborates With InstitutMerieux To Award First Young Investigate In West Africa appeared first on ..",
            "timestamp": 1603137602.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/nimr.jpg",
            "author": "Kemi Akintokun"
        },
        {
            "title": "COVID-19: UNICEF Purchases of 520m Syringes",
            "link": "https://www.herald.ng/unicef-purchases-syringes/",
            "description": "The United Nations Childrens Fund (UNICEF) says it is purchasing and pre-positioning syringes and other necessary equipment, as the world awaits a COVID-19 vaccine. UNICEF said in a statement on Monday that the move was part of the groundwork for the rapid, safe and efficient delivery of the vaccine when ready. The agency said […]\nThe post COVID-19: UNICEF Purchases of 520m Syringes appeared first on ..",
            "timestamp": 1603136749.0,
            "image": "https://www.herald.ng/wp-content/uploads/2018/10/UNICEF-270x180.png",
            "author": "Harrison Arubu"
        },
        {
            "title": "Jumare Resigns from Union Bank Board",
            "link": "https://www.herald.ng/jumare-resigns-union-bank/",
            "description": "The Board of Directors, Union Bank of Nigeria Plc., has announced the resignation of Mrs Furera Jumare as a non-executive director on the board. Mrs Beatrice Hamza-Bassey, Chairman of the board, made the disclosure in a statement made available to the News Agency of Nigeria (NAN) in Lagos on Monday. According to the statement, […]\nThe post Jumare Resigns from Union Bank Board appeared first on ..",
            "timestamp": 1603136118.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/FURERA-ISMA-JUMARE.jpg",
            "author": "Itohan Abara-Laserian"
        },
        {
            "title": "Increase Funding For Science And Tech Sector  Rep. Beni Lar",
            "link": "https://www.herald.ng/increase-funding-for-science-and-tech-sector-rep-beni-lar/",
            "description": "Rep. Beni Lar, Chairman, House of Representatives Committee on Science and Technology, has called for increased funding for the science and technology sector. Lar, who made the call on Monday in Abuja when members of the Committee paid an oversight visit to the Ministry of Science and Technology, called for more attention to the sector […]\nThe post Increase Funding For Science And Tech Sector – Rep. Beni Lar appeared first on ..",
            "timestamp": 1603135803.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/Beni-Lar.jpg",
            "author": "Sylvester Thompson"
        },
        {
            "title": "NUJ Advises NDLEA To Knock Off Illicit Drug Den In Sokoto",
            "link": "https://www.herald.ng/nuj-advises-ndlea-knock-illicit-drug-den-sokoto/",
            "description": "The Nigeria Union of Journalists (NUJ), Sokoto State Council, has urged the National Drug Law Enforcement Agency ( NDLEA) to dislodge an illicit drug den in Dange/Shuni Local Government Area of the state. The call is contained in a communique issued to newsmen on Monday in Sokoto, after the unions monthly state congress meeting. The […]\nThe post NUJ Advises NDLEA To Knock Off Illicit Drug Den In Sokoto appeared first on ..",
            "timestamp": 1603135038.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/NDLEA.jpg",
            "author": "Muhammad Nasir Bello"
        },
        {
            "title": "NSE Market Indices Closed as Country Witness #EndSARS Protests",
            "link": "https://www.herald.ng/nse-market-indices-closed/",
            "description": "The Nigerian Stock Exchange market indices closed flat on Monday just as the country continued to witness #EndSARS protests against police brutality. Specifically, the All-Share Index lost 1.14 points or 0.004 per cent to close at 28,658.31 compared with 28,659.45 achieved on Friday. Also, the market capitalisation closed flat at N14.979 trillion, same figured […]\nThe post NSE Market Indices Closed as Country Witness #EndSARS Protests appeared first on ..",
            "timestamp": 1603134193.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/06/NSE.jpg",
            "author": "Chinyere Joel-Nwokeoma"
        },
        {
            "title": "I See a Better Nigeria After#EndSARS Protests  Lai Mohammed",
            "link": "https://www.herald.ng/afterendsars-protests/",
            "description": "The Minister of Information and Culture, Alhaji Lai Mohammed, says he envisions a better Nigeria where fundamental human rights of people will be respected after the #EndSARS protests. The minister, who spoke in a Special NAN Forum on Monday in Abuja, said that the vision would, however, be achievable if the protesters would give […]\nThe post ‘I See a Better Nigeria After#EndSARS Protests’  Lai Mohammed appeared first on ..",
            "timestamp": 1603133400.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/07/Lai-Mohammed-1.jpeg",
            "author": "Rotimi Ijikanmi"
        },
        {
            "title": "Hadiza El-Rufai Inaugurates Women Peace Council To Strengthen Peace Across State",
            "link": "https://www.herald.ng/hadiza-el-rufai-inaugurates-women-peace-council-to-strengthen-peace-across-state/",
            "description": "The wife of Kaduna State Governor, Hajiya Hadiza El-Rufai, on Monday, inaugurated a 60-member Women Peace Council to deepen peace building process in four local government areas of the state. The News Agency of Nigeria (NAN) reports that the peace council was also to sustain conflict prevention including early warning and response in the areas. […]\nThe post Hadiza El-Rufai Inaugurates Women Peace Council To Strengthen Peace Across State appeared first on ..",
            "timestamp": 1603133127.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/hadiza-.jpg",
            "author": "Hassana Yakubu"
        },
        {
            "title": "NHRC Calls for Prosecution of 35 Indicted Police Officers by AGF",
            "link": "https://www.herald.ng/nhrc-prosecution-indicted-police/",
            "description": "The National Human Rights Commission (NHRC) on Monday called for the prosection of 35 police officers indicted in a report of the Presidential Investigation Panel on allegations of human rights violations against the disbanded Special Anti-Robbery Squad (SARS). The call was made in Abuja when NHRC submitted the report to the Attorney-General of the […]\nThe post NHRC Calls for Prosecution of 35 Indicted Police Officers by AGF appeared first on ..",
            "timestamp": 1603132353.0,
            "image": "https://www.herald.ng/wp-content/uploads/2018/08/NHRC_Logo-270x180.jpg",
            "author": "Edith Nwapi"
        },
        {
            "title": "Like A Faithful Wife Liverpool Will Await Van Dijk  Klopp",
            "link": "https://www.herald.ng/faithful-wife-liverpool-van-dijk-klopp/",
            "description": "Liverpool head coach Jurgen Klopp has vowed that the Redswill support Virgil van Dijk “like a good wife is waiting when the husband is in jail”.   Van Dijk can be said to be the most instrumental member of Liverpool’s squad since transferring to the club for a fee of 75 million ($97m) from Southampton […]\nThe post Like A Faithful Wife Liverpool Will Await Van Dijk – Klopp appeared first on ..",
            "timestamp": 1603131926.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/FEB7DB68-7D09-45F6-A54D-7122849611E0.jpeg",
            "author": "Adebusola Oyerinde"
        },
        {
            "title": "#EndSARS: Were Meeting Your Demands, FG tells Protesters in Canada",
            "link": "https://www.herald.ng/endsars-protesters-canada/",
            "description": "The Federal Government has assured Nigerians based in Canada of its deference to their collective call for improved governance back home. The Nigeria High Commission in Ottawa conveyed the assurance in a statement following #EndSARS protests by members of the Nigerian community there between Oct. 9, 12 and Oct. 16 respectively. This is contained […]\nThe post #EndSARS: ‘Were Meeting Your Demands’, FG tells Protesters in Canada appeared first on ..",
            "timestamp": 1603131280.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/B1DF9E74-DD70-4227-B69E-EC923CD5314E.jpeg",
            "author": "Harrison Arubu"
        },
        {
            "title": "EndSARS: Nigerian Youths Entitled To Peaceful Protests  Buhari",
            "link": "https://www.herald.ng/nigerian-youths-entitled-peaceful-protests-buhari/",
            "description": "President Muhammadu Buhari has declared that the Nigerian youths were within their rights to participate in nationwide protest and make demands from their leaders. The president made this known during a meeting with the Minister of Youths and Sports Development, Mr. Sunday Dare, on Monday, October 19th, 2020, were he vowed to enforce the earlier […]\nThe post EndSARS: Nigerian Youths Entitled To Peaceful Protests – Buhari appeared first on ..",
            "timestamp": 1603130801.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/Muhammadu-Buhari-1.jpg",
            "author": "Tofunmi"
        },
        {
            "title": "NAF Reaffirms Its Commitment to Safeguard the Nations Integrity",
            "link": "https://www.herald.ng/naf-reaffirms-commitment/",
            "description": "The Nigerian Air Force (NAF) has reaffirmed its commitment to continue to safeguard the nations territorial integrity against any form of threat. The Chief of Air Staff (CAS) Air Marshal Sadique Abubakar made the promise when the Senate Committee on NAF paid him an oversight visit at the service headquarters on Monday in Abuja. […]\nThe post NAF Reaffirms Its Commitment to Safeguard the Nations Integrity appeared first on ..",
            "timestamp": 1603130257.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/01/Nigerian-Air-Force-naf2.jpg",
            "author": "Yahaya Isah"
        },
        {
            "title": "NCC Assures Speedy Restoration of Full Telecoms Service",
            "link": "https://www.herald.ng/ncc-assures-restoration/",
            "description": "The Nigerian Communications Commission (NCC), has assured telecommunications operators of speedy restoration of service in North East, following vandalisation of telecoms fibres in Borno and Yobe. NCC Executive Vice-Chairman, Prof. Umar Danbatta said this at a Stakeholders Consultative Forum on Implementation of the National Broadband Policy 2020-2025, on Monday in Abuja. Danbatta said that […]\nThe post NCC Assures Speedy Restoration of Full Telecoms Service appeared first on ..",
            "timestamp": 1603129507.0,
            "image": "https://www.herald.ng/wp-content/uploads/2019/06/NCC-1-270x180.jpg",
            "author": "Jessica Dogo"
        },
        {
            "title": "Lagos ready to shut schools over ongoing EndSARS protests",
            "link": "https://www.herald.ng/lagos-ready-to-shut-schools-over-ongoing-endsars-protests/",
            "description": "The Lagos State Government says it could order the shutting of schools in the state as EndSARS protests linger. A state government official, Kayode Abayomi, said that only Governor Babajide Sanwo-Olu’s directive was being awaited. Abayomi, who is the Head of Public Affairs, Lagos State Ministry of Education, said that the school closure would help […]\nThe post Lagos ready to shut schools over ongoing EndSARS protests appeared first on ..",
            "timestamp": 1603129247.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/Yaba-stoning-in-EndSARS-protest-in-Lagos.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "EndSARS: Prevent COVID-19 Second Wave, Adhere to Safety Protocols  NMA",
            "link": "https://www.herald.ng/endsars-prevent-covid-19/",
            "description": "The Nigerian Medical Association (NMA), Oyo State branch, has urged the EndSARS protesters to adhere to COVID-19 safety protocols to avoid a second wave of the pandemic. The states Chairman of the association, Dr Ayotunde Fasunla, made the callin Ibadan on Monday, on the sideline of a news conference to mark the 2020 Physician […]\nThe post EndSARS: Prevent COVID-19 Second Wave, Adhere to Safety Protocols – NMA appeared first on ..",
            "timestamp": 1603128619.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/Jane.jpg",
            "author": "News Agency of Nigeria"
        },
        {
            "title": "EndSARS: Theres been 2 attempts on my life today  Deji Adeyanju raises alarm",
            "link": "https://www.herald.ng/endsars-theres-been-2-attempts-on-my-life-today-deji-adeyanju-raises-alarm/",
            "description": "Convener of Concerned Nigerians, Deji Adeyanju has raised the alarm over a plot to kill him. He raised the alarm in a tweet on Monday afternoon, saying he has had to relocate to a safe house to avoid being killed. The popular activist said that the attempts on his life occurred today in Wuse 2 […]\nThe post EndSARS: There’s been 2 attempts on my life today – Deji Adeyanju raises alarm appeared first on ..",
            "timestamp": 1603127518.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/09/Deji-Adeyanju-Daily-Times.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "FCT to Digitalise Health Records",
            "link": "https://www.herald.ng/fct-digitalise-health/",
            "description": "The FCT Health and Human Services Secretariat (HHSS) has called for the adoption of the Electronic Health Records (e-health) to ease the digitalisation of health records, especially among Primary Health Care (PHC) facilities. The Acting Secretary, HHSS, Dr Muhammad Kawu, made the call on Monday in Abuja during a validation meeting of the End […]\nThe post FCT to Digitalise Health Records appeared first on ..",
            "timestamp": 1603127448.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/digital-health-technology.jpg",
            "author": "Ibironke Ariyo"
        },
        {
            "title": "Every right-thinking Nigerian should support EndSARS protests  Catholic bishop",
            "link": "https://www.herald.ng/every-right-thinking-nigerian-should-support-endsars-protests-catholic-bishop/",
            "description": "Bishop of the Catholic Diocese of Bomadi in Delta State, Most. Rev. Hyacinth Egbebo says every right-thinking Nigerian should identify with the EndSARS protests. He said that the protests were aimed at causing positive change and therefore must be supported to succeed. Egbebo warned that the nation could break up if nothing was done to […]\nThe post Every right-thinking Nigerian should support EndSARS protests – Catholic bishop appeared first on ..",
            "timestamp": 1603126110.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/10/Bishop-Hyacinth-Egbebo.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "NASA Chooses Nokia To Install LTE Network On The Moon, By Samuel Mayowa",
            "link": "https://allnews.ng/news/nasa-chooses-nokia-to-install-lte-network-on-the-moon-by-samuel-mayowa",
            "description": "The National Aeronautics and Space Administration (NASA) has sealed a deal with telecommunications g...",
            "timestamp": 1603124241.0,
            "image": null,
            "author": null
        },
        {
            "title": "Buharis aide Bashir Ahmad denies announcing scrapping of SARS in 2017, 2018, 2019",
            "link": "https://www.herald.ng/buharis-aide-bashir-ahmad-denies-announcing-scrapping-of-sars-in-2017-2018-2019/",
            "description": "The Personal Assistant to the President on New Media, Bashir Ahmad says he did not announce the disbandment of the Special Anti-Robbery Squad (SARS) on three previous occasions. He stated this in a series of tweets on Monday. Recall that the Inspector General of Police (IGP), Mohammed Adamu announced the scrapping of the tactical squad […]\nThe post Buhari’s aide Bashir Ahmad denies announcing scrapping of SARS in 2017, 2018, 2019 appeared first on ..",
            "timestamp": 1603124330.0,
            "image": "https://www.herald.ng/wp-content/uploads/2020/06/Bashir-Ahmad-1024x576-1.jpg",
            "author": "John Ogunsemore"
        },
        {
            "title": "Fnmill Sanya: #BubuHasBeenABadBoy and Other Stories",
            "link": "https://www.bellanaija.com/2020/10/funmilola-sanya-bubuhasbeenabadboy-and-other-stories/",
            "description": "For the first time in my life, I am proud to be a Nigerian. It’s a rarity, one I’ll tell my children. This is how it happened: a tweet by @AfricaOfficial2 on the 3rd of October ignited the anger of Nigerian youths on Twitter. The tweet read: SARS just shot a young boy dead at […]\nThe post Fnmill Sanya: #BubuHasBeenABadBoy and Other Stories appeared first on BellaNaija - Showcasing Africa to the world. Read today!.",
            "timestamp": 1603132910.0,
            "image": null,
            "author": "'Fúnmilọ́lá Sanya"
        },
        {
            "title": "#ThisIsWhyWeProtest: 50 Reasons Why Nigerians Wont Stop Amplifying the #EndSARS Movement",
            "link": "https://www.bellanaija.com/2020/10/endsars-movement-in-nigeria/",
            "description": "Since the commencement of the #EndSARS movement, social media has made it easier for people to share their stories, express support and build strength in numbers. Its allowing everyone raise awareness on the violent killings and extortion by SARS and some members of the Nigerian police. Unfortunately, the protest is getting invaded by hoodlums whose […]\nThe post #ThisIsWhyWeProtest: 50 Reasons Why Nigerians Wont Stop Amplifying the #EndSARS Movement appeared first on BellaNaija - Showcasing Afri",
            "timestamp": 1603128310.0,
            "image": null,
            "author": "BellaNaija.com"
        },
        {
            "title": "Why Ngozi Okonjo Iweala Should Lead the World Trade Organization",
            "link": "https://www.thenewsnigeria.com.ng/2020/10/19/why-ngozi-okonjo-iweala-should-lead-the-world-trade-organization/",
            "description": "By K.Y. Amoako In the coming weeks, the World Trade Organization faces an historic choice. For the first time in its 25-year history, a womanwill […]",
            "timestamp": 1603133722.0,
            "image": null,
            "author": "demola"
        },
        {
            "title": "#EndSARS:Hoodlums have hijacked the once peaceful protests",
            "link": "https://www.thenewsnigeria.com.ng/2020/10/19/endsarshoodlums-have-hijacked-the-once-peaceful-protests/",
            "description": "By Francis Ottah Agbo The #EndSars now protests have been peaceful, civilized and successful with many manifest gains recorded. Some clergy men even joined to […]",
            "timestamp": 1603132697.0,
            "image": null,
            "author": "demola"
        },
        {
            "title": "Human rights abuses by cops, SARS personnel: Fayemi sets up Judicial Panel of Inquiry",
            "link": "https://www.thenewsnigeria.com.ng/2020/10/19/human-rights-abuses-by-cops-sars-personnel-fayemi-sets-up-judicial-panel-of-inquiry/",
            "description": "…inaugurates Amotekun in Ekiti . says security outfit not a substitute to other security architecture The Governor of Ekiti State, Dr. John Kayode Fayemi, […]",
            "timestamp": 1603130660.0,
            "image": null,
            "author": "demola"
        },
        {
            "title": "#EndSARS: Victims of police brutality now have a panel, inaugurated in Lagos today, to hear them",
            "link": "https://www.thenewsnigeria.com.ng/2020/10/19/endsars-victims-of-police-brutality-now-have-a-panel-inaugurated-in-lagos-today-to-hear-them/",
            "description": "Now, victims of police brutality, especially by members of the disbanded Special Anti-Robbery Squad, have a place to lodge their grievances. That is a judicial panel in Lagos",
            "timestamp": 1603129636.0,
            "image": null,
            "author": "demola"
        },
        {
            "title": "#EndSARS: A plea to the protesters",
            "link": "https://www.thenewsnigeria.com.ng/2020/10/19/endsars-a-plea-to-the-protesters/",
            "description": "By Richard Akinnola I make this plea as someone who has been in the different layers of the struggle for over 30 years, particularly against […]",
            "timestamp": 1603126861.0,
            "image": null,
            "author": "demola"
        },
        {
            "title": "EndSARS: Prevent COVID-19 second wave, adhere to safety protocols, NMA advises protesters",
            "link": "https://nationalaccordnewspaper.com/endsars-prevent-covid-19-second-wave-adhere-to-safety-protocols-nma-advises-protesters/",
            "description": "The Nigerian Medical Association (NMA), Oyo State branch, has urged the EndSARS protesters to adhere to COVID-19 safety protocols to avoid a second wave of [...]The post EndSARS: Prevent COVID-19 second wave, adhere to safety protocols, NMA advises protesters appeared first on National Accord Newspaper.",
            "timestamp": 1603126909.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "NAF reaffirms commitment to protect Nigerias territorial integrity",
            "link": "https://nationalaccordnewspaper.com/naf-reaffirms-commitment-to-protect-nigerias-territorial-integrity/",
            "description": "The Nigerian Air Force (NAF) has reaffirmed its commitment to continue to safeguard the nations territorial integrity against any form of threat. The Chief of [...]The post NAF reaffirms commitment to protect Nigerias territorial integrity appeared first on National Accord Newspaper.",
            "timestamp": 1603126390.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "NDLEA nabs dismissed staff with 254kg of dried weeds in Niger",
            "link": "https://nationalaccordnewspaper.com/ndlea-nabs-dismissed-staff-with-254kg-of-dried-weeds-in-niger/",
            "description": "The National Drug Law Enforcement Agency (NDLEA), Niger Command, has arrested one Pam Ezekiel Adamu, 46, a dismissed staff of the agency, with 254kg of [...]The post NDLEA nabs dismissed staff with 254kg of dried weeds in Niger appeared first on National Accord Newspaper.",
            "timestamp": 1603125928.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "#EndSARS: arewa youths call for unity of purpose",
            "link": "https://nationalaccordnewspaper.com/endsars-arewa-youths-call-for-unity-of-purpose/",
            "description": "The Arewa Youth Assembly (AYA) has urged Nigerians to shun any act or comment capable of causing disunity among the people as the #EndSARS protests [...]The post #EndSARS: arewa youths call for unity of purpose appeared first on National Accord Newspaper.",
            "timestamp": 1603125623.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "COVID-19 deaths near 40,000 across Africa",
            "link": "https://nationalaccordnewspaper.com/covid-19-deaths-near-40000-across-africa/",
            "description": "The confirmed cases of COVID-19 from 55 African countries have reached 1,646,278 as of October 19. Also, reported deaths across the have reached 39,747, and [...]The post COVID-19 deaths near 40,000 across Africa appeared first on National Accord Newspaper.",
            "timestamp": 1603125260.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Sanwo-Olu inaugurates Judicial Panel of Inquiry on SARS brutality",
            "link": "https://nationalaccordnewspaper.com/sanwo-olu-inaugurates-judicial-panel-of-inquiry-on-sars-brutality/",
            "description": "Gov. Babajide Sanwo-Olu of Lagos State, on Monday inaugurated members of the Judicial Panel of Inquiry and Restitution for Victims of the Special Anti-Robbery Squad [...]The post Sanwo-Olu inaugurates Judicial Panel of Inquiry on SARS brutality appeared first on National Accord Newspaper.",
            "timestamp": 1603124629.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "FCT to digitalise health records",
            "link": "https://nationalaccordnewspaper.com/fct-to-digitalise-health-records/",
            "description": "The FCT Health and Human Services Secretariat (HHSS) has called for the adoption of the Electronic Health Records (e-health) to ease the digitalisation of health [...]The post FCT to digitalise health records appeared first on National Accord Newspaper.",
            "timestamp": 1603124219.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "8 positive in latest Premier League COVID-19 tests",
            "link": "https://promptnewsonline.com/8-positive-in-latest-premier-league-covid-19-tests/",
            "description": "The Premier League in England said on Monday that eight people had returned positive results in its latest round of COVID-19 tests conducted on players [...]",
            "timestamp": 1603151546.0,
            "image": null,
            "author": "adminer"
        },
        {
            "title": "Buratai inaugurates 30-bed hospital in Plateau",
            "link": "https://promptnewsonline.com/buratai-inaugurates-30-bed-hospital-in-plateau/",
            "description": "The Chief Army Staff (COAS), Lt.-Gen Tukur Buratai, has inaugurated a 30-bed hospital at Tigi Community of Riyom Local Government Area of Plateau. Inaugurating the [...]",
            "timestamp": 1603151445.0,
            "image": null,
            "author": "adminer"
        },
        {
            "title": "#EndSARS: LCCI urges youth on dialogue",
            "link": "https://promptnewsonline.com/endsars-lcci-urges-youth-on-dialogue/",
            "description": "The Lagos Chamber of Commerce and Industry (LCCI) has advised the EndSARS protesters to progress to dialogue as the next stage of civic engagement, in [...]",
            "timestamp": 1603150862.0,
            "image": null,
            "author": "adminer"
        },
        {
            "title": "Verizon signs up Microsoft, Nokia to help clients build private 5G networks",
            "link": "https://promptnewsonline.com/verizon-signs-up-microsoft-nokia-to-help-clients-build-private-5g-networks/",
            "description": "Verizon said on Monday it has struck deals with Microsoft and Nokia to improve the telecoms giants ability to target business customers by offering clients [...]",
            "timestamp": 1603150710.0,
            "image": null,
            "author": "adminer"
        },
        {
            "title": "NUJ urges NDLEA to dislodge illicit drug den in Sokoto",
            "link": "https://promptnewsonline.com/nuj-urges-ndlea-to-dislodge-illicit-drug-den-in-sokoto/",
            "description": "The Nigeria Union of Journalists (NUJ), Sokoto State Council, has urged the National Drug Law Enforcement Agency ( NDLEA) to dislodge an illicit drug den [...]",
            "timestamp": 1603150294.0,
            "image": null,
            "author": "adminer"
        },
        {
            "title": "UN Peace Ambassador who asked Buhari to use iron fists on #EndSARS protesters retracts statement, apologises",
            "link": "https://thenewsguru.com/top-story/un-peace-ambassador-who-asked-buhari-to-use-iron-fists-on-endsars-protesters-retracts-statement-apologises/",
            "description": "Sequel to the backlash received online and offline over his viral video asking President Muhammadu Buhari to use iron fists on Nigerians protesting #EndSARS, a self-acclaimed United Nations Peace Ambassador, Hussaini Coomasie, has apologised to Nigerian youths. TheNewsGuru.com, TNG, reports that Coomasie who served as the Deputy National Coordinator of President Buhari’s campaign had in […]\nThe post ‘UN Peace Ambassador’ who asked Buhari to use iron fists on #EndSARS protesters retracts statemen",
            "timestamp": 1603140165.0,
            "image": null,
            "author": "Olaotan Falade"
        },
        {
            "title": "#EndSARS: Lagos Govt directs all students to stay at home",
            "link": "https://thenewsguru.com/education/endsars-lagos-govt-directs-all-students-to-stay-at-home/",
            "description": "The Lagos State Government has directed all pupils/students in public and private schools to stay at home following the tension generated by the anti-SARS protests. Commissioner for Education, Mrs Folasade Adefisayo, who issued the directive on Monday, said the safety of the pupils/students, parents and all staff working in schools was paramount at this critical […]\nThe post #EndSARS: Lagos Govt directs all students to stay at home appeared first on TheNewsGuru.",
            "timestamp": 1603136804.0,
            "image": null,
            "author": "Ediri Oyibo"
        },
        {
            "title": "FG receives petitions over #EndSARS",
            "link": "https://thenewsguru.com/nigeria-news/fg-receives-petitions-over-endsars/",
            "description": "The Federal Government says it has received petitions from various groups dissociating themselves from the #EndSARS protest which has now turned violent. The Minister of Information and Culture, Alhaji Lai Mohammed disclosed this at a special forum in Abuja on Monday. He said the groups noted in the petitions that while the protest was genuine, […]\nThe post FG receives petitions over #EndSARS appeared first on TheNewsGuru.",
            "timestamp": 1603130604.0,
            "image": null,
            "author": "Ediri Oyibo"
        },
        {
            "title": "Buhari sacks NCC Chairman",
            "link": "https://thenewsguru.com/nigeria-news/buhari-sacks-ncc-chairman/",
            "description": "President Muhammad Buhari has approved the removal of the Board Chairman of the Nigerian Copyright Commission (NCC), Mr Tonye Clinton Jaja. According to a 15 October letter by Dr Dayo Akpata, SAN, the Solicitor General, Jajas removal was with immediate effect. Jaja was directed to handover all property of the commission to the Director General, […]\nThe post Buhari sacks NCC Chairman appeared first on TheNewsGuru.",
            "timestamp": 1603130318.0,
            "image": null,
            "author": "Olaotan Falade"
        },
        {
            "title": "Theyve started hiring thugs to pose as #EndSARS protesters-Davido",
            "link": "https://thenewsguru.com/entertainment/theyve-started-hiring-thugs-to-pose-as-endsars-protesters-davido/",
            "description": "Nigerian pop star, David Adeleke, better known as Davido, has alleged that there are attempts to use thugs to stop the ongoing #EndSARS protest. The protest against the extremes of the special anti-robbery squad (SARS) and police brutality has been unrelenting. Mohammed Adamu, inspector-general of police (IGP), has announced that the police unit had been […]\nThe post Theyve started hiring thugs to pose as #EndSARS protesters-Davido appeared first on TheNewsGuru.",
            "timestamp": 1603128772.0,
            "image": null,
            "author": "Kehinde Ajose"
        },
        {
            "title": "[Video]: Passengers stranded as #EndSARS protesters march to Lagos Airport, paralyse activities",
            "link": "https://thenewsguru.com/uncategorized/video-passengers-stranded-as-endsars-protesters-march-to-lagos-airport-paralyse-activities/",
            "description": "Aggrieved Nigerians who are protesting against police brutality on Monday marched the Murtala Mohammed International Airport, Lagos, disrupting flight activities. TheNewsGuru (TNG) gathered that passengers were stranded after the protesters blocked the road leading to the airport. Watch videos: View this post on Instagram #EndSARS protesters at Lagos airport today October 19 2020 A post […]\nThe post [Video]: Passengers stranded as #EndSARS protesters march to Lagos Airport, paralyse activities a",
            "timestamp": 1603127954.0,
            "image": null,
            "author": "Femi Ajasa"
        },
        {
            "title": "Fernandes makes Man Utd penalty promise",
            "link": "https://thenewsguru.com/sports/fernandes-makes-man-utd-penalty-promise/",
            "description": "Bruno Fernandes has vowed to make amends for the first missed penalty of hisManchester Unitedcareer when the Red Devils are next presented with an opportunity to convert from the spot. Ole Gunnar Solskjaers side have had plenty of practice from 12 yards in recent times. Portugalinternational Fernandes has been their go-to man in that department, […]\nThe post Fernandes makes Man Utd penalty promise appeared first on TheNewsGuru.",
            "timestamp": 1603127297.0,
            "image": null,
            "author": "Bayo Millz"
        },
        {
            "title": "[Videos] Abuja on fire! Several injured, vehicles burnt as thugs ransack Apo, Kabusa; hijack #ENDSARs protest",
            "link": "https://thenewsguru.com/nigeria-news/videos-abuja-on-fire-several-injured-vehicles-burnt-as-thugs-ransack-apo-kabusa-hijack-endsars-protest/",
            "description": "There is tension in Apo and Kabusa area of the Federal Capital Territory (FCT) on Monday as thugs took over some mass action planned by youths who are protesting against police brutality. According to reports reaching TheNewsGuru (TNG) some armed hoodlums reportedly arrived Apo Mechanic Village area in a bus and attacked people with sticks, […]\nThe post [Videos] Abuja on fire! Several injured, vehicles burnt as thugs ransack Apo, Kabusa; hijack #ENDSARs protest appeared first on TheNewsGuru.",
            "timestamp": 1603126752.0,
            "image": null,
            "author": "Femi Ajasa"
        },
        {
            "title": "Were meeting your demands, FG tells #EndSARS protesters in Canada",
            "link": "https://thenewsguru.com/news/were-meeting-your-demands-fg-tells-endsars-protesters-in-canada/",
            "description": "The Federal Government has assured Nigerians based in Canada of its deference to their collective call for improved governance back home. The Nigeria High Commission in Ottawa conveyed the assurance in a statement following #EndSARS protests by members of the Nigerian community there between Oct. 9, 12 and Oct. 16 respectively. This is contained in […]\nThe post Were meeting your demands, FG tells #EndSARS protesters in Canada appeared first on TheNewsGuru.",
            "timestamp": 1603126166.0,
            "image": null,
            "author": "Bayo Millz"
        },
        {
            "title": "NCC assures on restoration of full telecoms service in North East",
            "link": "https://thenewsguru.com/telecom/ncc-assures-on-restoration-of-full-telecoms-service-in-north-east/",
            "description": "The Nigerian Communications Commission (NCC) has assured telecommunications operators of speedy restoration of service in North East, following vandalisation of telecoms fibres in Borno and Yobe. NCC Executive Vice-Chairman, Prof. Umar Danbatta said this at a Stakeholders Consultative Forum on Implementation of the National Broadband Policy 2020-2025, on Monday in Abuja. Danbatta said that the […]\nThe post NCC assures on restoration of full telecoms service in North East appeared first on TheNew",
            "timestamp": 1603124402.0,
            "image": null,
            "author": "Ediri Oyibo"
        },
        {
            "title": "NCC sets up committee to review  InfraCo gramework, funding options",
            "link": "https://sundiatapost.com/ncc-sets-up-committee-to-review-infraco-gramework-funding-options/",
            "description": "ABUJA – The Nigerian Communication Commission (NCC) has constituted a committee to review the framework for the licensing of Infrastructure\nThe post NCC sets up committee to review  InfraCo gramework, funding options first appeared on SundiataPost.",
            "timestamp": 1603141247.0,
            "image": null,
            "author": "Admin5"
        },
        {
            "title": "15 persons killed in EndSARS protest, says Amnesty International",
            "link": "https://sundiatapost.com/15-persons-killed-in-endsars-protest-says-amnesty-international/",
            "description": "At least 15 people have been killed, including two policemen, since protests against police brutality erupted in Nigeria this\nThe post 15 persons killed in EndSARS protest, says Amnesty International first appeared on SundiataPost.",
            "timestamp": 1603138018.0,
            "image": null,
            "author": "Publisher"
        },
        {
            "title": "On #ENDSARS: Osinbajo speaks to no one By Ike Uremeh",
            "link": "https://sundiatapost.com/on-endsars-osinbajo-speaks-to-no-one-by-ike-uremeh/",
            "description": "A couple of days ago,the Vice President, Prof Yemi Osinbajo, offered an apology on behalf of his Government to Nigerian\nThe post On #ENDSARS: Osinbajo speaks to no one... By Ike Uremeh first appeared on SundiataPost.",
            "timestamp": 1603134032.0,
            "image": null,
            "author": "Admin5"
        },
        {
            "title": "EndSARS, STRATEGY and PLAN B, By Churchill Umoren",
            "link": "https://sundiatapost.com/endsars-strategy-and-plan-b-by-churchill-umoren/",
            "description": "The EndSARS movement needs leadership, plan, strategy and plan B. I implore you to go read Dr Doyin Okupehttps://sundiatapost.com/doyin-okupe-pens-advice-to-endsars-protesters/. Just\nThe post EndSARS, STRATEGY and PLAN B, By Churchill Umoren first appeared on SundiataPost.",
            "timestamp": 1603133997.0,
            "image": null,
            "author": "Admin5"
        },
        {
            "title": "State Of The Nation: Nigeria must be made to meet yearnings of citizens now  Fayemi",
            "link": "https://sundiatapost.com/state-of-the-nation-nigeria-must-be-made-to-meet-yearnings-of-citizens-now-fayemi/",
            "description": "Governor Kayode Fayemi of Ekiti State marked two years of his second term at the weekend. In this anniversary chat,\nThe post State Of The Nation: Nigeria must be made to meet yearnings of citizens now  Fayemi first appeared on SundiataPost.",
            "timestamp": 1603133720.0,
            "image": null,
            "author": "Admin5"
        },
        {
            "title": "#EndSARS: Buhari, NASS leadership brainstorm on quick implementation",
            "link": "https://sundiatapost.com/endsars-buhari-nass-leadership-brainstorm-on-quick-implementation/",
            "description": "President Muhammadu Buhari and the leadership of the National Assembly led by President of the Senate, Dr. Ahmad Lawan and\nThe post #EndSARS: Buhari, NASS leadership brainstorm on quick implementation first appeared on SundiataPost.",
            "timestamp": 1603131668.0,
            "image": null,
            "author": "Admin5"
        },
        {
            "title": "Buhari sacks Copyright Commissions Chair, Jaja",
            "link": "https://sundiatapost.com/buhari-sacks-copyright-commissions-chair-jaja/",
            "description": "President Muhamadu Buhari has directed the removal of the Chairman, Governing Board of the Nigerian Copyright Commission (NCC), Tonye Clinton\nThe post Buhari sacks Copyright Commissions Chair, Jaja first appeared on SundiataPost.",
            "timestamp": 1603130729.0,
            "image": null,
            "author": "Admin5"
        },
        {
            "title": "REAs unprecedented transformation under Salihijo Ahmad",
            "link": "https://nigeriannewsdirect.com/reas-unprecedented-transformation-under-salihijo-ahmad/",
            "description": "According to statistics available to the Nigerian NewsDirect, Rural Electrification Agency, (REA) under the leadership of Engr. Ahmad Salihijo Ahmad and his team led by the Executive Director, Rural Electrification Fund, Rural Electrification Agency, Nigeria Dr. Sanusi Ohiare has recently witnessed unprecedented transformation in the bid to power majority of Nigerian rural dwellers. In achieving […]\nThe post REA’s unprecedented transformation under Salihijo Ahmad appeared first on Nigeriannewsdi",
            "timestamp": 1603145761.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "Nigeria Leaders have failed to provide quality leadership  Ortom",
            "link": "https://nigeriannewsdirect.com/nigeria-leaders-have-failed-to-provide-quality-leadership-ortom/",
            "description": "…Says End SARS protest an opportunity to fix Nigeria By Titus Atondu, Makurdi Benue State Governor Samuel Ortom has disclosed that over the years Nigerian leaders at all levels have failed to provide the standard of leadership that the country deserves and until they leaders must admit the failure and take steps to effect positive […]\nThe post Nigeria Leaders have failed to provide quality leadership – Ortom appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603145597.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "Benue SUBEB Boss tasks Principals, Head Teachers on adherence to COVID-19 Protocols",
            "link": "https://nigeriannewsdirect.com/benue-subeb-boss-tasks-principals-head-teachers-on-adherence-to-covid-19-protocols/",
            "description": "By Titus Atondu, Makurdi In the bid to stop the spread of COVID-19 Pandemic among the students and pupils of Junior Secondary Schools and Public Primary Schools across the twenty three local government areas of Benue State, the Executive Chairman Benue State Universal Basic Education Board( SUBEB), Comrade Joseph Utse has tasked Principals and Head […]\nThe post Benue SUBEB Boss tasks Principals, Head Teachers on adherence to COVID-19 Protocols appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603145405.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "NITDA educates Nigerians on cyber-consciousness",
            "link": "https://nigeriannewsdirect.com/nitda-educates-nigerians-on-cyber-consciousness/",
            "description": "Due to the growing rate of dependence on technology, the increasing rate of cyber-attacks, the National Information Technology Development Agency (NITDA) has educated Nigerians on cyber-consciousness, how to stay safe and be more secure online. The Director General of NITDA, Mr. Kashifu Inuwa Abdullahi stated this in the national Cyber security Awareness Virtual Summit 2020 […]\nThe post NITDA educates Nigerians on cyber-consciousness appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603145308.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "EndSARS Attack: Osun APC blows hot on PDP",
            "link": "https://nigeriannewsdirect.com/endsars-attack-osun-apc-blows-hot-on-pdp/",
            "description": "Says claim is irrational, disgusting Abimbola Abatta, Osogbo The All Progressives Congress (APC) in Osun state has berated the opposition PDP in the state over its comment on #EndSars protesters’ attack on Governor Gboyega Oyetola and his entourage, describing PDPs claim as illogical, empty and far from the reality. Osun PDP claimed that political thugs […]\nThe post EndSARS Attack: Osun APC blows hot on PDP appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603145138.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "#End SARS protest: Speak to your children now, Segun Showunmi urges Buhari",
            "link": "https://nigeriannewsdirect.com/end-sars-protest-speak-to-your-children-now-segun-showunmi-urges-buhari/",
            "description": "\\ Bankole Taiwo, Abeokuta Mr Segun Showunmi on Monday, in Abeokuta called on President Muammadu Buhari to de-escalate the ongoing End SARS protest by speaking to the Nigerian youths saying that no good father would look the other way when his children had for over 10 days been under the scorching sun seeking for his […]\nThe post #End SARS protest: Speak to your children now, Segun Showunmi urges Buhari appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603144899.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "Ogun govt begins rehabilitation of roads in state owned institutions",
            "link": "https://nigeriannewsdirect.com/ogun-govt-begins-rehabilitation-of-roads-in-state-owned-institutions/",
            "description": "Bankole Taiwo, Abeokuta Ogun State government said it has began immediate rehabilitation of roads in all the state’s owned tertiary Institutions to enhance their infrastructural development and make life easier for the students and academic community. The Commissioner for Works and Infrastructure, Engr. Ade Akinsanya confirmed this in a statement issued by his Media aide, […]\nThe post Ogun govt begins rehabilitation of roads in state owned institutions appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603144882.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "#EndSARS: Abiodun inugurates judicial panel against police brutality",
            "link": "https://nigeriannewsdirect.com/endsars-abiodun-inugurates-judicial-panel-against-police-brutality/",
            "description": "…as protesters blocked major roads in Abeokuta, Ijebu Ode, Sango-Ota, Sagamu Bankole Taiwo, Abeokuta Ogun State Governor, Prince Dapo Abiodun on Monday inaugurated the State Judiciary Panel of Investigation on the #End SARS protest with a call on members to make fairness, firmness, dedication and objectivity their watchwords. The judicial panel is headed by Justice […]\nThe post #EndSARS: Abiodun inugurates judicial panel against police brutality appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603144648.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "Osun: After Attack on Governor Oyetola, protesters threaten to shut down economy, school",
            "link": "https://nigeriannewsdirect.com/osun-after-attack-on-governor-oyetola-protesters-threaten-to-shut-down-economy-school/",
            "description": "Demand Fuel, Electricity Reversal Say, when people say yes, nobody can say no’ Abimbola Abatta, Osogbo After hoodlums hijacked the #EndSARS protest in Osun, pouncing on the chaos to attack the State Governor, Mr Gboyega Oyetola, several protesters have re-converged on Monday, stating that they would shut down the economy as well as schools in […]\nThe post Osun: After Attack on Governor Oyetola, protesters threaten to shut down economy, school appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603144509.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "Judiciary postpones Legal Year",
            "link": "https://nigeriannewsdirect.com/judiciary-postpones-legal-year/",
            "description": "As EndSARS protest bars court sittings Abimbola Abatta, Osogbo Court sittings at the Osun State Judiciary were on Monday postponed due to the fierce attacks and lootings by hoodlums in Osogbo at the weekend. Recall that some thugs hijacked the EndSARS protest and hurled stones on Governor Gboyega Oyetola during the weekend. On a visit […]\nThe post Judiciary postpones Legal Year appeared first on Nigeriannewsdirectcom.",
            "timestamp": 1603144011.0,
            "image": null,
            "author": "NewsDirect"
        },
        {
            "title": "Mrs. Furera Isma Jumare resigns from the board of Union Bank",
            "link": "https://www.nigerianbanker.com/mrs-furera-isma-jumare-resigns-from-the-board-of-union-bank/?utm_source=rss&utm_medium=rss&utm_campaign=mrs-furera-isma-jumare-resigns-from-the-board-of-union-bank",
            "description": "Union Bank Plc has notified the public of the resignation of Mrs. Furera Isma Jumare an Independent Non Executive Director from the Board of the bank. Mrs. Jumane’s resignation was in line with Central Bank of Nigeria (CBN) guidelines as she will be joining the Civil Service as Jigawa State as The state’s Director General […]",
            "timestamp": 1603137197.0,
            "image": null,
            "author": "Nigerianbanker"
        },
        {
            "title": "#EndSARS: Six killed as miscreants went berserk, vandalise vehicles, houses, shops in Apo",
            "link": "https://businessday.ng/lead-story/article/endsars-six-killed-as-miscreants-went-berserk-vandalise-vehicles-houses-shops-in-apo/",
            "description": "What initially looks like a peaceful protest by the #EndSARS protesters later degenerated into a clash between the protesters and hoodlums at the Apo Mechanic Village, Abuja leading to the death of six people. The six people were said to be burnt by the miscreants who appeared and accosted the peaceful protesters at Kabusa junction. […]",
            "timestamp": 1603143313.0,
            "image": "https://businessday.ng/wp-content/uploads/2020/10/img-222.jpg",
            "author": "Dozie Emmanuel, Abuja"
        },
        {
            "title": "Police assures adequate security, safety for Easter celebration in Anambra",
            "link": "https://businessday.ng/uncategorized/article/police-assures-adequate-security-safety-for-easter-celebration-in-anambra/",
            "description": "The Anambra State Police Command has assured the citizens of the state and residents alike of adequate security to ensure peaceful Easter celebration. A statement by the command’s Police Public Relations Officers, Haruna Mohammed on Sunday in Awka, said the public was assured of its commitment to ensure safety and security before, during and after […]",
            "timestamp": 1603141835.0,
            "image": "https://businessday.ng/wp-content/uploads/2019/04/Nigeria-Police-Force.jpg",
            "author": "akudo.okoro"
        },
        {
            "title": "German prosecutors charge former Volkswagen chief with fraud",
            "link": "https://businessday.ng/financial-times/article/german-prosecutors-charge-former-volkswagen-chief-with-fraud/",
            "description": "German prosecutors have charged former Volkswagen chief executive Martin Winterkorn and four other people with fraud for their alleged role in the decade-long diesel scandal. The indictment from prosecutors based in Braunschweig, near VWs Wolfsburg headquarters, marks the first time a VW board member has been charged in Germany. Former Audi CEO Rupert Stadler was […]",
            "timestamp": 1603140300.0,
            "image": "https://businessday.ng/wp-content/uploads/2017/11/A-memo-from-Bonn.jpg",
            "author": "Ifeoluwa Awosoji"
        },
        {
            "title": "Governor Uzodimma inaugurates 17-man Judicial Panel on #EndSARS",
            "link": "https://businessday.ng/news/article/governor-uzodimma-inaugurates-17-man-judicial-panel-on-endsars/",
            "description": "Governor of Imo State, Senator Hope Uzodimma has inaugurated a Judicial Panel of Inquiry that will look into alleged police brutality and related extrajudicial killings in the State with an appeal to the protesting youths on #EndSARS and others hurt by the activities of the disbanded formation to take advantage of the Commission to get […]",
            "timestamp": 1603140041.0,
            "image": "https://businessday.ng/wp-content/uploads/2020/10/Hope.jpg",
            "author": "Iheanyi Nwachukwu"
        },
        {
            "title": "#EndSARS: Ebonyi Government to setup judicial panel of inquiry",
            "link": "https://businessday.ng/news/article/endsars-ebonyi-government-to-setup-judicial-panel-of-inquiry/",
            "description": "Ebonyi state Governor Engr. David Umahi Monday addressed Nigeria youths on #EndSARS protest in Abakaliki the Ebonyi State capital with the promise to set up a judicial panel of inquiry on Tuesday, October 20th. The Governor’s address came after the protesters blocked the Government house gate from 10 am to about 3 pm demanding that […]",
            "timestamp": 1603138976.0,
            "image": "https://businessday.ng/wp-content/uploads/2020/10/Untitled-design-2020-10-19T211731.942.png",
            "author": "Nkechinyere Oginiyi"
        },
        {
            "title": "Legacy Global Summit 2020",
            "link": "https://businessday.ng/sponsored/article/legacy-global-summit-2020/",
            "description": "The Legacy Global summit is a virtual conference and an inter-generational bridge builder for emerging entrepreneurs and government agencies looking to access capital and investment deals. The summit is organised by The Legacy Premier Foundation, a Global Non-Profit Organisation passionate about offering dynamic solutions to socio-economic issues faced by industries, corporations, and developing nations, by […]",
            "timestamp": 1603136209.0,
            "image": null,
            "author": "BusinessDay"
        },
        {
            "title": "#EndSARS protest: Lagos shuts schools",
            "link": "https://businessday.ng/lead-story/article/endsars-protest-lagos-shuts-schools/",
            "description": "Lagos State government has directed all pupils/students in public and private schools to stay at home following the tension generated by the anti- SARS protests. The state commissioner for education, Folasade Adefisayo, who issued the directive on Monday, said the safety of the pupils/students, parents and all staff working in schools is paramount at this […]",
            "timestamp": 1603134363.0,
            "image": "https://businessday.ng/wp-content/uploads/2020/09/Kwara-schools.png",
            "author": "Joshua Bassey"
        },
        {
            "title": "#EndSARS#: Activities paralysed in Ibadan as protests spread",
            "link": "https://businessday.ng/news/article/endsars-activities-paralysed-in-ibadan-as-protests-spread/",
            "description": "Commercial activities were paralysed in Ibadan, the Oyo state capital as well as some cities in the state as the youths continued with the EndSARS protests. The protests spread to Ogbomosho, Oyo, and other towns in the state on Monday. The youths blocked major roads within the ancient city on Monday including link roads to […]",
            "timestamp": 1603131037.0,
            "image": "https://businessday.ng/wp-content/uploads/2020/10/Untitled-design-2020-10-19T190932.420.png",
            "author": "Remi Feyisipo"
        },
        {
            "title": "#EndSARS: Gov Abiodun inaugurates judiciary panel, tasks members on fairness, firmness",
            "link": "https://businessday.ng/news/article/endsars-gov-abiodun-inaugurates-judiciary-panel-tasks-members-on-fairness-firmness/",
            "description": "Governor Dapo Abiodun of Ogun state has inaugurated the State Judiciary Panel of Investigation on the #ENSARS protest with a call on members to make fairness, firmness, dedication and objectivity their watchwords. The Governor spoke while inaugurating the panel in his office at Oke-Mosan, Abeokuta. He enjoined the Panel to shun all acts which could […]",
            "timestamp": 1603130456.0,
            "image": "https://businessday.ng/wp-content/uploads/2020/10/Abiodun.jpg",
            "author": "Razaq Ayinla"
        },
        {
            "title": "Akwa Ibom raises judicial panel to investigate rights violations by police",
            "link": "https://businessday.ng/news/article/akwa-ibom-raises-judicial-panel-to-investigate-rights-violations-by-police/",
            "description": "Akwa Ibom government has raised an eight-member judicial panel to investigate police brutality which has sparked a nationwide protest with other demands including the restructuring of the country and good governance. This is coming after protesters calling for the end to killings by police blocked major roads in Uyo, the state capital. Emmanuel Ekuwem, secretary […]",
            "timestamp": 1603130425.0,
            "image": "https://businessday.ng/wp-content/uploads/2020/10/Untitled-design-2020-10-19T185814.881.png",
            "author": "Aniefiok Udonquak"
        },
        {
            "title": "North-West stakeholders commend UNDP, DCC for NDC business roundtable",
            "link": "https://authorityngr.com/2020/10/19/north-west-stakeholders-commend-undp-dcc-for-ndc-business-roundtable/?utm_source=rss&utm_medium=rss&utm_campaign=north-west-stakeholders-commend-undp-dcc-for-ndc-business-roundtable",
            "description": "Chuks Oyema-Aziken The United Nations Development Programme (UNDP) and Department of Climate Change (DCC), Federal Ministry of Environment have received commendation for the just concluded North-West Regional Nationally Determined Contribution (NDC) Business Roundtable. UNDP and DCC was commended for bringing the discourse closer to the critical sectors-small businesses. The 2-day...\nThe post North-West stakeholders commend UNDP, DCC for NDC business roundtable appeared first on THE AUTHORITY NE",
            "timestamp": 1603142932.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "FG, NAGGW flags of empowerment programme in frontline states",
            "link": "https://authorityngr.com/2020/10/19/fg-naggw-flags-of-empowerment-programme-in-frontline-states/?utm_source=rss&utm_medium=rss&utm_campaign=fg-naggw-flags-of-empowerment-programme-in-frontline-states",
            "description": "Chuks Oyema-Aziken The Federal Government has flagged off skill acquisition and entrepreneurship training for youths and women in the frontline states hard hit by the devastating effects of desertification and land degradation caused partly by human activities. The training been anchored by the National Agency for the Great Green Wall...\nThe post FG, NAGGW flags of empowerment programme in frontline states appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603141843.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Fitch Revises UBA Cameroons Outlook to Stable; Affirms at B-",
            "link": "https://businesstodayng.com/fitch-revises-uba-cameroons-outlook-to-stable-affirms-at-b/?utm_source=rss&utm_medium=rss&utm_campaign=fitch-revises-uba-cameroons-outlook-to-stable-affirms-at-b",
            "description": "October 19, 2020/Fitch Ratings Fitch Ratings has revised UBA Cameroon S.As (UBA CAM) Outlook to Stable from Negative while affirming the Long-Term Issuer Default Rating (IDR) at B-. Fitch has also affirmed the banks Short-Term IDR at B and Support Rating (SR) at 5. UBA CAMs Viability Rating (VR) of b- is unaffected by this …\nThe post Fitch Revises UBA Cameroons Outlook to Stable; Affirms at B- appeared first on Business Today NG.",
            "timestamp": 1603140509.0,
            "image": null,
            "author": "Nkechi Naeche"
        },
        {
            "title": "Fitch Revises UBA Senegals Outlook to Stable; Affirms at B-",
            "link": "https://businesstodayng.com/fitch-revises-uba-senegals-outlook-to-stable-affirms-at-b/?utm_source=rss&utm_medium=rss&utm_campaign=fitch-revises-uba-senegals-outlook-to-stable-affirms-at-b",
            "description": "October 19, 2020/Fitch Ratings Image Credit: UBA PlcFitch Ratings has revised UBA Senegals (UBA SEN) Outlook to Stable from Negative while affirming the Long-Term Issuer Default Rating (IDR) at B-. UBA SENs Viability rating (VR) of b- is unaffected by this rating action. A full list of rating actions is provided below. This follows the …\nThe post Fitch Revises UBA Senegals Outlook to Stable; Affirms at B- appeared first on Business Today NG.",
            "timestamp": 1603140300.0,
            "image": null,
            "author": "Nkechi Naeche"
        },
        {
            "title": "Sunu Assurances Applies For Share Reconstruction To Cancel 4 Existing Shares Out Of 5 Held",
            "link": "https://businesstodayng.com/sunu-assurances-applies-for-share-reconstruction-to-cancel-4-existing-shares-out-of-5-held/?utm_source=rss&utm_medium=rss&utm_campaign=sunu-assurances-applies-for-share-reconstruction-to-cancel-4-existing-shares-out-of-5-held",
            "description": "BY NKECHI NAECHE-ESEZOBOR-Sunu Assurances Nigeria Plc on Monday said it has applied for the share capital reconstruction to The Nigerian Stock Exchange. This is following the special resolutions passed by the shareholders of at its at the Extra-Ordinary General Meeting (EGM) held in March2020 in favour of the Companys proposal to carry out a share …\nThe post Sunu Assurances Applies For Share Reconstruction To Cancel 4 Existing Shares Out Of 5 Held appeared first on Business Today NG.",
            "timestamp": 1603139550.0,
            "image": null,
            "author": "Nkechi Naeche"
        },
        {
            "title": "Handwashing most effective against Covid-19  Minister",
            "link": "https://authorityngr.com/2020/10/19/handwashing-most-effective-against-covid-19-minister/?utm_source=rss&utm_medium=rss&utm_campaign=handwashing-most-effective-against-covid-19-minister",
            "description": "– FMEnv donates safety materials to Kuje Correctional Centre Chuks Oyema-Aziken Minister of Environment, Dr. Mohammed Abubakar has described handwashing as the most effective check against the Coronavirus pandemic. The Minister stated this at a press briefing to commemorate the 2020 Global hand washing day. The theme for the year...\nThe post Handwashing most effective against Covid-19 – Minister appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603141588.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "We are not recruiting  NOUN",
            "link": "https://authorityngr.com/2020/10/19/we-are-not-recruiting-noun/?utm_source=rss&utm_medium=rss&utm_campaign=we-are-not-recruiting-noun",
            "description": "By Felix Khanoba The National Open University of Nigeria (NOUN) has dismissed reports making rounds in some quarters that the institution has begun a recruitment process to shore up its staff strength. The University, which accused two online platforms, notorious for fake news, for being behind the false recruitment report,...\nThe post We are not recruiting – NOUN appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603141330.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "China establishes monitoring and assistance mechanism to prevent reoccurrence of poverty",
            "link": "https://authorityngr.com/2020/10/19/china-establishes-monitoring-and-assistance-mechanism-to-prevent-reoccurrence-of-poverty/?utm_source=rss&utm_medium=rss&utm_campaign=china-establishes-monitoring-and-assistance-mechanism-to-prevent-reoccurrence-of-poverty",
            "description": "Thanks to the policy of the government, I feel more secure about getting rid of poverty, said Fu Huaiqin, a resident in Heshunhui village, Weixian county, north Chinas Hebei province. The man was diagnosed with a bladder tumor last year. Although medical insurance was able to cover a part of...\nThe post China establishes monitoring and assistance mechanism to prevent reoccurrence of poverty appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603141098.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Chinas FY satellites contributes to production, lifts peoples livelihood",
            "link": "https://authorityngr.com/2020/10/19/chinas-fy-satellites-contributes-to-production-lifts-peoples-livelihood/?utm_source=rss&utm_medium=rss&utm_campaign=chinas-fy-satellites-contributes-to-production-lifts-peoples-livelihood",
            "description": "According to China Meteorological Administration (CMA), 4 to 5 typhoons might be generated in northwest Pacific Ocean and the South China Sea, and 1 or 2 of them could possibly hit or have an obvious impact on the coastal areas in south China. However, forecasters are not frightened by the...\nThe post China’s FY satellites contributes to production, lifts people’s livelihood appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603138327.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Rep drum support to #ENDSARS protest",
            "link": "https://authorityngr.com/2020/10/19/rep-drum-support-to-endsars-protest/?utm_source=rss&utm_medium=rss&utm_campaign=rep-drum-support-to-endsars-protest",
            "description": "By Gift Chapi Odekina A member representing Jos East/South Federal Constituency of Plateau State, Rep. Musa Dachung on Monday drumed support to the #EndSARS protests taking place across the country. Bagos, who gave his support on Monday at a press conference in Abuja, stated that he was speaking on behalf...\nThe post Rep drum support to #ENDSARS protest appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603138175.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "NMA calls for review of hazard allowance for doctors, health workers",
            "link": "https://authorityngr.com/2020/10/19/nma-calls-for-review-of-hazard-allowance-for-doctors-health-workers/?utm_source=rss&utm_medium=rss&utm_campaign=nma-calls-for-review-of-hazard-allowance-for-doctors-health-workers",
            "description": "…PPP, health bank, compulsory health insurance, panacea to accessible, affordable healthcare By Hassan Zaggi The President, Nigeria Medical Association (NMA), Prof. Innocent Ujah, has advocated for the upward review of what he described as, the current abysmally poor hazard allowance paid to medical doctors and other frontline health workers in...\nThe post NMA calls for review of hazard allowance for doctors, health workers appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603137700.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Chinas foreign trade up 0.7 percent in first three quarters of 2020",
            "link": "https://authorityngr.com/2020/10/19/chinas-foreign-trade-up-0-7-percent-in-first-three-quarters-of-2020/?utm_source=rss&utm_medium=rss&utm_campaign=chinas-foreign-trade-up-0-7-percent-in-first-three-quarters-of-2020",
            "description": "China’s foreign trade volume in goods hit 23.12 trillion yuan ($3.44 trillion) in the first three quarters of the year, up 0.7 percent from a year ago, according to statistics released by the country’s customs. Exports grew 1.8 percent to 12.71 trillion yuan and imports dropped 0.6 percent to 10.41...\nThe post China’s foreign trade up 0.7 percent in first three quarters of 2020 appeared first on THE AUTHORITY NEWS.",
            "timestamp": 1603132980.0,
            "image": null,
            "author": "Editor"
        },
        {
            "title": "Police brought thugs to attack #EndSARS Protesters in Abuja  Eyewitness [VIDEO]",
            "link": "https://politicsnigeria.com/police-brought-thugs-to-attack-endsars-protesters-in-abuja-eyewitness-video/",
            "description": "An Eyewitness report on Monday alleged that officers of the Nigerian Police Force conveyed thugs to attack #EndSARS protesters in Abuja. In a video footage shared by former Presidential media aide, Reno Omokri, the eyewitness revealed that the protest was going on peacefully until police officers arrived the scene with two trucks filled with armed …\nThe post “Police brought thugs to attack #EndSARS Protesters in Abuja” – Eyewitness [VIDEO] appeared first on Politics Nigeria.",
            "timestamp": 1603137083.0,
            "image": "https://politicsnigeria.com/wp-content/uploads/2020/10/police-1024x576.jpg",
            "author": "Politics Nigeria"
        },
        {
            "title": "Buhari is using thugs to disrupt #EndSARS protests  Fani Kayode",
            "link": "https://politicsnigeria.com/buhari-is-using-thugs-to-disrupt-endsars-protests-fani-kayode/",
            "description": "Former Aviation Minister, Femi Fani-Kayode has accused President Muhammadu Buhari of using thugs to disrupt #EndSARS Protests in Abuja and other parts of the country. FFK, a known critic of the Buhari administration, in a series of tweets on his social media page accused the president of using hoodlums to also attack protesters. His comments …\nThe post “Buhari is using thugs to disrupt #EndSARS protests” – Fani Kayode appeared first on Politics Nigeria.",
            "timestamp": 1603133129.0,
            "image": "https://politicsnigeria.com/wp-content/uploads/2020/10/femi-fani-kayode.jpg",
            "author": "Dumebi Emmanuel"
        },
        {
            "title": "BREAKING: President Buhari sacks NCC chairman, Tonye Jaja",
            "link": "https://politicsnigeria.com/breaking-president-buhari-sacks-ncc-chairman-tony-jaja/",
            "description": "President Muhammadu Buhari has approved the removal of Nigerian Copyright Commission(NCC) Board chairman, Tonye Jaja with immediate effect. Jaja’s removal was contained in an October 15 letter signed by Dayo Apata, the Solicitor General. He was ordered to return all properties of the commission in his possession to the Director-General of the commission, John Asien. …\nThe post BREAKING: President Buhari sacks NCC chairman, Tonye Jaja appeared first on Politics Nigeria.",
            "timestamp": 1603132249.0,
            "image": "https://politicsnigeria.com/wp-content/uploads/2020/10/Screenshot-2020-10-19-at-7.30.12-PM.png",
            "author": "Olugbenga Ige"
        },
        {
            "title": "BREAKING: #EndSARS protest is a plot to overthrow Buhari  Miyetti Allah, attacks Tinubu",
            "link": "https://politicsnigeria.com/breaking-endsars-protest-is-a-plot-to-overthrow-buhari-miyetti-allah-attacks-tinubu/",
            "description": "Fulani Pastoral Group, Miyetti Allah has described the #EndSARS protests as part of a plot by some Southern Politicians to overthrow President Muhammadu Buhari and force the North to give up its ‘right’ to contest for 2023 Elections. In a statement made available to POLITICS NIGERIA, jointly signed by the President and Secretary of the …\nThe post BREAKING: “#EndSARS protest is a plot to overthrow Buhari” – Miyetti Allah, attacks Tinubu appeared first on Politics Nigeria.",
            "timestamp": 1603124577.0,
            "image": "https://politicsnigeria.com/wp-content/uploads/2019/04/Tinubu-24-4-19-1024x576.jpg",
            "author": "Politics Nigeria"
        },
        {
            "title": "Dele-Giwa: My father would be proud of Nigerian youths  Daughter",
            "link": "https://lailasnews.com/dele-giwa-my-father-would-be-proud-of-nigerian-youths-daughter/",
            "description": "Nigeria News | Laila's Blog\nDele-Giwa: My father would be proud of Nigerian youths – Daughter\nAyodele Dele-Giwa, the daughter of the late Nigerian journalist Dele-Giwa who was assassinated with a letter bomb in 1986, has […] Read More >>\nDele-Giwa: My father would be proud of Nigerian youths – Daughter\nSanya Agunbiade",
            "timestamp": 1603140866.0,
            "image": null,
            "author": "Sanya Agunbiade"
        },
        {
            "title": "Cars Set On Fire As Armed Thugs, Protesters Clash At #EndSARS Rally In Abuja",
            "link": "http://onobello.com/cars-set-on-fire-as-armed-thugs-protesters-clash-at-endsars-rally-in-abuja/",
            "description": "What started as a peaceful#EndSARS rally in Abuja Mondayended with allegedly over 200 vehicles on fire, tear gas deployed, protesters being attacked by the police, and more destruction. Therally coincided with similar violent events that have been going on inthe country’s capital around the country in theaftermath of Special Anti-Robbery Squad’s disbandment. According to Punch,…",
            "timestamp": 1603126199.0,
            "image": null,
            "author": "Style Writer"
        },
        {
            "title": "#EndSARS: Governor Sanwo-Olu Swears In Lagos Judicial Panel, Commences Hearing",
            "link": "http://onobello.com/endsars-governor-sanwo-olu-swears-in-lagos-judicial-panel-commences-hearing/",
            "description": "Lagos governor, Babajide Sanwo-Oluhosted the swearing in ofa Judicial Panel of Inquiry and Restitutionwhich he recently formed to inquirecases of human rights abuses byofficialsof the now-defunct police tactical unit, Special Anti-Robbery Squad (SARS). The panel headed by Justice Doris Okuwobi of the Lagos State High Court was sworn in on Monday at the Lagos House,…",
            "timestamp": 1603124105.0,
            "image": null,
            "author": "Style Writer"
        },
        {
            "title": "Lagos state government shuts down all schools over #EndSARS protests",
            "link": "http://misspetitenaijablog.com/2020/10/19/lagos-state-government-shuts-down-all-schools-over-endsars-protests/",
            "description": "The Lagos State Government has ordered the closure of public and private schools in the state indefinitely. This was announced in a press statement by the states Head of Public Affairs, Ministry of Education, Kayode Abayomi, on Monday. The statement was titled, Lagos directs students to stay at home. It quoted the Commissioner for Education, […]\nThe post Lagos state government shuts down all schools over #EndSARS protests appeared first on Miss Petite Nigeria Blog.",
            "timestamp": 1603141462.0,
            "image": null,
            "author": "Olalekan Ajimoti"
        },
        {
            "title": "Nigerian Embassy In France Calls Police On EndSARS Protesters",
            "link": "http://misspetitenaijablog.com/2020/10/19/nigerian-embassy-in-france-calls-police-on-endsars-protesters/",
            "description": "The Nigerian Embassy in Paris, France, has called the police on young citizens demanding an end to police brutality and bad governance in Nigeria. Despite the presence of the French police, the demonstrators, who stormed the embassy at the Victor Hugo area of Paris in large numbers, insisted on seeing the ambassador of Nigeria to […]\nThe post Nigerian Embassy In France Calls Police On EndSARS Protesters appeared first on Miss Petite Nigeria Blog.",
            "timestamp": 1603140036.0,
            "image": null,
            "author": "Olalekan Ajimoti"
        },
        {
            "title": "Tinubu Is Using EndSARS Protest As A Plot To Overthrow Buhari  Miyetti Allah",
            "link": "http://misspetitenaijablog.com/2020/10/19/tinubu-is-using-endsars-protest-as-a-plot-to-overthrow-buhari-miyetti-allah/",
            "description": "Fulani Pastoral Group, Miyetti Allah has described the #EndSARS protests as part of a plot by some Southern Politicians to overthrow President Muhammadu Buhari and force the North to give up its ‘right’ to contest for 2023 Elections. In a statement made available to POLITICS NIGERIA, jointly signed by the President and Secretary of the […]\nThe post Tinubu Is Using EndSARS Protest As A Plot To Overthrow Buhari – Miyetti Allah appeared first on Miss Petite Nigeria Blog.",
            "timestamp": 1603138598.0,
            "image": null,
            "author": "Olalekan Ajimoti"
        },
        {
            "title": "Chadwick Bosemans Wife Applies For Rights To His Multi-million-dollar Estate",
            "link": "http://misspetitenaijablog.com/2020/10/19/chadwick-bosemans-wife-applies-for-rights-to-his-multi-million-dollar-estate/",
            "description": "With Black Panther actor Chadwick Boseman now dead, his wife has turned to the courts to officially claim administrative rights for his multi-million-dollar estate. The case reached Los Angeles courts this Thursday and per a report by Page Six the actors wife has asked for limited authority over his assets. The estimated value of the […]\nThe post Chadwick Bosemans Wife Applies For Rights To His Multi-million-dollar Estate appeared first on Miss Petite Nigeria Blog.",
            "timestamp": 1603136877.0,
            "image": null,
            "author": "Olalekan Ajimoti"
        },
        {
            "title": "Edo Prison Break: Inmates Were Illegally Released By Authorities  Tacha",
            "link": "http://misspetitenaijablog.com/2020/10/19/edo-prison-break-inmates-were-illegally-released-by-authorities-tacha/",
            "description": "Reality star, Natacha Akide aka Tacha has called the prison break in Benin as sabotage by the government in order to disrupt the ongoing #EndSARs peaceful protest. Tacha in a post on Twitter revealed that the government is trying to outsmart the youths by creating a problem that will shut down the peaceful protest against […]\nThe post Edo Prison Break: Inmates Were Illegally Released By Authorities  Tacha appeared first on Miss Petite Nigeria Blog.",
            "timestamp": 1603136071.0,
            "image": null,
            "author": "Olalekan Ajimoti"
        },
        {
            "title": "#ENDSARS: Its Your Right To Protest, Buhari Tells Youths",
            "link": "http://misspetitenaijablog.com/2020/10/19/endsars-its-your-right-to-protest-buhari-tells-youths/",
            "description": "PRESIDENT Muhammadu Buhari on Monday said that it was the right of the youths to protest and make certain demands from their leaders. The President also said that the young generation should be allowed to exercise their fundamental rights, but advised that they should not allow their genuine concerns to be hijacked by hoodlums. This […]\nThe post #ENDSARS: Its Your Right To Protest, Buhari 